{"1":{"w":[{"b":"0.06","h":"0.05","c":"بِسْمِ","d":"bis'mi","e":"dengan nama"},{"b":"0.62","h":"0.52","c":"اللَّهِ","d":"l-lahi","e":"Allah"},{"b":"1.3","h":"1.19","c":"الرَّحْمَنِ","d":"l-raḥmāni","e":"Maha Pengasih"},{"b":"2.4","h":"2.35","c":"الرَّحِيمِ","d":"l-raḥīmi","e":"Maha Penyayang"}],"a":{"g":"In the name of Allah, the Entirely Merciful, the Especially Merciful.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ثم يقول اللهم إني أسألك باسمك بسم الله الرحمن الرحيم وباسمك الذي لا إله إلا الله هو الحي القيوم الذي لا تأخذه سنة ولا نوم لم يسأل الله تعالى شيئا إلا أعطاه\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, I ask You, O Allah, by Your Name, \"In the Name of Allah, the Entirely Merciful, the Especially Merciful [Bismillah ar-Rahman ar-Raheem],\" and by Your Name, \"There is no deity except Allah [La ilaha illa Allah],\" He is the Ever-Living, the Sustainer of existence [Al-Hayy al-Qayyum], whom neither drowsiness overtakes nor sleep. No one asks Allah, the Exalted, for anything by it except that He grants it.\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.08","h":"0.7","c":"الْحَمْدُ","d":"al-ḥamdu","e":"pujian"},{"b":"0.97","h":"1.42","c":"لِلَّهِ","d":"lillahi","e":"bagi Allah"},{"b":"1.8","h":"2.21","c":"رَبِّ","d":"rabbi","e":"Tuhan"},{"b":"2.4","h":"2.89","c":"الْعَالَمِينَ","d":"l-ʿālamīna","e":"alam semesta"}],"a":{"g":"[All] praise is [due] to Allah, Lord of the worlds -","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال بعضهم: رأيت كتابا من محمد بن يوسف إلى عبد الرحمن بن يوسف - سلام عليك فإني أحمد الله إليك الذي لا إله إلا هو. أما بعد فإني أحذرك متحولك من دار مهلتك إلى دار إقامتك وجزاء أعمالك فتصير في قرار باطن الأرض بعد ظاهرها فيأتيك منكر ونكير فيقعدانك وينتهرانك فإن يكن الله معك فلا يأس ولا وحشة ولا فاقة وإن يكن غير ذلك فأعاذني الله وإياك من سوء مَصْرَعِ وضيق مضجع ثم تبلغك صيحة الحشر ونفخ الصور وقيام الجبار لفصل قضاء الخلائق وخلاء الأرض من أهلها والسماوات من سكانها فباحت الأسرار وأسعرت النار ووضعت الموازين وجىء بالنبيين والشهداء وقضى بينهم بالحق وقيل الحمد لله رب العالمين فكم من مفتضح ومستور وكم من هالك وناج وكم من معذب ومرحوم فيا ليت شعري مالى وحالك يومئذ ففي هذا ما هدم اللذات وأسلى عن الشهوات وقصر عن الأمل وأيقظ النائمين وحذر الغافلين أعاننا الله وإياكم على هذا الخطر العظيم وأوقع الدنيا والآخرة من قلبي وقلبك موقعهما من قلوب المتقين فإنما نحن به وله، والسلام.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, some have said: I saw a letter from Muhammad ibn Yusuf to 'Abd al-Rahman ibn Yusuf – Peace be upon you, so I praise Allah [al-Hamd] to you, He besides whom there is no god. As for what follows: I warn you of your transfer from the abode of your respite [dar muhlatik] to the abode of your settlement [dar iqamatik] and the recompense of your deeds, so that you will come to be in the innermost depth of the earth after its surface. Then will come to you Munkar and Nakir, and they will make you sit and rebuke you. So if Allah is with you, then there is no despair, nor loneliness, nor need. But if it is other than that, then I seek refuge in Allah for myself and for you from an evil downfall and a narrow resting place. Then will reach you the Cry of the Gathering [sayhat al-hashr] and the Blast of the Trumpet [nafkh al-sur], and the Rising of the Omnipotent [qiyam al-Jabbar] to judge between the creatures, and the emptying of the earth of its inhabitants and the heavens of their dwellers. Then the secrets will be laid bare, and the Fire will be kindled, and the Scales will be set up, and the Prophets and the witnesses will be brought forth, and He will judge between them with truth, and it will be said: \"All praise is to Allah, Lord of the worlds [al-Hamd li-Allahi Rabb al-'Alamin].\" So how many will be disgraced and how many concealed! And how many will be destroyed and how many saved! And how many will be punished and how many shown mercy! So, I wonder, what will be my state and your state on that day? In this is what demolishes pleasures, consoles one from lusts, shortens hopes, awakens the sleepers, and warns the heedless. May Allah aid us and you against this immense peril, and place the world [al-dunya] and the Hereafter [al-akhirah] in my heart [qalb] and your heart at their rightful place in the hearts of the God-fearing [al-muttaqin]. For we are only by Him and for Him. And peace.\n            </div>\n        </div>\n        "}},"3":{"w":[{"b":"0.04","h":"0.15","c":"الرَّحْمَنِ","d":"al-raḥmāni","e":"Maha Pengasih"},{"b":"1.2","h":"1.41","c":"الرَّحِيمِ","d":"l-raḥīmi","e":"Maha Penyayang"}],"a":{"g":"The Entirely Merciful, the Especially Merciful,","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                رواه عن النبي ﭬ أنه قال: (إن الله تعالى يمجد نفسه كل يوم ويقول إني أنا الله رب العالمين إني أنا الله لا إله إلا أنا الحي القيوم إني أنا الله لا إله إلا أنا العلي العظيم إني أنا الله لا إله إلا أنا لم ألد ولم أولد إني أنا الله لا إله إلا أنا العفو الغفور إني أنا الله لا إله إلا أنا مبدىء كل شيء وإلي يعود العزيز الحكيم الرحمن الرحيم مالك يوم الدين خالق الخير والشر خالق الجنة والنار الواحد الأحد الفرد الصمد الذي لم يتخذ صاحبة ولا ولدا الفرد الوتر عالم الغيب والشهادة الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر الخالق البارىء المصور الكبير المتعال المقتدر القهار الحليم الكريم أهل الثناء والمجد أعلم السر وأخفى القادر الرزاق فوق الخلق والخليقة[135]). وذكر قبل كل كلمة إني أنا الله لا إله إلا أنا كما أوردناه في الأول فمن دعا بهذه الأسماء فليقل إنك أنت الله لا إله إلا أنت كذا وكذا فمن دعا بهن كتب من الساجدين المخبتين الذين يجاورون محمدا وإبراهيم وموسى وعيسى والنبيين صلوات الله عليهم في دار الجلال وله ثواب العابدين في السموات والأرضين وصلى الله على محمد وعلى كل عبد مصطفى.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, it is narrated from the Prophet, peace be upon him, that he said: \"Indeed, Allah the Exalted glorifies Himself every day and says: 'Indeed, I am Allah, Lord of the worlds [Rabb al-'alamin]. Indeed, I am Allah, there is no god but I, the Ever-Living, the Sustainer of existence [Al-Hayy al-Qayyum]. Indeed, I am Allah, there is no god but I, the Most High, the Most Great [Al-'Ali al-'Azim]. Indeed, I am Allah, there is no god but I, I have not begotten, nor was I begotten. Indeed, I am Allah, there is no god but I, the Pardoner, the Forgiving [Al-'Afuw al-Ghafur]. Indeed, I am Allah, there is no god but I, the Originator of every thing and to Me is its return, the All-Mighty, the All-Wise, the Most Gracious, the Most Merciful, Master of the Day of Recompense [Malik yawm al-din], Creator of good and evil, Creator of Paradise and the Fire, the One, the Unique, the Single, the Eternal Refuge [Al-Samad] who has taken neither a consort nor a son, the Single, the Odd, Knower of the unseen and the witnessed, the Sovereign, the Holy, the Source of Peace, the Guardian of Faith, the Overseer, the All-Mighty, the Compeller, the Supreme, the Creator, the Evolver, the Fashioner, the Most Great, the Most Exalted, the Omnipotent, the Subduer, the Forbearing, the Generous, the Possessor of Praise and Glory, Knower of the secret and what is more hidden, the All-Powerful, the Provider, above the creation and the creatures.'\" And \"Indeed, I am Allah, there is no god but I\" was mentioned before every word, just as we have presented it at the beginning. So whoever supplicates with these names, let him say: \"Indeed, You are Allah, there is no god but You, such and such...\" So whoever supplicates with them is recorded among the prostrating, humble ones who will be neighbors to Muhammad, and Ibrahim, and Musa, and 'Isa, and the prophets, prayers of Allah be upon them, in the Abode of Majesty, and for him is the reward of the worshippers in the heavens and the earths. And may Allah send prayers upon Muhammad and upon every chosen servant.\n            </div>\n        </div>\n        "}},"4":{"w":[{"b":"0.06","h":"0","c":"مَالِكِ","d":"māliki","e":"Penguasa"},{"b":"0.85","h":"1.05","c":"يَوْمِ","d":"yawmi","e":"hari"},{"b":"1.4","h":"1.67","c":"الدِّينِ","d":"l-dīni","e":"pembalasan"}],"a":{"g":"Sovereign of the Day of Recompense.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                رواه عن النبي ﭬ أنه قال: (إن الله تعالى يمجد نفسه كل يوم ويقول إني أنا الله رب العالمين إني أنا الله لا إله إلا أنا الحي القيوم إني أنا الله لا إله إلا أنا العلي العظيم إني أنا الله لا إله إلا أنا لم ألد ولم أولد إني أنا الله لا إله إلا أنا العفو الغفور إني أنا الله لا إله إلا أنا مبدىء كل شيء وإلي يعود العزيز الحكيم الرحمن الرحيم مالك يوم الدين خالق الخير والشر خالق الجنة والنار الواحد الأحد الفرد الصمد الذي لم يتخذ صاحبة ولا ولدا الفرد الوتر عالم الغيب والشهادة الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر الخالق البارىء المصور الكبير المتعال المقتدر القهار الحليم الكريم أهل الثناء والمجد أعلم السر وأخفى القادر الرزاق فوق الخلق والخليقة[135]). وذكر قبل كل كلمة إني أنا الله لا إله إلا أنا كما أوردناه في الأول فمن دعا بهذه الأسماء فليقل إنك أنت الله لا إله إلا أنت كذا وكذا فمن دعا بهن كتب من الساجدين المخبتين الذين يجاورون محمدا وإبراهيم وموسى وعيسى والنبيين صلوات الله عليهم في دار الجلال وله ثواب العابدين في السموات والأرضين وصلى الله على محمد وعلى كل عبد مصطفى.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, it is narrated from the Prophet, peace be upon him, that he said: \"Indeed, Allah the Exalted glorifies Himself every day and says: 'Indeed, I am Allah, the Lord of the worlds [rabb al-'alamin]. Indeed, I am Allah, there is no god but I, the Ever-Living, the Sustainer of existence [al-Hayy al-Qayyum]. Indeed, I am Allah, there is no god but I, the Most High, the Most Great [al-'Ali al-'Azim]. Indeed, I am Allah, there is no god but I; I have not begotten, nor was I begotten. Indeed, I am Allah, there is no god but I, the Pardoner, the Forgiving [al-'Afuw al-Ghafur]. Indeed, I am Allah, there is no god but I; the Originator of every thing, and to Me is the return, the Almighty, the All-Wise [al-'Aziz al-Hakim], the Most Gracious, the Most Merciful [al-Rahman al-Rahim], the Master of the Day of Judgment [Malik yawm al-din], the Creator of good and evil, the Creator of Paradise and the Fire, the One, the Unique [al-Wahid al-Ahad], the Single, the Self-Sufficient [al-Fard al-Samad] who has taken neither a consort nor a son, the Single, the Odd [al-Fard al-Witr], the Knower of the unseen and the witnessed [alim al-ghayb wa al-shahadah], the Sovereign, the Holy [al-Malik al-Quddus], the Source of Peace, the Guardian of Faith, the Overseer, the Almighty, the Compeller, the Supreme in Greatness, the Creator, the Maker, the Fashioner, the Most Great, the Exalted, the Omnipotent, the Subduer, the Forbearing, the Generous, the Possessor of Praise and Glory, the Knower of the secret and what is more hidden, the All-Powerful, the Provider, above the creation and the created.'\"\n\nAnd He mentions before every phrase, \"Indeed, I am Allah, there is no god but I,\" as we have presented it at the beginning. So whoever supplicates with these names, let him say, \"Indeed, You are Allah, there is no god but You, such and such...\" So whoever supplicates with them is recorded among those who prostrate in humility, those who will be neighbors to Muhammad, and Ibrahim, and Musa, and 'Isa, and the prophets, the prayers of Allah be upon them, in the Abode of Majesty. And for him is the reward of the worshippers in the heavens and the earths. And may Allah send prayers upon Muhammad and upon every chosen servant.\n            </div>\n        </div>\n        "}},"5":{"w":[{"b":"0.03","h":"0.35","c":"إِيَّاكَ","d":"iyyāka","e":"hanya kepadaMu"},{"b":"0.98","h":"1.32","c":"نَعْبُدُ","d":"naʿbudu","e":"kami menyembah"},{"b":"1.7","h":"2.22","c":"وَإِيَّاكَ","d":"wa-iyyāka","e":"dan hanya kepadaMu"},{"b":"2.8","h":"3.52","c":"نَسْتَعِينُ","d":"nastaʿīnu","e":"kami mohon pertolongan"}],"a":{"g":"It is You we worship and You we ask for help.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فالكمال الأول في اللفظ أن يحترز عن صريح اللفظ وعن المعاريض أيضا إلا عند الضرورة والكمال الثاني أن يراعي معنى الصدق في ألفاظه التى يناجي بها ربه كقوله (وجهت وجهي للذي فطر السموات والأرض) فإن قلبه إن كان منصرفا عن الله تعالى مشغولا بأماني الدنيا وشهواته فهو كذب وكقوله (إياك نعبد) وقوله (أنا عبد الله) فإنه إذا لم يتصف بحقيقة العبودية وكان له مطلب سوى الله لم يكن كلامه صدقا ولو طولب يوم القيامة بالصدق في قوله أنا عبد الله لعجز تحقيقه فإنه إن كان عبدا لنفسه أو عبدا لدنيا أو عبدا لشهواته لم يكن صادقا في قوله. وكل ما تقيد العبد به فهو عبد له كما قال عيسى عليه السلام يا عبيد الدنيا وقال نبينا صلى الله عليه وسلم (تعس عبد الدنيا وتعس عبد الدرهم وعبد الحلة وعبد الخميصة) فسمى كل من تقيد قلبه بشىء عبدا له وإنما العبد الحق لله عز وجل من أعتق أولا من غير الله تعالى فصار حرا مطلقا فإذا تقدمت هذه الحرية صار القلب فارغا فحلت فيه العبودية لله فتشغله بالله وبمحبته وتقيد باطنه وظاهره بطاعته فلا يكون له مراد إلا الله تعالى ثم تجاوز هذا إلى مقام آخر أسنى منه يسمى الحرية وهو أن يعتق أيضا عن إرادة الله له من حيث هو بل يقنع بما يريد الله له من تقريب أو إبعاد فتفنى إرادته في إرادة الله تعالى. وهذا عبد عتق عن غير الله فصار حرا ثم عاد وعتق عن نفسه فصار حرا وصار مفقودا لنفسه موجودا لسيده ومولاه إن حركة تحرك وإن سكنه سكن وإن ابتلاه رضي لم يبق فيه متسع لطلب والتماس واعتراض بل هو بين يدي الله كالميت بين يدي الغاسل وهذا منتهى الصدق في العبودية لله تعالى فالعبد الحق هو الذي وجوده لمولاه لا لنفسه وهذه درجة الصديقين. وأما الحرية عن غير الله فدرجات الصادقين وبعدها تتحقق العبودية لله تعالى وما قبل هذا فلا يستحق صاحبه أن يسمى صادقا ولا صديقا فهذا هو معنى الصدق في القول.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the first perfection [kamal] in speech is to guard against explicit falsehood and also against ambiguous implication, except in necessity. And the second perfection is to observe the meaning of truthfulness [sidq] in the words with which he converses with his Lord, like His saying, \"I have turned my face [wajh] to the One who created the heavens and the earth.\" For if his heart [qalb] is turned away from God, exalted is He, preoccupied with the hopes of this world [dunya] and its desires, then it is falsehood. And like his saying, \"You alone we worship,\" and his saying, \"I am the servant ['abd] of God.\" For if he is not characterized by the reality of servitude ['ubudiyya] and has a desire other than God, then his speech is not truthful. And if he were called to account on the Day of Resurrection for the truthfulness in his statement \"I am the servant of God,\" he would be incapable of verifying it. For if he is a servant to his own self [nafs], or a servant to this world, or a servant to his desires, then he is not truthful in his statement. And everything the servant binds himself to, he is a servant to it, as Jesus, peace be upon him, said, \"O servants of the world,\" and our Prophet, peace and blessings be upon him, said, \"Wretched is the servant of the world, wretched is the servant of the dirham, the servant of the garment, and the servant of the fine cloak.\" He named everyone whose heart is bound to something a servant to it. The true servant for God, mighty and majestic, is he who is first freed from other than God, exalted is He, and thus became absolutely free. When this freedom [hurriyya] precedes, the heart becomes empty, and servitude to God settles within it, occupying it with God and His love, and binding his inner and outer being to His obedience, so that he has no object of desire except God, exalted is He. Then he transcends this to another station, more sublime than it, called freedom [hurriyya], which is that he is also freed from desiring God *for himself*; rather, he is content with what God wills for him, be it drawing near or being distanced, so his will [irada] is annihilated in the will of God, exalted is He. This is a servant who was freed from other than God and became free, then returned and was freed from his own self and became free, and became lost to himself, existing for his Master and Lord. If he moves, he moves; if he is still, he is still; if He afflicts him, he is pleased. No room remains in him for seeking, searching, or objection. Rather, he is before God like the dead before the washer. This is the ultimate truthfulness [sidq] in servitude to God, exalted is He. So the true servant is he whose existence is for his Master, not for himself. And this is the station of the truthful ones [siddiqun]. As for freedom from other than God, it is the stations of the truthful ones [sadiqun], and after it, servitude to God, exalted is He, is realized. And before this, its possessor does not deserve to be called truthful [sadiq] nor truthful one [siddiq]. This, then, is the meaning of truthfulness in speech.\n            </div>\n        </div>\n        "}},"6":{"w":[{"b":"0.03","h":"0.3","c":"اهْدِنَا","d":"ih'dinā","e":"tunjukkan kami"},{"b":"0.68","h":"0.88","c":"الصِّرَاطَ","d":"l-ṣirāṭa","e":"jalan"},{"b":"1.6","h":"1.8","c":"الْمُسْتَقِيمَ","d":"l-mus'taqīma","e":"lurus"}],"a":{"g":"Guide us to the straight path -","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ولأجل عسر الاستقامة وجب على كل عبد أن يدعو الله تعالى في كل يوم سبع عشرة مرة في قوله \"اهدنا الصراط المستقيم\" إذ وجب قراءة الفاتحة في كل ركعة. فقد روي أن بعضهم رأى رسول الله ﷺ في المنام فقال: قد قلت يا رسول الله شيبتني هود، فلم قلت ذلك؟ فقال عليه السلام لقوله تعالى \"فاستقم كما أمرت\" فالاستقامة على سواء السبيل في غاية الغموض، ولكن ينبغي أن يجتهد الإنسان في القرب من الاستقامة إن لم يقدر على حقيقتها.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, due to the difficulty of uprightness [istiqamah], it is incumbent upon every servant [abd] to call upon God, exalted is He, seventeen times each day in his saying, \"Guide us to the straight path [sirat al-mustaqim],\" since the recitation of the Opening [al-Fatihah] is incumbent in every unit of prayer [rak'ah]. For it has been narrated that one of them saw the Messenger of God, peace and blessings be upon him, in a dream and said: \"You said, O Messenger of God, 'Surah Hud has aged me,' so why did you say that?\" So he, upon him be peace, said: \"Because of His saying, exalted is He, 'So be upright [fastaqim] as you have been commanded.'\" For uprightness [istiqamah] upon the evenness of the path [sabil] is of the utmost obscurity, but it is necessary for a person to strive in drawing near to uprightness [istiqamah] if he is not capable of its true reality [haqiqah].\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.03","h":"0.45","c":"صِرَاطَ","d":"ṣirāṭa","e":"jalan"},{"b":"0.75","h":"1.21","c":"الَّذِينَ","d":"alladhīna","e":"orang-orang yang"},{"b":"1.7","h":"2.12","c":"أَنْعَمْتَ","d":"anʿamta","e":"diberi nikmat"},{"b":"2.6","h":"3.08","c":"عَلَيْهِمْ","d":"ʿalayhim","e":"kepadanya"},{"b":"3.6","h":"4.23","c":"غَيْرِ","d":"ghayri","e":"bukan"},{"b":"4.2","h":"4.95","c":"الْمَغْضُوبِ","d":"l-maghḍūbi","e":"orang yang dimurkai"},{"b":"5.3","h":"6.21","c":"عَلَيْهِمْ","d":"ʿalayhim","e":"kepadanya"},{"b":"6.3","h":"7.38","c":"وَلَا","d":"walā","e":"dan tidak"},{"b":"6.6","h":"7.7","c":"الضَّالِّينَ","d":"l-ḍālīna","e":"orang-orang yang sesat"}],"a":{"g":"The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray."}}}