{"1":{"w":[{"b":"0.15","h":"0.4","c":"الْقَارِعَةُ","d":"ُẗَʿعِrāَqْlٱ","e":"ُẗَʿعِrāَqْlٱ"}],"a":{"g":"The Striking Calamity -","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ولما قصرت الأفهام عن درك معنى عليين عظم أمره فقال: \" وما أدراك ما عليين \" كما قال تعالى: \" القارعة ما القارعة وما أدراك ما القارعة \".\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, when the understandings [afhām] fell short of grasping the meaning of 'Illiyyūn, the magnitude of its affair was declared, so He said: \"And what will make you know what 'Illiyyūn is?\" just as the Almighty said: \"The Striking Calamity! What is the Striking Calamity? And what will make you know what the Striking Calamity is?\"\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.04","h":"0.48","c":"مَا","d":"āَm","e":"āَm"},{"b":"0.25","h":"0.73","c":"الْقَارِعَةُ","d":"ُẗَʿعِrāَqْlٱ","e":"ُẗَʿعِrāَqْlٱ"}],"a":{"g":"What is the Striking Calamity?"}},"3":{"w":[{"b":"0.04","h":"0.42","c":"وَمَا","d":"ٓāَmَw","e":"ٓāَmَw"},{"b":"0.34","h":"2.44","c":"أَدْرَاكَ","d":"َkٰàَrْdَaʾ","e":"َkٰàَrْdَaʾ"},{"b":"3.6","h":"4.37","c":"مَا","d":"āَm","e":"āَm"},{"b":"3.7","h":"4.73","c":"الْقَارِعَةُ","d":"ُẗَʿعِrāَqْlٱ","e":"ُẗَʿعِrāَqْlٱ"}],"a":{"g":"And what can make you know what is the Striking Calamity?"}},"4":{"w":[{"b":"0.09","h":"0.55","c":"يَوْمَ","d":"َmْwَy","e":"َmْwَy"},{"b":"0.62","h":"1.42","c":"يَكُونُ","d":"ُnwُkَy","e":"ُnwُkَy"},{"b":"1.5","h":"3.18","c":"النَّاسُ","d":"ُsāَّnlٱ","e":"ُsāَّnlٱ"},{"b":"3.0","h":"4.8","c":"كَالْفَرَاشِ","d":"ِhsāَrَfْlٱَk","e":"ِhsāَrَfْlٱَk"},{"b":"4.4","h":"7.07","c":"الْمَبْثُوثِ","d":"ِhtwُhtْbَmْlٱ","e":"ِhtwُhtْbَmْlٱ"}],"a":{"g":"It is the Day when people will be like moths, dispersed,"}},"5":{"w":[{"b":"0.08","h":"0.15","c":"وَتَكُونُ","d":"ُnwُkَtَw","e":"ُnwُkَtَw"},{"b":"1.1","h":"1.89","c":"الْجِبَالُ","d":"ُlāَbِjgْlٱ","e":"ُlāَbِjgْlٱ"},{"b":"2.2","h":"3.6","c":"كَالْعِهْنِ","d":"ِnْhِʿعْlٱَk","e":"ِnْhِʿعْlٱَk"},{"b":"3.3","h":"5.62","c":"الْمَنْفُوشِ","d":"ِhswُfnَmْlٱ","e":"ِhswُfnَmْlٱ"}],"a":{"g":"And the mountains will be like wool, fluffed up."}},"6":{"w":[{"b":"0.05","h":"0.35","c":"فَأَمَّا","d":"āَّmَaʾَf","e":"āَّmَaʾَf"},{"b":"1.9","h":"2.51","c":"مَنْ","d":"nَm","e":"nَm"},{"b":"2.9","h":"3.73","c":"ثَقُلَتْ","d":"ْtَlُqَht","e":"ْtَlُqَht"},{"b":"3.8","h":"5.3","c":"مَوَازِينُهُ","d":"ۥُhُnyِzَٰwَm","e":"ۥُhُnyِzَٰwَm"}],"a":{"g":"Then as for one whose scales are heavy [with good deeds],","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                قد عرفت هول الميزان وخطره وأن الأعين شاخصة إلى لسان الميزان ﴿ فأما من ثقلت موازينه فهو فى عيشة راضية وأما من خفت موازينه فأمه هاوية وما أدراك ماهيه نار حامية ﴾ واعلم أنه لا ينجو من خطر الميزان إلا من حاسب فى الدنيا نفسه ووزن فيها بميزان الشرع أعماله وأقواله وخطراته ولحظاته كما قال عمر رضى الله عنه: حاسبوا أنفسكم قبل أن تحاسبوا وزنوها قبل أن توزنوا وإنما حسابه لنفسه أن يتوب عن كل معصية قبل الموت توبة نصوحا ويتدارك ما فرط من تقصيره فى فرائض الله تعالى ويرد المظالم حبة بعد حبة ويستحل كل من تعرض له بلسانه ويده وسوء ظنه بقلبه وبطيب قلوبهم حتى يموت ولم يبق عليه مظلمة ولا فريضة فهذا يدخل الجنة بغير حساب وإن مات قبل رد المظالم أحاط به خصماؤه فهذا يأخذ بيده وهذا يقبض على ناصيته وهذا يتعلق بلببه هذا يقول ظلمتنى وهذا يقول شتمتنى وهذا يقول استهزأت بى وهذا يقول ذكرتنى فى الغيبة بما يسوءنى وهذا يقول جاورتنى فأسأت جوارى وهذا يقول عاملتنى فغششتنى وهذا يقول بايعتنى فغبنتنى وأخفيت عنى عيب سلعتك وهذا يقول كذبت فى سعر متاعك وهذا يقول رأيتنى محتاجا وكنت غنيا فما أطعمتنى وهذا يقول وجدتنى مظلوما وكنت قادرا على دفع الظلم عنى فداهنت الظالم وما راعيتنى، فبينا أنت كذلك وقد انشب الخصماء فيك مخالبهم وأحكموا فى تلابيبك أيديهم وأنت مبهوت متحير من كثرتهم حتى لم يبق فى عمرك أحد عاملته على درهم أو جالسته فى مجلس إلا وقد استحق عليك مظلمة بغيبة أو خيانة أو نظر بعين استحقار وقد ضعفت عن مقاومتهم ومددت عنق الرجاء إلى سيدك ومولاك لعله يخلصك من أيديهم إذ قرع سمعك نداء الجبار جل جلاله ﴿ اليوم تجزى كل نفس بما كسبت لا ظلم اليوم ﴾ فعند ذلك ينخلع قلبك من الهيبة وتوقن نفسك بالبوار وتتذكر ما أنذرك الله تعالى على لسان رسوله حيث قال ﴿ ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار مهطعين مقنعى رءوسهم لا يرتد إليهم طرفهم وأفئدتهم هواء وأنذر الناس ﴾ الآية فما أشد فرحك اليوم\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, you have known the terror [houl] of the Scales [al-mizan] and its peril, and that eyes will be staring fixedly at the tongue of the Scales. **\"Then as for he whose scales are heavy, he will be in a pleasant life. But as for he whose scales are light, his refuge will be an abyss. And what can make you know what that is? It is a Fire, intensely hot.\"**\n\nAnd know that none is saved from the peril of the Scales except he who, in this world [al-dunya], holds his soul to account [hasaba] and weighs therein, with the scale [mizan] of the Sacred Law, his deeds, his words, his passing thoughts, and his glances, just as 'Umar, may God be pleased with him, said: \"Hold yourselves to account before you are held to account, and weigh yourselves before you are weighed.\"\n\nAnd his holding his soul to account is that he repents from every sin before death with a sincere repentance [tawba], and makes up for what he has neglected of his shortcomings in the obligations [fara'id] of God, the Exalted, and he restores wrongfully taken rights, grain by grain, and seeks to be absolved by everyone he has confronted with his tongue, his hand, and the evil of his assumption [su' al-zann] with his heart, by purifying their hearts, until he dies and no wrongful claim or obligatory duty remains upon him. This one enters Paradise without reckoning.\n\nBut if he dies before restoring the wrongfully taken rights, his adversaries will surround him. This one will seize his hand, and this one will grip his forelock, and this one will cling to his collar. This one says, \"You wronged me [zalamtani]!\" And this one says, \"You insulted me!\" And this one says, \"You mocked me!\" And this one says, \"You mentioned me in backbiting [al-ghiba] with what displeased me!\" And this one says, \"You were my neighbor and you were a bad neighbor to me!\" And this one says, \"You dealt with me and you cheated me!\" And this one says, \"You sold to me and you defrauded me and concealed from me the defect in your merchandise!\" And this one says, \"You lied about the price of your goods!\" And this one says, \"You saw me in need while you were wealthy, yet you did not feed me!\" And this one says, \"You found me wronged while you were capable of repelling the wrong from me, yet you appeased the wrongdoer and did not regard me!\"\n\nAnd while you are in that state, with the adversaries having sunk their claws into you and firmly fixed their hands upon your collar, and you are bewildered, perplexed by their multitude—until there remains no one in your lifetime whom you dealt with for a single dirham or sat with in a gathering except that he has a rightful claim against you for a wrong [muzlima] through backbiting, betrayal, or a look with an eye of contempt—and you have become too weak to resist them, and you stretch forth the neck of hope to your Master and Protector, that perhaps He may deliver you from their hands, then the call of the Compeller, majestic is His glory, strikes your hearing: **\"Today, every soul will be recompensed for what it earned. No injustice today!\"**\n\nAt that, your heart [qalb] is torn out from awe [al-hayba], and your soul [nafs] becomes certain of ruin [al-bawar], and you remember what God, the Exalted, warned you through the tongue of His Messenger, where He said: **\"And never think that God is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror], racing ahead, their heads raised up, their glance not returning to them, and their hearts [af'ida] void. And warn the people...\"** the verse. So how intense will your regret be on that Day!\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.03","h":"0.5","c":"فَهُوَ","d":"َwُhَf","e":"َwُhَf"},{"b":"0.63","h":"1.41","c":"فِي","d":"àِf","e":"àِf"},{"b":"1.0","h":"2.16","c":"عِيشَةٍ","d":"ٍẗَhsyِʿع","e":"ٍẗَhsyِʿع"},{"b":"1.9","h":"3.78","c":"رَاضِيَةٍ","d":"ٍẗَyِḍāَّr","e":"ٍẗَyِḍāَّr"}],"a":{"g":"He will be in a pleasant life."}},"8":{"w":[{"b":"0.03","h":"0.55","c":"وَأَمَّا","d":"āَّmَaʾَw","e":"āَّmَaʾَw"},{"b":"1.8","h":"2.69","c":"مَنْ","d":"ْnَm","e":"ْnَm"},{"b":"2.2","h":"3.31","c":"خَفَّتْ","d":"ْtَّfَhk","e":"ْtَّfَhk"},{"b":"3.1","h":"4.95","c":"مَوَازِينُهُ","d":"ۥُhُnyِzَٰwَm","e":"ۥُhُnyِzَٰwَm"}],"a":{"g":"But as for one whose scales are light,"}},"9":{"w":[{"b":"0.03","h":"0.35","c":"فَأُمُّهُ","d":"ۥُhُّmُaʾَf","e":"ۥُhُّmُaʾَf"},{"b":"1.9","h":"2.82","c":"هَاوِيَةٌ","d":"ٌẗَyِwāَh","e":"ٌẗَyِwāَh"}],"a":{"g":"His refuge will be an abyss."}},"10":{"w":[{"b":"0.03","h":"0.35","c":"وَمَا","d":"ٓāَmَw","e":"ٓāَmَw"},{"b":"1.9","h":"2.15","c":"أَدْرَاكَ","d":"َkٰàَrْdَaʾ","e":"َkٰàَrْdَaʾ"},{"b":"3.0","h":"4.35","c":"مَا","d":"āَm","e":"āَm"},{"b":"3.4","h":"5.21","c":"هِيَهْ","d":"ْhَyِh","e":"ْhَyِh"}],"a":{"g":"And what can make you know what that is?"}},"11":{"w":[{"b":"0.1","h":"0.4","c":"نَارٌ","d":"ٌrāَn","e":"ٌrāَn"},{"b":"0.91","h":"2.06","c":"حَامِيَةٌ","d":"ٌۢẗَyِmāَḥ","e":"ٌۢẗَyِmāَḥ"}],"a":{"g":"It is a Fire, intensely hot."}}}