{"1":{"w":[{"b":"0.15","h":"0.3","c":"أَلْهَاكُمُ","d":"alhākumu","e":"ُmُkٰàَhْlَaʾ"},{"b":"1.3","h":"2.33","c":"التَّكَاثُرُ","d":"l-takāthuru","e":"ُrُhtāَkَّtlٱ"}],"a":{"g":"Competition in [worldly] increase diverts you","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                قال الله تعالى \"ألهاكم التكاثر\". وقال رسول الله ﷺ \"حب المال والشرف ينبتان النفاق في القلب كما ينبت الماء البقل\". وقال ﷺ \"ما ذئبان ضاريان أرسلا في زريبة غنم بأكثر إفساداً فيها من حب الشرف والمال والجاه في دين الرجل المسلم\". وقال ﷺ \"هلك المكثرون إلا من قال به في عباد الله هكذا وهكذا وقليل ما هم\". وقيل: يا رسول الله أي أمتك شر؟ قال \"الأغنياء\". وقال ﷺ \"سيأتي بعدكم قوم يأكلون أطايب الدنيا وألوانها ويركبون فره الخيل وألوانها وينكحون أجمل النساء وألوانها ويلبسون أجمل الثياب وألوانها، لهم بطون من القليل لا تشبع وأنفس بالكثير لا تقنع، عاكفون على الدنيا يغدون ويروحون إليها، اتخذوها آلهة من دون إلههم ورباً دون ربهم، إلى أمرها ينتهون ولهواهم يتبعون، فعزيمة من محمد بن عبد الله لمن أدركه ذلك الزمان من عقب عقبكم وخلف خلفكم أن لا يسلم عليهم ولا يعود مرضاهم ولا يتبع جنائزهم ولا يوقر كبيرهم، فمن فعل ذلك فقد أعان على هدم الإسلام\". وقال ﷺ \"دعوا الدنيا لأهلها، من أخذ من الدنيا فوق ما يكفيه أخذ حتفه وهو لا يشعر\". وقال ﷺ \"يقول ابن آدم مالي مالي وهل لك من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت؟\". وقال رجل: يا رسول الله مالي لا أحب الموت! فقال \"هل معك من مال؟\" قال: نعم يا رسول الله؛ قال \"قدم مالك فإن قلب المؤمن مع ماله، إن قدمه أحب أن يلحقه وإن خلفه أحب أن يتخلف معه\". وقال ﷺ \"أخلاء بن آدم ثلاثة. واحد يتبعه إلى قبض روحه، والثاني إلى قبره، والثالث إلى محشرة. فالذي يتبعه إلى قبض روحه فهو ماله، والذي يتبعه إلى قبره فهو أهله، والذي يتبعه إلى محشره فهو عمله\".\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, Allah the Exalted has said: \"The competition for increase [at-takathur] has distracted you.\" (102:1)\n\nAnd the Messenger of Allah, peace and blessings be upon him, said: \"The love of wealth [al-mal] and status [ash-sharaf] cause hypocrisy [nifaq] to grow in the heart [qalb] just as water causes plants to grow.\"\n\nAnd he, peace and blessings be upon him, said: \"Two ravenous wolves let loose among a flock of sheep do not cause more corruption in it than the love of status [ash-sharaf], wealth [al-mal], and prestige [al-jah] cause in the religion [din] of a Muslim man.\"\n\nAnd he, peace and blessings be upon him, said: \"The wealthy [al-mukthirun] are ruined, except for those who say with their wealth in the path of Allah like this and like this—and few are they.\"\n\nAnd it was said: \"O Messenger of Allah, who are the worst of your community?\" He said: \"The wealthy [al-aghniya'].\"\n\nAnd he, peace and blessings be upon him, said: \"There will come after you a people who eat the choicest foods of the world [ad-dunya] and its varieties, ride the finest horses and their varieties, marry the most beautiful women and their varieties, and wear the finest clothes and their varieties. Their bellies are not satisfied with little, and their souls [anfus] are not content with much. They are devoted to the world [ad-dunya], going to it in the morning and returning to it in the evening. They have taken it as a god besides their God and a lord besides their Lord. They end at its command and follow its desires. So, a firm resolve from Muhammad, son of Abdullah, to those of your descendants and successors who reach that time: do not greet them with peace, do not visit their sick, do not follow their funeral processions, and do not honor their elders. For whoever does that has indeed aided in the destruction of Islam.\"\n\nAnd he, peace and blessings be upon him, said: \"Leave the world [ad-dunya] for its people. Whoever takes from the world [ad-dunya] more than what suffices him takes his own destruction while he is unaware.\"\n\nAnd he, peace and blessings be upon him, said: \"The son of Adam says, 'My wealth [mali], my wealth [mali]!' But do you have anything of your wealth [mal] except what you ate and thus consumed, or wore and thus wore out, or gave in charity and thus forwarded?\"\n\nAnd a man said: \"O Messenger of Allah, why do I not love death?\" He said: \"Do you have wealth [mal]?\" The man said: \"Yes, O Messenger of Allah.\" He said: \"Send your wealth [mal] forward, for the heart [qalb] of the believer is with his wealth [mal]. If he sends it forward, he loves to join it. If he leaves it behind, he loves to remain with it.\"\n\nAnd he, peace and blessings be upon him, said: \"The companions of the son of Adam are three. One follows him until his soul [ruh] is taken, the second follows him to his grave, and the third follows him to the gathering place [al-mahshar]. The one who follows him until his soul [ruh] is taken is his wealth [maluhu]. The one who follows him to his grave is his family [ahluhu]. And the one who follows him to the gathering place [mahsharihi] is his deed ['amaluhu].\"\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.03","h":"0.3","c":"حَتَّى","d":"ḥattā","e":"ٰàَّtَḥ"},{"b":"0.88","h":"1.7","c":"زُرْتُمُ","d":"zur'tumu","e":"ُmُtْrُz"},{"b":"1.7","h":"3.15","c":"الْمَقَابِرَ","d":"l-maqābira","e":"َrِbāَqَmْlٱ"}],"a":{"g":"Until you visit the graveyards."}},"3":{"w":[{"b":"0.03","h":"0.55","c":"كَلَّا","d":"kallā","e":"āَّlَk"},{"b":"0.82","h":"1.81","c":"سَوْفَ","d":"sawfa","e":"َfْwَs"},{"b":"1.5","h":"2.97","c":"تَعْلَمُونَ","d":"taʿlamūna","e":"َnwُmَlْʿعَt"}],"a":{"g":"No! You are going to know."}},"4":{"w":[{"b":"0.03","h":"0.2","c":"ثُمَّ","d":"thumma","e":"َّmُht"},{"b":"1.6","h":"1.5","c":"كَلَّا","d":"kallā","e":"āَّlَk"},{"b":"2.5","h":"2.96","c":"سَوْفَ","d":"sawfa","e":"َfْwَs"},{"b":"3.2","h":"4.09","c":"تَعْلَمُونَ","d":"taʿlamūna","e":"َnwُmَlْʿعَt"}],"a":{"g":"Then no! You are going to know."}},"5":{"w":[{"b":"0.05","h":"0.2","c":"كَلَّا","d":"kallā","e":"āَّlَk"},{"b":"0.91","h":"1.44","c":"لَوْ","d":"law","e":"ْwَl"},{"b":"1.2","h":"2.09","c":"تَعْلَمُونَ","d":"taʿlamūna","e":"َnwُmَlْʿعَt"},{"b":"2.5","h":"4.23","c":"عِلْمَ","d":"ʿil'ma","e":"َmْlِʿع"},{"b":"3.1","h":"5.43","c":"الْيَقِينِ","d":"l-yaqīni","e":"ِnyِqَyْlٱ"}],"a":{"g":"No! If you only knew with knowledge of certainty...","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فمن الناس من يسر له نظر الاعتبار فلا ينظر في شىء من عالم الملك إلا ويعبر به إلى عالم الملكوت فيسمى عبوره عبرة وقد أمر الحق به فقال: ﴿ فاعتبروا يا أولى الأبصار ﴾ {} ومنهم من عميت بصيرته فلم يعتبر فاحتبس في عالم الملك والشهادة وستنفتح إلى حبسه أبواب جهنم وهذا الحبس مملوء نارا من شأنها أن تطلع على الأفئدة إلا أن بينه وبين إدراك ألمها حجابا فإذا رفع ذلك الحجاب بالموت أدرك وعن هذا أظهر الله تعالى الحق على لسان قوم استنطقهم بالحق فقالوا الجنة والنار مخلوقتان ولكن الجحيم تدرك مرة بإدراك يسمى علم اليقين ومرة بإدراك آخر يسمى عين اليقين وعين اليقين لا يكون إلا في الآخرة وعلم اليقين قد يكون في الدنيا ولكن للذين قد وفوا حظهم من نور اليقين فلذلك قال الله تعالى: ﴿ كلا لو تعلمون علم اليقين لترون الجحيم ﴾ {} أى في الدنيا ﴿ ثم لترونها عين اليقين ﴾ {} أى في الآخرة\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, among the people is he for whom the gaze of consideration [nazar al-i'tibar] is made easy, so he looks upon nothing from the world of dominion ['alam al-mulk] except that he crosses over with it to the world of sovereignty ['alam al-malakut], and his crossing is called a lesson ['ibrah]. And the Truth [al-Haqq] has commanded this, saying: \"So take lesson, O you who possess insight.\" And among them is he whose inner sight [basirah] is blinded, so he does not take lesson, and thus he is confined within the world of dominion and the visible realm ['alam al-shahadah]. And the gates of Hell will be opened to his confinement, and this confinement is filled with a fire whose nature is to rise over the hearts [af'idah], except that between him and the perception of its pain is a veil [hijab]. So when that veil is lifted by death, he perceives. And concerning this, God, Exalted is He, manifested the Truth upon the tongue of a people whom He caused to speak with the Truth, and they said: \"Paradise and the Fire are created, but the Blaze [al-Jahim] is perceived once by a perception called the knowledge of certainty ['ilm al-yaqin], and once by another perception called the eye of certainty ['ayn al-yaqin]. And the eye of certainty is not except in the Hereafter [al-Akhirah], and the knowledge of certainty can be in the world [al-dunya], but only for those who have fulfilled their portion from the light of certainty [nur al-yaqin].\" Therefore, God, Exalted is He, said: \"No! If you but knew with the knowledge of certainty, you would surely see the Blaze\"—meaning, in the world—\"Then you would surely see it with the eye of certainty\"—meaning, in the Hereafter.\n            </div>\n        </div>\n        "}},"6":{"w":[{"b":"0.15","h":"0.3","c":"لَتَرَوُنَّ","d":"latarawunna","e":"َّnُwَrَtَl"},{"b":"2.2","h":"2.77","c":"الْجَحِيمَ","d":"l-jaḥīma","e":"َmyِḥَjgْlٱ"}],"a":{"g":"You will surely see the Hellfire."}},"7":{"w":[{"b":"0.04","h":"0.25","c":"ثُمَّ","d":"thumma","e":"َّmُht"},{"b":"1.1","h":"1.49","c":"لَتَرَوُنَّهَا","d":"latarawunnahā","e":"āَhَّnُwَrَtَl"},{"b":"3.8","h":"4.62","c":"عَيْنَ","d":"ʿayna","e":"َnْyَʿع"},{"b":"4.4","h":"5.83","c":"الْيَقِينِ","d":"l-yaqīni","e":"ِnyِqَyْlٱ"}],"a":{"g":"Then you will surely see it with the eye of certainty.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فمن الناس من يسر له نظر الاعتبار فلا ينظر في شىء من عالم الملك إلا ويعبر به إلى عالم الملكوت فيسمى عبوره عبرة وقد أمر الحق به فقال: ﴿ فاعتبروا يا أولى الأبصار ﴾ {} ومنهم من عميت بصيرته فلم يعتبر فاحتبس في عالم الملك والشهادة وستنفتح إلى حبسه أبواب جهنم وهذا الحبس مملوء نارا من شأنها أن تطلع على الأفئدة إلا أن بينه وبين إدراك ألمها حجابا فإذا رفع ذلك الحجاب بالموت أدرك وعن هذا أظهر الله تعالى الحق على لسان قوم استنطقهم بالحق فقالوا الجنة والنار مخلوقتان ولكن الجحيم تدرك مرة بإدراك يسمى علم اليقين ومرة بإدراك آخر يسمى عين اليقين وعين اليقين لا يكون إلا في الآخرة وعلم اليقين قد يكون في الدنيا ولكن للذين قد وفوا حظهم من نور اليقين فلذلك قال الله تعالى: ﴿ كلا لو تعلمون علم اليقين لترون الجحيم ﴾ {} أى في الدنيا ﴿ ثم لترونها عين اليقين ﴾ {} أى في الآخرة\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, among the people is he for whom the gaze of consideration [nazar al-i'tibar] is made easy, so he looks upon nothing from the world of dominion ['alam al-mulk] except that he crosses over with it to the world of sovereignty ['alam al-malakut], and his crossing is called a lesson ['ibrah]. And the Truth [al-Haqq] has commanded this, saying: \"So take lesson, O you who possess insight.\"\n\nAnd among them is he whose inner sight [basirah] is blinded, so he does not take lesson, and thus he is confined within the world of dominion ['alam al-mulk] and the visible realm [al-shahadah]. And the gates of Hell will be opened to his confinement, and this confinement is filled with a fire whose nature is to rise over the hearts [af'idah], except that between him and the perception of its pain is a veil [hijab]. So when that veil is lifted by death, he perceives.\n\nAnd concerning this, God, the Exalted, manifested the truth upon the tongue of a people whom He caused to speak with the truth, and they said: \"Paradise and the Fire are created, but the Blaze [al-jahim] is perceived once with a perception called the knowledge of certainty ['ilm al-yaqin], and once with another perception called the vision of certainty ['ayn al-yaqin]. And the vision of certainty ['ayn al-yaqin] does not occur except in the Hereafter [al-Akhirah]. And the knowledge of certainty ['ilm al-yaqin] can occur in the world [al-dunya], but only for those who have fulfilled their portion of the light of certainty [nur al-yaqin].\"\n\nTherefore, God, the Exalted, said: \"No! If you but knew with the knowledge of certainty ['ilm al-yaqin], you would surely see the Blaze [al-jahim]\" — meaning, in the world [al-dunya] — \"Then you will surely see it with the vision of certainty ['ayn al-yaqin]\" — meaning, in the Hereafter [al-Akhirah].\n            </div>\n        </div>\n        "}},"8":{"w":[{"b":"0.03","h":"0.3","c":"ثُمَّ","d":"thumma","e":"َّmُht"},{"b":"1.6","h":"1.83","c":"لَتُسْءَلُنَّ","d":"latus'alunna","e":"َّnُlَٔـْsُtَl"},{"b":"3.8","h":"4.66","c":"يَوْمَئِذٍ","d":"yawma-idhin","e":"ٍhdِyʾَmْwَy"},{"b":"5.1","h":"6.66","c":"عَنِ","d":"ʿani","e":"ِnَʿع"},{"b":"5.6","h":"7.58","c":"النَّعِيمِ","d":"l-naʿīmi","e":"ِmyِʿعَّnlٱ"}],"a":{"g":"Then you will surely be asked that Day about pleasure."}}}