{"1":{"w":[{"b":"0.15","h":"0.33","c":"إِنَّا","d":"ʾinِāَّٓ","e":"innā"},{"b":"2.1","h":"1.55","c":"أَعْطَيْنَاكَ","d":"ʾaعَʿṭْyَnْkََٰ","e":"aʿṭaynāka"},{"b":"4.9","h":"5.66","c":"الْكَوْثَرَ","d":"lٱkْwَtْhrََ","e":"l-kawthara"}],"a":{"g":"Indeed, We have granted you, [O Muhammad], al-Kawthar.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                اعلم أن الحوض مكرمة عظيمة خص الله بها نبينا ﭬ وقد اشتملت الأخبار على وصفه ونحن نرجو أن يرزقنا الله تعالى فى الدنيا علمه وفى الآخرة ذوقه فإن من صفاته أن من شرب منه لم يظمأ أبدا. قال أنس: أغفى رسول الله ﭬ إغفاءة فرفع رأسه متبسما فقالوا له يا رسول الله لم ضحكت؟ فقال: آية أنزلت على آنفا وقرأ بسم الله الرحمن الرحيم ﴿ إنا أعطيناك الكوثر ﴾ حتى ختمها ثم قال هل تدرون ما الكوثر؟ قالوا: الله ورسوله أعلم قال إنه نهر وعدنيه ربى عز وجل فى الجنة عليه خير كثير عليه حوض ترد عليه أمتى يوم القيامة آنيته عدد نجوم السماء. وقال أنس: قال رسول الله ﭬ: بينما أنا أسير فى الجنة إذا بنهر حافتاه قباب اللؤلؤ المجوف قلت: ما هذا يا جبريل؟ قال: هذا الكوثر الذى أعطاك ربك فضرب الملك بيده فإذا طينه مسك أذفر. وروى ابن عمر (أنه لما نزل قوله تعالى: ﴿ إنا أعطيناك الكوثر ﴾ قال رسول الله ﭬ هو نهر فى الجنة حافتاه من ذهب شرابه أشد بياضا من اللبن وأحلى من العسل وأطيب ريحا من المسك يجرى على جنادل اللؤلؤ والمرجان).\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Know that the Fountain [al-hawd] is a tremendous honor which God has exclusively granted to our Prophet, peace be upon him. The narrations have encompassed its description, and we hope that God the Exalted grants us, in this world [al-dunya], knowledge of it, and in the Hereafter [al-akhira], the taste of it. For among its attributes is that whoever drinks from it will never thirst again.\n\nAnas said: The Messenger of God, peace be upon him, dozed off briefly, then raised his head smiling. They said to him, \"O Messenger of God, why are you smiling?\" He said, \"A verse was just revealed to me,\" and he recited: \"In the name of God, the Most Gracious, the Most Merciful. 'Indeed, We have granted you al-Kawthar...'\" until he finished it. Then he said, \"Do you know what al-Kawthar is?\" They said, \"God and His Messenger know best.\" He said, \"It is a river my Lord, Mighty and Majestic, has promised me in Paradise. Upon it is abundant good. Upon it is a Fountain where my community will come to drink on the Day of Resurrection. Its vessels are as numerous as the stars in the sky.\"\n\nAnd Anas said: The Messenger of God, peace be upon him, said, \"While I was walking in Paradise, I came upon a river whose banks were domes of hollowed pearl. I said, 'What is this, O Gabriel?' He said, 'This is al-Kawthar which your Lord has given you.' Then the angel struck it with his hand, and its clay was fragrant musk.\"\n\nAnd Ibn 'Umar narrated that when the verse was revealed: \"Indeed, We have granted you al-Kawthar,\" the Messenger of God, peace be upon him, said, \"It is a river in Paradise. Its banks are of gold. Its drink is whiter than milk, sweeter than honey, and more fragrant than musk. It flows over pebbles of pearl and coral.\"\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.03","h":"0.03","c":"فَصَلِّ","d":"fṣَlَِّ","e":"faṣalli"},{"b":"0.92","h":"1.34","c":"لِرَبِّكَ","d":"lrِbَkَِّ","e":"lirabbika"},{"b":"1.9","h":"3.19","c":"وَانْحَرْ","d":"wnٱَḥْrَْ","e":"wa-in'ḥar"}],"a":{"g":"So pray to your Lord and sacrifice [to Him alone]."}},"3":{"w":[{"b":"0.03","h":"0.03","c":"إِنَّ","d":"ʾinَِّ","e":"inna"},{"b":"1.6","h":"1.4","c":"شَانِئَكَ","d":"shāَnʾِykََ","e":"shāni-aka"},{"b":"2.7","h":"3.23","c":"هُوَ","d":"hwَُ","e":"huwa"},{"b":"3.2","h":"4.07","c":"الْأَبْتَرُ","d":"lٱʾْabَtْrَُ","e":"l-abtaru"}],"a":{"g":"Indeed, your enemy is the one cut off."}}}