{"1":{"w":[{"b":"0.03","h":"1.1","c":"تَبَّتْ","d":"ْtَّbَt","e":"binasalah"},{"b":"0.8","h":"2.21","c":"يَدَا","d":"ٓāَdَy","e":"kedua tangan"},{"b":"1.3","h":"3.03","c":"أَبِي","d":"àِbَaʾ","e":"Abu"},{"b":"3.8","h":"5.28","c":"لَهَبٍ","d":"ٍbَhَl","e":"Lahab"},{"b":"5.4","h":"7.27","c":"وَتَبَّ","d":"َّbَtَw","e":"sebenar-benar binasa"}],"a":{"g":"May the hands of Abu Lahab be ruined, and ruined is he."}},"2":{"w":[{"b":"0.05","h":"0.5","c":"مَا","d":"ٓāَm","e":"tidak"},{"b":"2.2","h":"2.22","c":"أَغْنَى","d":"ٰàَnْغَaʾ","e":"berguna"},{"b":"3.0","h":"3.69","c":"عَنْهُ","d":"ُhْnَʿع","e":"dari padanya/kepadanya"},{"b":"3.8","h":"5.07","c":"مَالُهُ","d":"ۥُhُlāَm","e":"hartanya"},{"b":"4.9","h":"7.05","c":"وَمَا","d":"āَmَw","e":"dan apa"},{"b":"5.5","h":"8.13","c":"كَسَبَ","d":"َbَsَk","e":"yang ia usahakan"}],"a":{"g":"His wealth will not avail him or that which he gained."}},"3":{"w":[{"b":"0.03","h":"0.7","c":"سَيَصْلَى","d":"ٰàَlْṣَyَs","e":"kelak ia akan masuk"},{"b":"1.1","h":"2.42","c":"نَارًا","d":"āًrāَn","e":"api"},{"b":"2.9","h":"4.4","c":"ذَاتَ","d":"َtāَhd","e":"mempunyai"},{"b":"3.6","h":"5.73","c":"لَهَبٍ","d":"ٍbَhَl","e":"begejolak"}],"a":{"g":"He will [enter to] burn in a Fire of [blazing] flame"}},"4":{"w":[{"b":"0.04","h":"0.35","c":"وَامْرَأَتُهُ","d":"ۥُhُtَaʾَrْmٱَw","e":"dan istrinya"},{"b":"1.4","h":"2.78","c":"حَمَّالَةَ","d":"َẗَlāَّmَḥ","e":"pembawa"},{"b":"3.8","h":"5.44","c":"الْحَطَبِ","d":"ِbَṭَḥْlٱ","e":"kayu bakar"}],"a":{"g":"And his wife [as well] - the carrier of firewood.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                                         الآفة السادسة عشرة النميمة\n\nقال الله تعالى \"هماز مشاء بنميم\" ثم قال \"عتل بعد ذلك زنيم\" قال عبد الله بن المبارك: الزنيم ولد الزنا الذي لا يكتم الحديث، وأشار به إلى أن كل من لم يكتم الحديث ومشى بالنميمة دل على أنه ولد زنا استنباطاً من قوله عز وجل \"عتل بعد ذلك زنيم\" والزنيم هو الدعى وقال تعالى \"ويل لكل همزة لمزة\" قيل الهمزة: النمام، وقال تعالى \"حمالة الحطب\" قيل إنها كانت نمامة حمالة للحديث وقال تعالى \"فخانتاهما فلم يغنيا عنهما من الله شيئاً\" قيل كانت امرأة لوط تخبر بالضيفان وامرأة نوح تخبر أنه مجنون وقد قال ﭬ \"لا يدخل الجنة نمام\"[229] وفي حديث آخر \"لا يدخل الجنة قتات\" والقتات هو النمام وقال أبو هريرة قال رسول الله ﭬ \"أحبكم إلى الله أحاسنكم أخلاقاً الموطئون أكنافاً الذين يألفون ويؤلفون، وإن أبغضكم إلى الله المشاءون بالنميمة، المفرقون بين الإخوان، الملتمسون للبرءاء العثرات\"[230] وقال ﭬ \"ألا أخبركم بشراركم\" قالوا: بلى، قال \"المشاءون بالنميمة المفسدون بين الأحبة الباغون للبرءاء العيب\"[231] وقال أبو ذر: قال رسول الله ﭬ \"من أشاع على مسلم كلمة ليشينه بها بغير حق شانه الله بها في النار يوم القيامة\"[232] وقال أبو الدرداء: قال رسول الله ﭬ \"أيما رجل أشاع على رجل كلمة وهو منها بريء ليشينه بها في الدنيا كان حقاً على الله أن يذيبه بها يوم القيامة في النار\"[233] وقال أبو هريرة: قال رسول الله ﭬ \"من شهد على مسلم بشهادة ليس لها بأهل فليتبوأ مقعده من النار\"[234] ويقال: إن ثلث عذاب القبر من النميمة. وعن ابن عمر عن النبي ﭬ \"إن الله لما خلق الجنة قال لها تكلمي فقالت سعد من دخلني فقال الجبار جل جلاله وعزتي وجلالي لا يسكن فيك ثمانية نفر من الناس، لا يسكنك مدمن خمر ولا مصر على الزنا ولا قتات وهو النمام ولا ديوث ولا شرطي ولا مخنث ولا قاطع رحم ولا الذي يقول على عهد الله إن لم أفعل كذا وكذا لم يف به\"[235] وروى كعب الأحبار أن بني إسرائيل أصابهم قحط فاستسقى موسى عليه السلام مرات فما سقوا فأوحى الله تعالى إليه: إني لا أستجيب لك ولمن معك وفيكم نمام قد أصر على النميمة. فقال موسى: يا\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                The sixteenth affliction: Tale-bearing [an-namima].\n\nIndeed, Allah the Exalted says: \"A slanderer [humaz], going about with calumny [binamim],\" then He says: \"Surly, and after that, ignoble [zanin].\" Abdullah ibn al-Mubarak said: \"The ignoble one [az-zanim] is the child of fornication who does not conceal speech.\" He indicated by this that everyone who does not conceal speech and goes about with tale-bearing [an-namima] indicates that he is a child of fornication, derived from His saying, the Mighty and Majestic: \"Surly, and after that, ignoble [zanin].\" And the ignoble one [az-zanim] is the falsely attributed one. And He the Exalted says: \"Woe to every slanderer [humaza] and backbiter [lumaza].\" It is said: \"The slanderer [al-humaza] is the tale-bearer [an-namam].\" And He the Exalted says: \"A carrier of firewood [hamalata al-hatab].\" It is said she was a tale-bearer [namama], a carrier of speech. And He the Exalted says: \"But they betrayed them, so they availed them nothing against Allah.\" It is said: \"The wife of Lot used to inform about the guests, and the wife of Noah used to inform that he was mad.\" And He ﷺ said: \"The tale-bearer [an-namam] will not enter Paradise.\" And in another narration: \"The tale-bearer [al-qattat] will not enter Paradise.\" And the tale-bearer [al-qattat] is the tale-bearer [an-namam]. And Abu Hurairah said: The Messenger of Allah ﷺ said: \"The most beloved of you to Allah are the best of you in character, the most accommodating, those who befriend and are befriended. And the most hateful of you to Allah are those who go about with tale-bearing [an-namima], those who separate between brothers, those who seek out the faults of the innocent.\" And He ﷺ said: \"Shall I not inform you of the worst of you?\" They said: \"Yes.\" He said: \"Those who go about with tale-bearing [an-namima], those who cause corruption between loved ones, those who seek out faults for the innocent.\" And Abu Dharr said: The Messenger of Allah ﷺ said: \"Whoever spreads a word about a Muslim to disgrace him with it without right, Allah will disgrace him with it in the Fire on the Day of Resurrection.\" And Abu ad-Darda' said: The Messenger of Allah ﷺ said: \"Any man who spreads a word about a man while he is innocent of it to disgrace him with it in the world, it is a right upon Allah to melt him with it on the Day of Resurrection in the Fire.\" And Abu Hurairah said: The Messenger of Allah ﷺ said: \"Whoever bears witness against a Muslim with testimony for which he is not worthy, let him take his seat in the Fire.\" And it is said: \"One-third of the punishment of the grave is from tale-bearing [an-namima].\" And from Ibn 'Umar, from the Prophet ﷺ: \"Indeed, when Allah created Paradise, He said to it: 'Speak.' So it said: 'Fortunate is he who enters me.' So the Compeller, majestic is His majesty and mighty is His might, said: 'By My might and My majesty, eight types of people from mankind will not dwell in you: the addicted to wine, the persistent in fornication, the tale-bearer [al-qattat] and he is the tale-bearer [an-namam], the pimp, the policeman, the effeminate man, the severer of kinship ties, and he who says concerning Allah's covenant: 'If I do not do such and such...' and does not fulfill it.'\" And Ka'b al-Ahbar narrated that the Children of Israel were struck by drought, so Musa, peace be upon him, prayed for rain many times, but they were not given rain. So Allah the Exalted revealed to him: \"Indeed, I will not answer you nor those with you, for among you is a tale-bearer [namam] who has persisted in tale-bearing [an-namima].\" So Musa said: \"O...\"\n            </div>\n        </div>\n        "}},"5":{"w":[{"b":"0.03","h":"0.55","c":"فِي","d":"àِf","e":"pada"},{"b":"0.4","h":"1.2","c":"جِيدِهَا","d":"āَhِdyِjg","e":"lehernya"},{"b":"1.4","h":"3.11","c":"حَبْلٌ","d":"ٌlْbَḥ","e":"tali"},{"b":"3.4","h":"5.09","c":"مِنْ","d":"nِّm","e":"dari"},{"b":"4.6","h":"5.99","c":"مَسَدٍ","d":"ٍۭdَsَّm","e":"sabut"}],"a":{"g":"Around her neck is a rope of [twisted] fiber."}}}