{"1":{"w":[{"b":"0.03","h":"0.6","c":"قُلْ","d":"qul","e":"qul"},{"b":"0.35","h":"1.19","c":"أَعُوذُ","d":"aʿūdhu","e":"aʿūdhu"},{"b":"1.2","h":"2.52","c":"بِرَبِّ","d":"birabbi","e":"birabbi"},{"b":"2.0","h":"4.1","c":"الْفَلَقِ","d":"l-falaqi","e":"l-falaqi"}],"a":{"g":"Say, \"I seek refuge in the Lord of daybreak","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                الطريق إلى الله تعالى مراقبة الأوقات وعمارتها بالأوراد على سبيل الدوام، فمن شرف الوقت ما بين طلوع الصبح إلى طلوع الشمس، إذ هو وقت قبض ظل الليل ببسط نور الشمس، ويدل على فضله إقسام الله تعالى به في قوله: ﴿ والصبح إذا تنفس ﴾، وتمدحه بقوله: ﴿ فالق الإصباح ﴾، وأظهر القدرة فيه بقوله: ﴿ ثم قبضناه إلينا قبضا يسيرا ﴾، وأرشد إلى التسبيح فيه بقوله: ﴿ فسبحان الله حين تمسون وحين تصبحون ﴾، وبقوله: ﴿ فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ﴾، وقوله: ﴿ ومن آناء الليل فسبح وأطراف النهار لعلك ترضى ﴾، وقوله: ﴿ واذكر اسم ربك بكرة وأصيلا ﴾. وفي هذا السياق يأتي الأمر بالاستعاذة برب الفلق في قوله تعالى: ﴿ قل أعوذ برب الفلق ﴾، ليعلم العبد أن الاستعاذة بالله في هذا الوقت الشريف تفتح له أبواب القرب، وتحصنه من ظلمات الغفلة، فرب الفلق هو مبدد الظلام ومنير الصباح، فكما يفلق الصبح ظلمة الليل، تفلق هذه الاستعاذة ظلمة القلب، فتشغله بالذكر والطاعة، فيكون الورد الأول من أوراد النهار تجارة للدار الآخرة، وسبيلاً إلى رضا الرب الكريم.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the path [tariq] to God, the Exalted, is the vigilant observance of times and their cultivation with regular litanies [awrad] in a manner of constancy. And from the nobility of time is that which is between the rising of dawn [subh] and the rising of the sun, for it is the time of the gathering of night's shadow by the spreading of the sun's light [nur]. Its merit is indicated by God the Exalted's swearing by it in His saying: \"And by the dawn [subh] when it breathes\" (81:18), and His praising it in His saying: \"The Cleaver of the dawn [isbah]\" (6:96), and His manifesting power within it in His saying: \"Then We withdraw it unto Us, a gradual withdrawal\" (25:46), and His guiding to glorification [tasbih] within it in His saying: \"So glorify [sabbih] God when you reach evening and when you rise at morn\" (30:17), and in His saying: \"So glorify [sabbih] with praise of your Lord before the rising of the sun and before its setting\" (50:39), and His saying: \"And glorify [sabbih] Him during parts of the night and at the ends of the day, that you may be content\" (20:130), and His saying: \"And remember [udhkur] the Name of your Lord morning [bukratan] and evening\" (76:25). And within this context comes the command to seek refuge with the Lord of the Daybreak [rabb al-falaq] in His saying, the Exalted: \"Say, 'I seek refuge with the Lord of the Daybreak [rabb al-falaq]'\" (113:1), so that the servant may know that seeking refuge with God in this noble time opens for him the gates of nearness [qurb], and fortifies him from the darknesses of heedlessness [ghaflah]. For the Lord of the Daybreak [rabb al-falaq] is the Disperser of darkness [zulam] and the Illuminator of the morning [sabah]. So just as the dawn [subh] cleaves the darkness [zulmah] of the night, this seeking refuge cleaves the darkness [zulmah] of the heart [qalb], occupying it with remembrance [dhikr] and obedience [ta'ah]. Thus, the first litany [al-ward al-awwal] of the day's litanies [awrad] becomes a trade for the Abode of the Hereafter [dar al-akhirah], and a path [sabil] to the pleasure [rida] of the Generous Lord.\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.03","h":"0","c":"مِنْ","d":"min","e":"min"},{"b":"1.3","h":"1.37","c":"شَرِّ","d":"sharri","e":"sharri"},{"b":"2.0","h":"2.66","c":"مَا","d":"mā","e":"mā"},{"b":"2.3","h":"3.42","c":"خَلَقَ","d":"khalaqa","e":"khalaqa"}],"a":{"g":"From the evil of that which He created"}},"3":{"w":[{"b":"0.03","h":"0.06","c":"وَمِنْ","d":"wamin","e":"wamin"},{"b":"1.4","h":"1.33","c":"شَرِّ","d":"sharri","e":"sharri"},{"b":"2.1","h":"2.52","c":"غَاسِقٍ","d":"ghāsiqin","e":"ghāsiqin"},{"b":"3.2","h":"4.63","c":"إِذَا","d":"idhā","e":"idhā"},{"b":"3.8","h":"5.84","c":"وَقَبَ","d":"waqaba","e":"waqaba"}],"a":{"g":"And from the evil of darkness when it settles","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                اعلم أن شهوة الوقاع سلطت على الإنسان لفائدتين؛ إحداهما: أن يدرك لذته فيقيس به لذات الآخرة. فإن لذة الوقاع لو دامت لكانت أقوى لذات الأجساد، كما أن النار وآلامها أعظم آلام الجسد. والترغيب والترهيب يسوق الناس إلى سعادتهم وليس ذلك إلا بألم محسوس ولذة محسوسة مدركة، فإن ما لا يدرك بالذوق لا يعظم إليه الشوق. الفائدة الثانية: بقاء النسل ودوام الوجود فهذه فائدتها. ولكن فيها من الآفات ما يهلك الدين والدنيا إن لم تضبط ولم تقهر ولم ترد إلى حد الاعتدال. وقد قيل في تأويل قوله تعالى \"ومن شر غاسق إذا وقب\" قال: هو قيام الذكر. وقد أسنده بعض الرواة إلى رسول الله ﭬ إلا أنه قال في تفسيره: الذكر إذا دخل. وقد قيل: إذا قام ذكر الرجل ذهب ثلثا عقله\"[55]. وكان ﭬ يقول في دعائه \"اللهم إني أعوذ بك من شر سمعي وبصري وقلبي وهني ومني\"[56] وقال عليه السلام \"النساء حبائل الشيطان ولولا هذه الشهوة لما كان للنساء سلطنة على الرجال\"[57]. روي أن موسى عليه السلام كان جالساً في بعض مجالسه إذا أقبل إليه إبليس وعليه برنس يتلون فيه ألواناً؛ فلما دنا منه خلع البرنس فوضعه، ثم أتاه فقال: السلام عليك يا موسى، فقال له موسى من أنت؟ فقال: أنا إبليس، فقال: لا حياك الله ما جاء بك؟ قال: جئت أسلم عليك لمنزلتك من الله ومكانتك منه، قال: فما الذي رأيت عليك؟ قال: برنس أختطف به قلوب بني آدم قال: فما الذي إذا صنعه الإنسان استحوذت عليه قال: إذا أعجبته نفسه واستكثر عمله ونسي ذنوبه، وأحذرك ثلاثاً: لا تخل بامرأة لا تحل لك فإن ما خلا رجل بامرأة لا تحل له إلا كنت صاحبه دون أصحابي حتى أفتنه بها وأفتنها به، ولا تعاهد الله عهداً إلا وفيت به، ولا تخرجن صدقة إلا أمضيتها فإنه ما أخرج رجل صدقة فلم يمضها إلا كنت صاحبه دون أصحابي حتى أحول بينه وبين الوفاء بها. ثم ولى وهو يقول: علم موسى ما يحذر به بني آدم. وعن سعيد بن المسيب قال: ما بعث الله نبياً فيما خلا إلا لم ييأس إبليس أن يهلكه بالنساء ولا شيء أخوف عندي منهن، وما بالمدينة بيت أدخله إلا بيتي وبيت ابنتي أغتسل فيه يوم الجمعة ثم أروح. وقال بعضهم: إن الشيطان يقول للمرأة أنت نصف جندي وأنت سهمي الذي أرمي به فلا أخطئ، وأنت موضع سري وأنت رسولي في حاجتي. فنصف جنده الشهوة ونصف جنده الغضب. وأعظم الشهوات شهوة النساء. وهذه الشهوة أيضاً لها إفراط وتفريط واعتدال، فالإفراط: ما يقهر العقل حتى يصرف همة الرجال إلى الاستمتاع بالنساء والجواري،\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Know that the desire for intercourse [shahwat al-wiqa'] has been given dominion over man for two benefits. The first: that he may experience its pleasure [ladhdha] and thereby analogize the pleasures of the Hereafter [al-akhira]. For if the pleasure of intercourse were to last, it would be the strongest of bodily pleasures, just as fire and its pains are the greatest of bodily pains. Encouragement [al-targhib] and warning [al-tarhib] drive people to their felicity [sa'ada], and that is only through a tangible pain and a tangible, perceptible pleasure. For what is not perceived by taste [dhawq] does not inspire a great longing [shawq] for it. The second benefit: the continuation of progeny and the permanence of existence; this is its benefit.\n\nBut within it are harms [afat] that destroy religion [din] and this world [al-dunya] if it is not restrained, not subdued, and not returned to the limit of moderation [i'tidal].\n\nIt has been said in the interpretation of His saying, the Most High, \"And from the evil of the darkening night when it descends\" [Surah Al-Falaq 113:3], it was said: It is the rising of the male organ [qiyam al-dhakar]. Some narrators attributed it to the Messenger of God, peace be upon him, except that he said in its interpretation: \"The male organ [al-dhakar] when it enters.\" And it has been said: \"When a man's male organ [dhakar] rises, two-thirds of his intellect ['aql] depart.\"\n\nAnd he, peace be upon him, would say in his supplication: \"O Allah, I seek refuge in You from the evil of my hearing, my sight, my heart [qalb], my tongue [lisani], and my semen [mani].\" And he, upon him be peace, said: \"Women are the snares of Satan [huba'il al-shaytan], and were it not for this desire [shahwa], women would have no dominion [sultana] over men.\"\n\nIt is narrated that Moses, peace be upon him, was sitting in one of his gatherings when Iblis approached him wearing a cloak [burnus] of shifting colors. When he drew near, he removed the cloak and placed it down, then came to him and said: \"Peace be upon you, O Moses.\" Moses said to him: \"Who are you?\" He said: \"I am Iblis.\" He said: \"May Allah not grant you life, what brings you?\" He said: \"I have come to greet you for your station with Allah and your place with Him.\" He said: \"Then what is that which I saw upon you?\" He said: \"A cloak [burnus] with which I snatch the hearts [qulub] of the children of Adam.\" He said: \"Then what is it that, if a person does it, you gain mastery over him?\" He said: \"If he is pleased with himself [a'jabat-hu nafsuhu], considers his deeds many [istakthara 'amaluhu], and forgets his sins [nasiya dhunubahu].\" And I warn you against three things: Do not be alone [la takhlu] with a woman who is not lawful [la tahillu] for you, for whenever a man is alone with a woman who is not lawful for him, I am his companion to the exclusion of my companions until I tempt him with her and tempt her with him. And do not make a covenant ['ahd] with Allah except that you fulfill it. And do not take out a charity [sadaqa] except that you complete it, for whenever a man takes out a charity and does not complete it, I am his companion to the exclusion of my companions until I come between him and fulfilling it.\" Then he turned away, saying: \"Moses has learned what he warns the children of Adam with.\"\n\nAnd from Sa'id ibn al-Musayyib, he said: \"Allah did not send a prophet in the past except that Iblis did not despair of destroying him through women, and there is nothing I fear more than them. And there is no house in Medina I enter except my house and my daughter's house, where I perform the ritual bath [ghusl] on Friday and then go.\"\n\nAnd some of them said: Indeed, Satan [al-shaytan] says to the woman: \"You are half of my army [jundi], and you are my arrow [sahmi] with which I shoot and do not miss, and you are the place of my secret [sirri], and you are my messenger [rasuli] for my needs.\" So half his army is desire [al-shahwa] and half his army is anger [al-ghadab]. And the greatest of desires is the desire for women [shahwat al-nisa'].\n\nAnd this desire [shahwa] also has excess [ifrat], deficiency [tafrit], and moderation [i'tidal]. The excess [al-ifrat]: is what overpowers the intellect ['aql] until it diverts the aspiration [himma] of men to seeking enjoyment [al-istimta'] with women and slave-girls.\n            </div>\n        </div>\n        "}},"4":{"w":[{"b":"0.03","h":"0.41","c":"وَمِنْ","d":"wamin","e":"wamin"},{"b":"1.4","h":"1.64","c":"شَرِّ","d":"sharri","e":"sharri"},{"b":"2.1","h":"2.87","c":"النَّفَّاثَاتِ","d":"l-nafāthāti","e":"l-nafāthāti"},{"b":"4.3","h":"6.45","c":"فِي","d":"fī","e":"fī"},{"b":"4.6","h":"6.87","c":"الْعُقَدِ","d":"l-ʿuqadi","e":"l-ʿuqadi"}],"a":{"g":"And from the evil of the blowers in knots"}},"5":{"w":[{"b":"0.03","h":"0.34","c":"وَمِنْ","d":"wamin","e":"wamin"},{"b":"1.2","h":"1.63","c":"شَرِّ","d":"sharri","e":"sharri"},{"b":"1.9","h":"2.68","c":"حَاسِدٍ","d":"ḥāsidin","e":"ḥāsidin"},{"b":"3.0","h":"4.73","c":"إِذَا","d":"idhā","e":"idhā"},{"b":"3.6","h":"5.9","c":"حَسَدَ","d":"ḥasada","e":"ḥasada"}],"a":{"g":"And from the evil of an envier when he envies.\""}}}