{"1":{"w":[{"b":"0.03","h":"0.5","c":"عَمَّ","d":"َّmَʿع","e":"ʿamma"},{"b":"1.2","h":"1.94","c":"يَتَسَاءَلُونَ","d":"َnwُlَءٓāَsَtَy","e":"yatasāalūna"}],"a":{"g":"About what are they asking one another?"}},"2":{"w":[{"b":"0.08","h":"0.3","c":"عَنِ","d":"ِnَʿع","e":"ʿani"},{"b":"1.2","h":"0.87","c":"النَّبَإِ","d":"ِiʾَbَّnlٱ","e":"l-naba-i"},{"b":"1.8","h":"2.48","c":"الْعَظِيمِ","d":"ِmyِẓَʿعْlٱ","e":"l-ʿaẓīmi"}],"a":{"g":"About the great news -"}},"3":{"w":[{"b":"0.03","h":"0.35","c":"الَّذِي","d":"àِhdَّlٱ","e":"alladhī"},{"b":"1.0","h":"1.93","c":"هُمْ","d":"ْmُh","e":"hum"},{"b":"1.5","h":"2.61","c":"فِيهِ","d":"ِhyِf","e":"fīhi"},{"b":"2.3","h":"3.9","c":"مُخْتَلِفُونَ","d":"َnwُfِlَtْhkُm","e":"mukh'talifūna"}],"a":{"g":"That over which they are in disagreement."}},"4":{"w":[{"b":"0.03","h":"0.55","c":"كَلَّا","d":"āَّlَk","e":"kallā"},{"b":"0.93","h":"1.79","c":"سَيَعْلَمُونَ","d":"َnwُmَlْʿعَyَs","e":"sayaʿlamūna"}],"a":{"g":"No! They are going to know."}},"5":{"w":[{"b":"0.03","h":"1.15","c":"ثُمَّ","d":"َّmُht","e":"thumma"},{"b":"1.2","h":"2.32","c":"كَلَّا","d":"āَّlَk","e":"kallā"},{"b":"2.1","h":"3.86","c":"سَيَعْلَمُونَ","d":"َnwُmَlْʿعَyَs","e":"sayaʿlamūna"}],"a":{"g":"Then, no! They are going to know."}},"6":{"w":[{"b":"0.03","h":"0.4","c":"أَلَمْ","d":"ْmَlَaʾ","e":"alam"},{"b":"0.59","h":"1.21","c":"نَجْعَلِ","d":"ِlَʿعْjgَn","e":"najʿali"},{"b":"1.6","h":"2.5","c":"الْأَرْضَ","d":"َḍْrَaʾْlٱ","e":"l-arḍa"},{"b":"2.6","h":"3.81","c":"مِهَادًا","d":"āًdَٰhِm","e":"mihādan"}],"a":{"g":"Have We not made the earth a resting place?","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وسددهم للتأسي بصحبة الأكرمين ويسر لهم اقتفاء آثار السلف الصالحين حتى اعتصموا من مقتضيات العقول بالحبل المتين ومن سير الأولين وعقائدهم بالمنهج المبين فجمعوا بالقول بين نتائج العقول وقضايا الشرع المنقول وتحققوا أن النطق بما تعبدوا به من قول لا إله إلا الله محمد رسول الله ليس له طائل ولا محصول إن لم تتحقق الإحاطة بما تدور عليه هذه الشهادة من الأقطاب والأصول وعرفوا أن كلمتي الشهادة على إيجازها تتضمن إثبات ذات الإله وإثبات صفاته وإثبات أفعاله وإثبات صدق الرسول وعلموا أن بناء الإيمان على هذه الأركان وهي أربعة ويدور كل ركن منها على عشرة أصول الركن الأول في معرفة ذات الله تعالى ومداره على عشرة أصول وهي العلم بوجود الله تعالى وقدمه وبقائه وأنه ليس بجوهر ولا جسم ولا عرض وأنه سبحانه ليس مختصا بجهة ولا مستقرا على مكان وأنه يرى وأنه واحد الركن الثاني في صفاته ويشتمل على عشرة أصول وهو العلم بكونه حيا عالما قادرا مريدا سميعا بصيرا متكلما منزها عن حلول الحوادث وأنه قديم الكلام والعلم والإرادة الركن الثالث في أفعاله تعالى ومداره على عشرة أصول وهي أن أفعال العباد مخلوقة لله تعالى وأنها مكتسبة للعباد وأنها مرادة لله تعالى وأنه متفضل بالخلق والاختراع وأن له تعالى تكليف ما لا يطاق وأن له إيلام البريء ولا يجب عليه رعاية الأصلح وأنه لا واجب إلا بالشرع وأن بعثة الأنبياء جائزة وأن نبوة نبينا محمد ﭬ ثابتة مؤيدة بالمعجزة الركن الرابع في السمعيات ومداره على عشرة أصول وهي إثبات الحشر والنشر وسؤال منكر ونكير وعذاب القبر والميزان والصراط وخلق الجنة والنار وأحكام الإمامة وأن فضل الصحابة على حسب ترتيبهم وشروط الإمامة. (فأما الركن الأول من أركان الإيمان في معرفة ذات الله سبحانه وتعالى وأن الله تعالى واحد ومداره على عشرة أصول) الأصل الأول: معرفة وجوده تعالى وأول ما يستضاء به من الأنوار ويسلك من طريق الاعتبار ما أرشد إليه القرآن فليس بعد بيان الله سبحانه بيان وقد قال تعالى ألم نجعل الأرض مهادا والجبال أوتادا وخلقناكم أزواجا وجعلنا نومكم سباتا وجعلنا الليل لباسا وجعلنا النهار معاشا وبنينا فوقكم سبعا شدادا وجعلنا سراجا وهاجا وأنزلنا من المعصرات ماء ثجاجا لنخرج به حبا ونباتا وجنات ألفافا وقال تعالى إن في خلق السموات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون وقال تعالى ألم تروا كيف خلق الله سبع سموات طباقا وجعل القمر فيهن نورا وجعل الشمس سراجا والله أنبتكم من الأرض نباتا ثم يعيدكم فيها ويخرجكم إخراجا وقال تعالى أفرأيتم ما تمنون أأنتم تخلقونه أم نحن الخالقون إلى قوله للمقوين فليس يخفى على من معه أدنى مسكة من عقل إذا تأمل بأدنى فكرة مضمون هذه الآيات وأدار نظره على عجائب خلق الله في الأرض والسموات وبدائع فطرة الحيوان والنبات أن هذا الأمر العجيب والترتيب المحكم لا يستغني عن صانع يدبره وفاعل يحكمه ويقدره بل تكاد فطرة النفوس تشهد بكونها مقهورة تحت تسخيره ومصرفة بمقتضى تدبيره ولذلك قال الله تعالى أفي الله شك فاطر السموات والأرض ولهذا بعث الأنبياء صلوات الله عليهم لدعوة الخلق إلى التوحيد ليقولوا لا إله إلا الله وما أمروا أن يقولوا لنا إله وللعالم إله فإن ذلك كان مجبولا في فطرة عقولهم من مبدأ نشؤهم وفي عنفوان شبابهم ولذلك قال عز وجل ولئن سألتهم من خلق السموات والأرض ليقولن الله وقال تعالى: )فأقم وجهك للدين حنيفا فطرة الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم( فإذا في فطرة الإنسان وشواهد القرآن ما يغني عن إقامة البرهان ولكنا على سبيل الاستظهار والاقتداء بالعلماء النظار نقول من بدائه العقول أن الحادث لا يستغنى في حدوثه عن سبب يحدثه والعالم حادث فإذا لا يستغنى في حدوثه عن سبب أما قولنا إن الحادث لا يستغنى في حدوثه عن سبب فجلي فإن كل حادث مختص بوقت يجوز في العقل تقدير تقديمه وتأخيره فاختصاصه بوقته دون ما قبله وما بعده يفتقر بالضرورة إلى المخصص وأما قولنا العالم حادث فبرهانه أن أجسام العالم لا تخلو\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                And We guided them to emulate the companionship of the most noble and made easy for them the following of the footsteps of the righteous predecessors, so that they held fast, from the dictates of intellects, to the Firm Rope [al-habl al-mateen], and from the ways of the ancients and their beliefs, to the Clear Path [al-minhaj al-mubeen]. Thus they combined in speech between the conclusions of intellects and the transmitted rulings of the Sacred Law [al-shar' al-manqool], and they realized that uttering that by which they were commanded to worship—the saying \"There is no god but God, Muhammad is the Messenger of God\"—has no substance or yield unless there is realized a comprehensive grasp of the pivotal points and foundational principles [al-aqtab wal-usool] upon which this testimony revolves.\n\nAnd they knew that the two phrases of the testimony, despite their brevity, encompass the affirmation of the Essence [dhat] of the Divine, the affirmation of His Attributes [sifat], the affirmation of His Actions [af'al], and the affirmation of the truthfulness of the Messenger. And they learned that faith [al-iman] is built upon these pillars, which are four, and each pillar revolves upon ten foundational principles [usool].\n\nThe First Pillar is in the knowledge [ma'rifa] of the Essence [dhat] of God, the Exalted, and its orbit is upon ten foundational principles [usool]: The knowledge of the existence [wujud] of God, the Exalted, His Pre-Eternity [qidam], His Everlastingness [baqa'], that He is not a substance [jawhar] nor a body [jism] nor an accident ['arad], that He, Glory be to Him, is not specified by a direction [jiha] nor settled in a place [makan], that He will be seen [yura], and that He is One [wahid].\n\nThe Second Pillar is in His Attributes [sifat] and comprises ten foundational principles [usool]: The knowledge that He is Living [hayy], Knowing ['alim], Powerful [qadir], Willing [murid], Hearing [sami'], Seeing [basir], Speaking [mutakallim], sanctified from the inherence of temporal events [hulool al-hawadith], and that His Speech [kalam], Knowledge ['ilm], and Will [irada] are Pre-Eternal [qadim].\n\nThe Third Pillar is in His Actions [af'al], the Exalted, and its orbit is upon ten foundational principles [usool]: That the actions of the servants are created [makhluqa] by God, the Exalted, that they are acquired [muktasaba] by the servants, that they are willed [murada] by God, the Exalted, that He is the Bestower of favor [mutafaddil] through creation and origination, that He, the Exalted, imposes obligation [taklif] of what is beyond capacity, that for Him, the Exalted, is the causing of pain to the innocent, and that it is not incumbent upon Him to observe what is most beneficial, that nothing is obligatory [wajib] except by the Sacred Law [al-shar'], that the sending of the prophets is permissible, and that the prophethood [nubuwwa] of our Prophet Muhammad (peace be upon him) is established, confirmed by the miracle [al-mu'jiza].\n\nThe Fourth Pillar is in the transmitted matters [al-sam'iyyat] and its orbit is upon ten foundational principles [usool]: The affirmation of the Gathering [al-hashr] and the Resurrection [al-nushur], the questioning by Munkar and Nakir, the punishment of the grave ['adhab al-qabr], the Scale [al-mizan], the Bridge [al-sirat], the creation of Paradise [al-janna] and the Fire [al-nar], the rulings concerning the Imamate [al-imama], that the merit of the Companions is according to their order, and the conditions of the Imamate.\n\n(As for the First Pillar from the pillars of faith [arkan al-iman], in the knowledge [ma'rifa] of the Essence [dhat] of God, Glory be to Him, the Exalted, and that God, the Exalted, is One, and its orbit is upon ten foundational principles [usool]) The First Principle [al-asl al-awwal]: The knowledge [ma'rifa] of His Existence [wujud], the Exalted. And the first of the lights [al-anwar] by which illumination is sought, and the path of consideration [tariq al-i'tibar] which is embarked upon, is that to which the Qur'an has guided, for there is no clarification after the clarification of God, Glory be to Him. And indeed He, the Exalted, has said: \"Have We not made the earth a resting place? And the mountains as stakes? And created you in pairs? And made your sleep for rest? And made the night as a covering? And made the day for livelihood? And constructed above you seven strong [heavens]? And made [therein] a burning lamp? And sent down, from the rain clouds, pouring water? That We may bring forth thereby grain and vegetation? And gardens of entwined growth?\" And He, the Exalted, said: \"Indeed, in the creation of the heavens and the earth and the alternation of the night and the day and the ships which sail through the sea with that which benefits people, and what God has sent down from the sky of rain, giving life thereby to the earth after its lifelessness and dispersing therein every kind of moving creature, and [in His] directing of the winds and the clouds controlled between the heaven and the earth are signs for a people who use reason.\" And He, the Exalted, said: \"Do you not see how God created seven heavens in layers? And made the moon therein a light and made the sun a lamp? And God caused you to grow from the earth a growth? Then He will return you into it and extract you [another] extraction.\" And He, the Exalted, said: \"Then do you see that which you emit? Is it you who creates it, or are We the Creator?\" up to His saying: \"for those in need.\" So it is not hidden from one who possesses the slightest shred of intellect ['aql], if he reflects with the least thought upon the content of these verses and turns his gaze upon the wonders of God's creation in the earth and the heavens and the marvels of the natural constitution [fitra] of animals and plants, that this amazing affair and this precise arrangement cannot dispense with a Maker [sani'] who manages it and an Agent [fa'il] who governs and determines it. Rather, the very natural constitution [fitra] of souls almost testifies to their being subdued under His subjugation and directed according to the requirement of His management. And for that reason God, the Exalted, said: \"Is there doubt concerning God, Creator of the heavens and the earth?\" And for this He sent the prophets, the prayers of God be upon them, to call the creation to Oneness [al-tawhid], so that they would say \"There is no god but God,\" and they were not commanded to say \"For us is a god and for the world is a god,\" for that was already ingrained in the natural constitution [fitra] of their intellects from the beginning of their origin and in the prime of their youth. And for that reason He, the Mighty and Majestic, said: \"And if you asked them, 'Who created the heavens and the earth?' they would surely say, 'God.'\" And He, the Exalted, said: \"So direct your face toward the religion, inclining to truth. [Adhere to] the natural constitution [fitra] of God upon which He has created [all] people. No change should there be in the creation of God. That is the correct religion.\"\n\nThus, in the natural constitution [fitra] of man and the evidences of the Qur'an is that which suffices from establishing a formal proof [al-burhan]. But we, on the path of seeking support and emulating the speculative scholars [al-'ulama' al-nuzzar], say: From the self-evident truths of intellects ['aql] is that the originated [al-hadith] cannot, in its origination, dispense with a cause [sabab] that originates it. And the world ['alam] is originated [hadith]. Therefore, it cannot, in its origination, dispense with a cause. As for our saying that the originated cannot, in its origination, dispense with a cause, this is evident, for every originated thing is specified by a time for which it is possible in the intellect to conceive of its being advanced or delayed. So its specification to its time, to the exclusion of what is before it and after it, necessitates by necessity a Specifier [al-mukhassis]. And as for our saying the world is originated, its proof is that the bodies [ajsam] of the world do not cease...\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.08","h":"0.3","c":"وَالْجِبَالَ","d":"َlāَbِjgْlٱَw","e":"wal-jibāla"},{"b":"1.4","h":"2.14","c":"أَوْتَادًا","d":"āًdāَtْwَaʾ","e":"awtādan"}],"a":{"g":"And the mountains as stakes?"}},"8":{"w":[{"b":"0.03","h":"0.4","c":"وَخَلَقْنَاكُمْ","d":"ْmُkَٰnْqَlَhkَw","e":"wakhalaqnākum"},{"b":"2.0","h":"3.06","c":"أَزْوَاجًا","d":"āًjgَٰwْzَaʾ","e":"azwājan"}],"a":{"g":"And We created you in pairs"}},"9":{"w":[{"b":"0.03","h":"0.3","c":"وَجَعَلْنَا","d":"āَnْlَʿعَjgَw","e":"wajaʿalnā"},{"b":"1.5","h":"2.28","c":"نَوْمَكُمْ","d":"ْmُkَmْwَn","e":"nawmakum"},{"b":"2.6","h":"3.95","c":"سُبَاتًا","d":"āًtāَbُs","e":"subātan"}],"a":{"g":"And made your sleep [a means for] rest"}},"10":{"w":[{"b":"0.03","h":"0.51","c":"وَجَعَلْنَا","d":"āَnْlَʿعَjgَw","e":"wajaʿalnā"},{"b":"1.1","h":"2.05","c":"اللَّيْلَ","d":"َlْyَّlٱ","e":"al-layla"},{"b":"2.1","h":"3.46","c":"لِبَاسًا","d":"āًsāَbِl","e":"libāsan"}],"a":{"g":"And made the night as clothing"}},"11":{"w":[{"b":"0.03","h":"0.53","c":"وَجَعَلْنَا","d":"āَnْlَʿعَjgَw","e":"wajaʿalnā"},{"b":"1.4","h":"2.25","c":"النَّهَارَ","d":"َrāَhَّnlٱ","e":"l-nahāra"},{"b":"3.1","h":"4.41","c":"مَعَاشًا","d":"āًhsāَʿعَm","e":"maʿāshan"}],"a":{"g":"And made the day for livelihood","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فذكره في معرض الامتنان\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, I have mentioned it in the context of bestowing favor [ni'mah].\n            </div>\n        </div>\n        "}},"12":{"w":[{"b":"0.03","h":"0.31","c":"وَبَنَيْنَا","d":"āَnْyَnَbَw","e":"wabanaynā"},{"b":"1.4","h":"2.3","c":"فَوْقَكُمْ","d":"ْmُkَqْwَf","e":"fawqakum"},{"b":"2.5","h":"4.07","c":"سَبْعًا","d":"āًʿعْbَs","e":"sabʿan"},{"b":"4.1","h":"5.8","c":"شِدَادًا","d":"āًdāَdِhs","e":"shidādan"}],"a":{"g":"And constructed above you seven strong [heavens]","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال سبحانه وبنينا فوقكم سبعا شدادا فأى نسبة لجميع البحار والأرض إلى السماء وهى متغيرات على القرب والسموات صلاب شداد محفوظات عن التغير إلى أن يبلغ الكتاب أجله ولذلك سماه الله تعالى محفوظا فقال وجعلنا السماء سقفا محفوظا.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                And He, the Exalted, said: \"And We built above you seven strong [heavens].\" So what is the proportion of all the seas and the earth to the sky [sama'], when they are subject to change in proximity, while the heavens [samawat] are solid, strong, preserved from change until the Book reaches its appointed term? And for that reason, God, the Exalted, named it 'preserved' [mahfuz], saying: \"And We made the sky a roof, preserved.\"\n            </div>\n        </div>\n        "}},"13":{"w":[{"b":"0.08","h":"0.7","c":"وَجَعَلْنَا","d":"āَnْlَʿعَjgَw","e":"wajaʿalnā"},{"b":"1.4","h":"2.64","c":"سِرَاجًا","d":"āًjgāَrِs","e":"sirājan"},{"b":"2.3","h":"4.22","c":"وَهَّاجًا","d":"āًjgāَّhَw","e":"wahhājan"}],"a":{"g":"And made [therein] a burning lamp"}},"14":{"w":[{"b":"0.03","h":"0.54","c":"وَأَنْزَلْنَا","d":"āَnْlَznَaʾَw","e":"wa-anzalnā"},{"b":"2.2","h":"3.27","c":"مِنَ","d":"َnِm","e":"mina"},{"b":"2.5","h":"3.86","c":"الْمُعْصِرَاتِ","d":"ِtَٰrِṣْʿعُmْlٱ","e":"l-muʿ'ṣirāti"},{"b":"4.4","h":"6.57","c":"مَاءً","d":"ًءٓāَm","e":"māan"},{"b":"6.9","h":"9.32","c":"ثَجَّاجًا","d":"āًjgāَّjgَht","e":"thajjājan"}],"a":{"g":"And sent down, from the rain clouds, pouring water"}},"15":{"w":[{"b":"0.05","h":"1.15","c":"لِنُخْرِجَ","d":"َjgِrْhkُnِّl","e":"linukh'rija"},{"b":"1.1","h":"2.74","c":"بِهِ","d":"ۦِhِb","e":"bihi"},{"b":"1.7","h":"3.78","c":"حَبًّا","d":"āًّbَḥ","e":"ḥabban"},{"b":"2.4","h":"5.02","c":"وَنَبَاتًا","d":"āًtāَbَnَw","e":"wanabātan"}],"a":{"g":"That We may bring forth thereby grain and vegetation"}},"16":{"w":[{"b":"0.03","h":"0.06","c":"وَجَنَّاتٍ","d":"ٍtَّٰnَjgَw","e":"wajannātin"},{"b":"2.2","h":"2.99","c":"أَلْفَافًا","d":"āًfāَfْlَaʾ","e":"alfāfan"}],"a":{"g":"And gardens of entwined growth."}},"17":{"w":[{"b":"0.84","h":"0.65","c":"إِنَّ","d":"َّnِiʾ","e":"inna"},{"b":"1.1","h":"1.95","c":"يَوْمَ","d":"َmْwَy","e":"yawma"},{"b":"1.9","h":"3.07","c":"الْفَصْلِ","d":"ِlْṣَfْlٱ","e":"l-faṣli"},{"b":"2.8","h":"4.63","c":"كَانَ","d":"َnāَk","e":"kāna"},{"b":"3.6","h":"5.85","c":"مِيقَاتًا","d":"āًtَٰqyِm","e":"mīqātan"}],"a":{"g":"Indeed, the Day of Judgement is an appointed time -"}},"18":{"w":[{"b":"0.05","h":"0.25","c":"يَوْمَ","d":"َmْwَy","e":"yawma"},{"b":"0.64","h":"1.17","c":"يُنْفَخُ","d":"ُhkَfnُy","e":"yunfakhu"},{"b":"2.1","h":"2.88","c":"فِي","d":"àِf","e":"fī"},{"b":"2.3","h":"3.2","c":"الصُّورِ","d":"ِrwُّṣlٱ","e":"l-ṣūri"},{"b":"3.3","h":"4.64","c":"فَتَأْتُونَ","d":"َnwُtْaʾَtَf","e":"fatatūna"},{"b":"4.8","h":"6.91","c":"أَفْوَاجًا","d":"āًjgāَwْfَaʾ","e":"afwājan"}],"a":{"g":"The Day the Horn is blown and you will come forth in multitudes"}},"19":{"w":[{"b":"0.03","h":"0.3","c":"وَفُتِحَتِ","d":"ِtَḥِtُfَw","e":"wafutiḥati"},{"b":"1.1","h":"1.98","c":"السَّمَاءُ","d":"ُءٓāَmَّslٱ","e":"l-samāu"},{"b":"3.6","h":"4.81","c":"فَكَانَتْ","d":"ْtَnāَkَf","e":"fakānat"},{"b":"4.8","h":"6.83","c":"أَبْوَابًا","d":"āًbَٰwْbَaʾ","e":"abwāban"}],"a":{"g":"And the heaven is opened and will become gateways"}},"20":{"w":[{"b":"0.03","h":"0.08","c":"وَسُيِّرَتِ","d":"ِtَrِّyُsَw","e":"wasuyyirati"},{"b":"1.4","h":"2.25","c":"الْجِبَالُ","d":"ُlāَbِjgْlٱ","e":"l-jibālu"},{"b":"2.6","h":"3.89","c":"فَكَانَتْ","d":"ْtَnāَkَf","e":"fakānat"},{"b":"3.7","h":"5.62","c":"سَرَابًا","d":"āًbāَrَs","e":"sarāban"}],"a":{"g":"And the mountains are removed and will be [but] a mirage."}},"21":{"w":[{"b":"0.03","h":"1.45","c":"إِنَّ","d":"َّnِiʾ","e":"inna"},{"b":"1.2","h":"2.78","c":"جَهَنَّمَ","d":"َmَّnَhَjg","e":"jahannama"},{"b":"2.8","h":"4.87","c":"كَانَتْ","d":"ْtَnāَk","e":"kānat"},{"b":"3.8","h":"6.48","c":"مِرْصَادًا","d":"āًdāَṣْrِm","e":"mir'ṣādan"}],"a":{"g":"Indeed, Hell has been lying in wait"}},"22":{"w":[{"b":"0.03","h":"0.06","c":"لِلطَّاغِينَ","d":"َnyِغَّٰṭlِّl","e":"lilṭṭāghīna"},{"b":"1.7","h":"2.63","c":"مَءَابًا","d":"āًbāَٔـَm","e":"maāban"}],"a":{"g":"For the transgressors, a place of return,"}},"23":{"w":[{"b":"0.07","h":"0.25","c":"لَابِثِينَ","d":"َnyِhtِbَّٰl","e":"lābithīna"},{"b":"1.4","h":"2.23","c":"فِيهَا","d":"ٓāَhyِf","e":"fīhā"},{"b":"2.8","h":"4.68","c":"أَحْقَابًا","d":"āًbāَqْḥَaʾ","e":"aḥqāban"}],"a":{"g":"In which they will remain for ages [unending]."}},"24":{"w":[{"b":"0.05","h":"0.04","c":"لَا","d":"āَّl","e":"lā"},{"b":"0.48","h":"0.69","c":"يَذُوقُونَ","d":"َnwُqwُhdَy","e":"yadhūqūna"},{"b":"1.9","h":"2.9","c":"فِيهَا","d":"āَhyِf","e":"fīhā"},{"b":"2.9","h":"4.57","c":"بَرْدًا","d":"āًdْrَb","e":"bardan"},{"b":"4.7","h":"5.75","c":"وَلَا","d":"āَlَw","e":"walā"},{"b":"5.3","h":"7.47","c":"شَرَابًا","d":"āًbāَrَhs","e":"sharāban"}],"a":{"g":"They will not taste therein [any] coolness or drink"}},"25":{"w":[{"b":"0.03","h":"0.3","c":"إِلَّا","d":"āَّlِiʾ","e":"illā"},{"b":"0.9","h":"1.58","c":"حَمِيمًا","d":"āًmyِmَḥ","e":"ḥamīman"},{"b":"2.9","h":"3.15","c":"وَغَسَّاقًا","d":"āًqāَّsَغَw","e":"waghassāqan"}],"a":{"g":"Except scalding water and [foul] purulence -"}},"26":{"w":[{"b":"0.03","h":"0.66","c":"جَزَاءً","d":"ًءٓāَzَjg","e":"jazāan"},{"b":"3.1","h":"4.05","c":"وِفَاقًا","d":"āًqāَfِw","e":"wifāqan"}],"a":{"g":"An appropriate recompense.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وكما قال تعالى: \" جزاء وفاقاً \" أي وافق الجزاء أعمالهم فقوبل الخالص بالصرف من الشراب وقوبل المشوب بالمشوب، وشوب كل شراب على قدر ما سبق من الشوب في حبه وأعماله \" فمن يعمل مثقال ذرة خيراً يره ومن يعمل مثقال ذرة شراً يره - وإن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم - إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها - وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين \" فمن كان حبه في الدنيا رجاءه لنعيم الجنة والحور العين والقصور مكن من الجنة ليتبوأ منها حيث يشاء فيلعب مع الولدان ويتمتع بالنسوان؛ فهناك تنتهي لذته في الآخرة لأنه إنما يعطى كل إنسان في المحبة ما تشتهيه نفسه وتلذ عينه. ومن كان مقصده رب الدار ومالك الملك ولم يغلب عليه إلا حبه بالإخلاص والصدق، أنزل \" في مقعد صدق عند مليك مقتدر \".\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, as the Almighty has said: \"A recompense in proportion [jazā'an wifāqan]\" – meaning the recompense corresponded to their deeds. So the pure was met with the pure of drink, and the mixed was met with the mixed. And every drink is mixed in proportion to what preceded of mixture in his love [hubb] and his deeds. \"So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it\" – \"And indeed, Allah does not change the condition of a people until they change what is in themselves\" – \"Indeed, Allah does not do injustice, [even] as much as an atom's weight. And if there is a good deed, He multiplies it\" – \"And if it should be the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant.\"\n\nSo whoever his love [hubb] in the world [dunyā] was his hope for the bliss of Paradise [al-jannah] and the maidens with large, [beautiful] eyes and the palaces, he is granted access to Paradise to settle therein wherever he wishes, to play with the immortal boys and enjoy the women; there his pleasure [ladhdha] in the Hereafter [al-ākhira] ends, for indeed, every person is given in love [hubb] what his soul [nafs] desires and what delights his eye.\n\nAnd whoever his aim was the Lord of the Abode and the Owner of Sovereignty, and nothing overcame him except his love [hubb] with sincerity [ikhlāṣ] and truthfulness [ṣidq], he is settled \"in a seat of honor [maq'ad ṣidq] near a Sovereign, Perfect in Ability.\"\n            </div>\n        </div>\n        "}},"27":{"w":[{"b":"0.03","h":"0.15","c":"إِنَّهُمْ","d":"ْmُhَّnِiʾ","e":"innahum"},{"b":"1.4","h":"2.02","c":"كَانُوا","d":"۟āwُnāَk","e":"kānū"},{"b":"2.5","h":"3.58","c":"لَا","d":"āَl","e":"lā"},{"b":"2.9","h":"4.31","c":"يَرْجُونَ","d":"َnwُjgْrَy","e":"yarjūna"},{"b":"4.1","h":"6.23","c":"حِسَابًا","d":"āًbāَsِḥ","e":"ḥisāban"}],"a":{"g":"Indeed, they were not expecting an account"}},"28":{"w":[{"b":"0.03","h":"0.2","c":"وَكَذَّبُوا","d":"۟āwُbَّhdَkَw","e":"wakadhabū"},{"b":"1.4","h":"2.21","c":"بِءَايَاتِنَا","d":"āَnِtَٰyāَٔـِb","e":"biāyātinā"},{"b":"3.4","h":"5.27","c":"كِذَّابًا","d":"āًbāَّhdِk","e":"kidhāban"}],"a":{"g":"And denied Our verses with [emphatic] denial."}},"29":{"w":[{"b":"0.03","h":"0.26","c":"وَكُلَّ","d":"َّlُkَw","e":"wakulla"},{"b":"0.93","h":"1.52","c":"شَيْءٍ","d":"ٍءْàَhs","e":"shayin"},{"b":"1.9","h":"3.04","c":"أَحْصَيْنَاهُ","d":"ُhَٰnْyَṣْḥَaʾ","e":"aḥṣaynāhu"},{"b":"3.6","h":"5.66","c":"كِتَابًا","d":"āًbَٰtِk","e":"kitāban"}],"a":{"g":"But all things We have enumerated in writing."}},"30":{"w":[{"b":"0.03","h":"0.06","c":"فَذُوقُوا","d":"۟āwُqwُhdَf","e":"fadhūqū"},{"b":"1.7","h":"2.08","c":"فَلَنْ","d":"nَlَf","e":"falan"},{"b":"2.4","h":"2.79","c":"نَزِيدَكُمْ","d":"ْmُkَdyِzَّn","e":"nazīdakum"},{"b":"4.6","h":"5.63","c":"إِلَّا","d":"āَّlِiʾ","e":"illā"},{"b":"5.5","h":"6.96","c":"عَذَابًا","d":"āًbāَhdَʿع","e":"ʿadhāban"}],"a":{"g":"\"So taste [the penalty], and never will We increase you except in torment.\""}},"31":{"w":[{"b":"0.87","h":"0.55","c":"إِنَّ","d":"َّnِiʾ","e":"inna"},{"b":"1.3","h":"1.93","c":"لِلْمُتَّقِينَ","d":"َnyِqَّtُmْlِl","e":"lil'muttaqīna"},{"b":"3.1","h":"4.68","c":"مَفَازًا","d":"āًzāَfَm","e":"mafāzan"}],"a":{"g":"Indeed, for the righteous is attainment -"}},"32":{"w":[{"b":"1.6","h":"0.85","c":"حَدَائِقَ","d":"َqِyʾٓāَdَḥ","e":"ḥadāiqa"},{"b":"2.3","h":"3.26","c":"وَأَعْنَابًا","d":"āًbَٰnْʿعَaʾَw","e":"wa-aʿnāban"}],"a":{"g":"Gardens and grapevines"}},"33":{"w":[{"b":"0.08","h":"0.4","c":"وَكَوَاعِبَ","d":"َbِʿعāَwَkَw","e":"wakawāʿiba"},{"b":"1.5","h":"2.58","c":"أَتْرَابًا","d":"āًbāَrْtَaʾ","e":"atrāban"}],"a":{"g":"And full-breasted [companions] of equal age"}},"34":{"w":[{"b":"0.03","h":"0.25","c":"وَكَأْسًا","d":"āًsْaʾَkَw","e":"wakasan"},{"b":"1.6","h":"2.48","c":"دِهَاقًا","d":"āًqāَhِd","e":"dihāqan"}],"a":{"g":"And a full cup."}},"35":{"w":[{"b":"0.04","h":"0.15","c":"لَا","d":"āَّl","e":"lā"},{"b":"0.47","h":"0.87","c":"يَسْمَعُونَ","d":"َnwُʿعَmْsَy","e":"yasmaʿūna"},{"b":"1.8","h":"2.97","c":"فِيهَا","d":"āَhyِf","e":"fīhā"},{"b":"2.7","h":"4.68","c":"لَغْوًا","d":"āًwْغَl","e":"laghwan"},{"b":"4.4","h":"5.84","c":"وَلَا","d":"āَlَw","e":"walā"},{"b":"4.9","h":"7.59","c":"كِذَّابًا","d":"āًbَّٰhdِk","e":"kidhāban"}],"a":{"g":"No ill speech will they hear therein or any falsehood -"}},"36":{"w":[{"b":"0.04","h":"0.03","c":"جَزَاءً","d":"ًءٓāَzَjg","e":"jazāan"},{"b":"2.7","h":"3.29","c":"مِنْ","d":"nِّm","e":"min"},{"b":"2.7","h":"3.55","c":"رَبِّكَ","d":"َkِّbَّr","e":"rabbika"},{"b":"3.9","h":"5.42","c":"عَطَاءً","d":"ًءٓāَṭَʿع","e":"ʿaṭāan"},{"b":"6.4","h":"8.29","c":"حِسَابًا","d":"āًbāَsِḥ","e":"ḥisāban"}],"a":{"g":"[As] reward from your Lord, [a generous] gift [made due by] account,"}},"37":{"w":[{"b":"0.04","h":"0.46","c":"رَبِّ","d":"ِّbَّr","e":"rabbi"},{"b":"0.71","h":"1.39","c":"السَّمَاوَاتِ","d":"ِtَٰwَٰmَّslٱ","e":"l-samāwāti"},{"b":"2.4","h":"3.86","c":"وَالْأَرْضِ","d":"ِḍْrَaʾْlٱَw","e":"wal-arḍi"},{"b":"3.5","h":"5.5","c":"وَمَا","d":"āَmَw","e":"wamā"},{"b":"4.2","h":"6.49","c":"بَيْنَهُمَا","d":"āَmُhَnْyَb","e":"baynahumā"},{"b":"6.8","h":"8.14","c":"الرَّحْمَنِ","d":"ِnَٰmْḥَّrlٱ","e":"l-raḥmāni"},{"b":"8.8","h":"10.34","c":"لَا","d":"āَl","e":"lā"},{"b":"9.3","h":"11.06","c":"يَمْلِكُونَ","d":"َnwُkِlْmَy","e":"yamlikūna"},{"b":"10.","h":"13.21","c":"مِنْهُ","d":"ُhْnِm","e":"min'hu"},{"b":"11.4","h":"14.21","c":"خِطَابًا","d":"āًbāَṭِhk","e":"khiṭāban"}],"a":{"g":"[From] the Lord of the heavens and the earth and whatever is between them, the Most Merciful. They possess not from Him [authority for] speech."}},"38":{"w":[{"b":"0.04","h":"0.75","c":"يَوْمَ","d":"َmْwَy","e":"yawma"},{"b":"0.69","h":"1.62","c":"يَقُومُ","d":"ُmwُqَy","e":"yaqūmu"},{"b":"1.9","h":"3.61","c":"الرُّوحُ","d":"ُḥwُّrlٱ","e":"l-rūḥu"},{"b":"2.6","h":"4.74","c":"وَالْمَلَائِكَةُ","d":"ُẗَkِyʾَٰٓlَmْlٱَw","e":"wal-malāikatu"},{"b":"5.5","h":"8.61","c":"صَفًّا","d":"āًّfَṣ","e":"ṣaffan"},{"b":"6.1","h":"9.49","c":"لَا","d":"āَّl","e":"lā"},{"b":"6.9","h":"10.84","c":"يَتَكَلَّمُونَ","d":"َnwُmَّlَkَtَy","e":"yatakallamūna"},{"b":"12.6","h":"13.61","c":"إِلَّا","d":"āَّlِiʾ","e":"illā"},{"b":"13.7","h":"15","c":"مَنْ","d":"ْnَm","e":"man"},{"b":"14.1","h":"15.7","c":"أَذِنَ","d":"َnِhdَaʾ","e":"adhina"},{"b":"14.8","h":"16.77","c":"لَهُ","d":"ُhَl","e":"lahu"},{"b":"15.","h":"17.88","c":"الرَّحْمَنُ","d":"ُnَٰmْḥَّrlٱ","e":"l-raḥmānu"},{"b":"16.8","h":"19.64","c":"وَقَالَ","d":"َlāَqَw","e":"waqāla"},{"b":"17.6","h":"21","c":"صَوَابًا","d":"āًbāَwَṣ","e":"ṣawāban"}],"a":{"g":"The Day that the Spirit and the angels will stand in rows, they will not speak except for one whom the Most Merciful permits, and he will say what is correct.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقوله تعالى: ﴿ لا يتكلمون إلا من أذن له الرحمن وقال صوابا ﴾ والقرآن من أوله إلى آخره مخاوف لمن قرأه بتدبر\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the word of the Almighty: \"None will speak except whom the Most Merciful [al-Rahman] has permitted, and he will say what is correct [sawab].\" And the Qur'an, from its beginning to its end, is a source of warnings [makhawif] for whoever recites it with contemplation [tadabbur].\n            </div>\n        </div>\n        "}},"39":{"w":[{"b":"0.08","h":"1.2","c":"ذَلِكَ","d":"َkِlَٰhd","e":"dhālika"},{"b":"0.97","h":"2.5","c":"الْيَوْمُ","d":"ُmْwَyْlٱ","e":"l-yawmu"},{"b":"1.9","h":"4.04","c":"الْحَقُّ","d":"ُّqَḥْlٱ","e":"l-ḥaqu"},{"b":"3.3","h":"6.9","c":"فَمَنْ","d":"nَmَf","e":"faman"},{"b":"4.5","h":"8.15","c":"شَاءَ","d":"َءٓāَhs","e":"shāa"},{"b":"6.4","h":"10.64","c":"اتَّخَذَ","d":"َhdَhkَّtٱ","e":"ittakhadha"},{"b":"7.4","h":"12.14","c":"إِلَى","d":"ٰàَlِiʾ","e":"ilā"},{"b":"8.1","h":"13.17","c":"رَبِّهِ","d":"ۦِhِّbَr","e":"rabbihi"},{"b":"9.3","h":"15.33","c":"مَءَابًا","d":"āًbāَٔـَm","e":"maāban"}],"a":{"g":"That is the True Day; so he who wills may take to his Lord a [way of] return."}},"40":{"w":[{"b":"0.03","h":"0.25","c":"إِنَّا","d":"ٓāَّnِiʾ","e":"innā"},{"b":"3.6","h":"1.66","c":"أَنْذَرْنَاكُمْ","d":"ْmُkَٰnْrَhdnَaʾ","e":"andharnākum"},{"b":"5.2","h":"6.49","c":"عَذَابًا","d":"āًbāَhdَʿع","e":"ʿadhāban"},{"b":"6.8","h":"8.98","c":"قَرِيبًا","d":"āًbyِrَq","e":"qarīban"},{"b":"8.5","h":"10.3","c":"يَوْمَ","d":"َmْwَy","e":"yawma"},{"b":"9.2","h":"12.1","c":"يَنْظُرُ","d":"ُrُẓnَy","e":"yanẓuru"},{"b":"10.5","h":"13.77","c":"الْمَرْءُ","d":"ُءْrَmْlٱ","e":"l-maru"},{"b":"11.5","h":"15.1","c":"مَا","d":"āَm","e":"mā"},{"b":"12.0","h":"15.73","c":"قَدَّمَتْ","d":"ْtَmَّdَq","e":"qaddamat"},{"b":"13.2","h":"17.41","c":"يَدَاهُ","d":"ُhāَdَy","e":"yadāhu"},{"b":"16.6","h":"19.03","c":"وَيَقُولُ","d":"ُlwُqَyَw","e":"wayaqūlu"},{"b":"17.9","h":"20.76","c":"الْكَافِرُ","d":"ُrِfāَkْlٱ","e":"l-kāfiru"},{"b":"19.3","h":"22.7","c":"يَالَيْتَنِي","d":"àِnَtْyَlَٰy","e":"yālaytanī"},{"b":"21.2","h":"25.41","c":"كُنْتُ","d":"ُtnُk","e":"kuntu"},{"b":"22.5","h":"27.1","c":"تُرَابًا","d":"āًۢbَٰrُt","e":"turāban"}],"a":{"g":"Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, \"Oh, I wish that I were dust!\"","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وفي عم يتساءلون ﴿ يوم ينظر المرء ما قدمت يداه ﴾ {} الآية، والقرآن من أوله إلى آخره مخاوف لمن قرأه بتدبر.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, in the verse \"On the Day when a man will see what his hands have sent forth\" [78:40]—and the Qur'an, from its beginning to its end, is a source of warnings [mukhawwif] for whoever recites it with contemplation [tadabbur].\n            </div>\n        </div>\n        "}}}