{"1":{"w":[{"b":"0.05","h":"0.03","c":"وَيْلٌ","d":"waylun","e":"Woe"},{"b":"0.75","h":"1.39","c":"لِلْمُطَفِّفِينَ","d":"lil'muṭaffifīna","e":"to those who give less"}],"a":{"g":"Woe to those who give less [than due],","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فيجب أن يكيل كما يكتال قال الله تعالى ويل للمطففين الذين إذا اكتالوا على الناس يستوفون وإذا كالوهم أو وزنوهم يخسرون ولا يخلص من هذا إلا بأن يرجع إذا أعطي وينقص إذا أخذ إذ العدل الحقيقي قلما يتصور فليستظهر بظهور الزيادة والنقصان فإن من استقصى حقه بكماله يوشك أن يتعداه وكان بعضهم يقول لا أشتري الويل من الله بحبة فكان إذا أخذ نقص نصف حبة وإذا أعطى زاد حبة وكان يقول ويل لمن باع بحبة جنة عرضها السموات والأرض وما أخسر من باع طوبى بويل وإنما بالغوا في الاحتراز من هذا وشبهه لأنها مظالم لا يمكن التوبة منها إذ لا يعرف أصحاب الحبات حتى يجمعهم ويؤدي حقوقهم ولذلك لما اشترى رسول الله صلى الله عليه وسلم شيئا قال للوزان لما كان يزن ثمنه زن وأرجح حديث قال للوزان زن وأرجح رواه أصحاب السنن والحاكم من حديث سويد بن قيس قال الترمذي حسن صحيح وقال الحاكم صحيح على شرط مسلم ونظر فضيل إلى ابنه وهو يغسل دينارا يريد أن يصرفه ويزيل تكحيله وينقيه حتى لا يزيد وزنه بسبب ذلك فقال يا بني فعلك هذا أفضل من حجتين وعشرين عمرة وقال بعض السلف عجبت للتاجر والبائع كيف ينجو يزن ويحلف بالنهار وينام بالليل وقال سليمان عليه السلام لابنه يا بني كما تدخل الحبة بين الحجرين كذلك تدخل الخطيئة بين المتبايعين وصلى بعض الصالحين على مخنث فقيل له إنه كان فاسقا فسكت فأعيد عليه فقال كأنك قلت لي كان صاحب ميزانين يعطي بأحدهما ويأخذ بالآخر أشار به إلى أن فسقه مظلمة بينه وبين الله تعالى وهذا من مظالم العباد والمسامحة والعفو فيه أبعد والتشديد في أمر الميزان عظيم والخلاص منه يحصل بحبة ونصف حبة وفي قراءة عبد الله بن مسعود رضي الله عنه لا تطغوا في الميزان وأقيموا الوزن باللسان ولا تخسروا الميزان أي لسان الميزان فإن النقصان والرجحان يظهر بميله وبالجملة كل من ينتصف لنفسه من غيره ولو في كلمة ولا ينصف بمثل ما ينتصف فهو داخل تحت قوله تعالى ويل للمطففين الذين إذا اكتالوا على الناس يستوفون الآيات فإن تحريم ذلك في المكيل ليس لكونه مكيلا بل لكونه أمرا مقدودا ترك العدل والنصفة فيه فهو جار في جميع الأعمال فصاحب الميزان في خطر الويل وكل مكلف فهو صاحب موازين في أفعاله وأقواله وخطراته فالويل له إن عدل عن العدل ومال عن الاستقامة ولولا تعذر هذا واستحالته لما ورد قوله تعالى وإن منكم إلا واردها كان على ربك حتما مقضيا فلا ينفك عبد ليس معصوما عن الميل عن الاستقامة إلا أن درجات الميل تتفاوت تفاوتا عظيما فلذلك تتفاوت مدة مقامهم في النار إلى أوان الخلاص حتى لا يبقى بعضهم إلا بقدر تحلة القسم ويبقى بعضهم ألفا وألوف سنين فنسأل الله تعالى أن يقربنا من الاستقامة والعدل فإن الاشتداد على متن الصراط المستقيم من غير ميل عنه غير مطموع فيه فإنه أدق من الشعرة وأحد من السيف ولولاه لكان المستقيم عليه لا يقدر على جواز الصراط الممدود على متن النار الذي من صفته أنه أدق من الشعرة وأحد من السيف وبقدر الاستقامة على هذا الصراط المستقيم يخف العبد يوم القيامة على الصراط وكل من خلط بالطعام ترابا أو غيره ثم كاله فهو من المطففين في الكيل وكل قصاب وزن مع اللحم عظما لم تجر العادة بمثله فهو من المطففين في الوزن وقس على هذا سائر التقديرات حتى في الذرع الذي يتعاطاه البزاز فإنه إذا اشترى أرسل الثوب في وقت الذرع ولم يمده مدا وإذا باعه مده في الذرع ليظهر\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, one must measure as he would be measured. Allah the Exalted has said: **\"Woe to the defrauders [al-mutaffifin]—those who, when they take a measure from people, take in full, but when they measure or weigh for them, they give less.\"** (83:1-3). And one is not saved from this except by giving more when he gives and taking less when he takes, for true justice [al-'adl al-haqiqi] is scarcely conceivable. So let him seek the clear evidence of increase and decrease. For whoever exacts his right in its entirety is on the verge of transgressing it.\n\nAnd some of them would say: \"I will not purchase Woe from Allah for a single grain.\" So when he would take, he would decrease by half a grain, and when he would give, he would increase by a grain. And he would say: \"Woe to him who sells for a single grain a Paradise whose width is the heavens and the earth. And how great is the loss of him who sells bliss [tuba] for woe [wil]!\"\n\nAnd they were excessive in guarding against this and its like because they are injustices [mazalim] from which repentance is not possible, for the owners of the grains are not known so that one could gather them and fulfill their rights. And for that reason, when the Messenger of Allah, peace and blessings be upon him, purchased something, he said to the weigher as he was weighing its price: \"Weigh, and give more.\" A hadith states: He said to the weigher, \"Weigh, and give more.\" Narrated by the compilers of the Sunan and al-Hakim from the hadith of Suwayd ibn Qays. Al-Tirmidhi said: \"Hasan Sahih.\" And al-Hakim said: \"Sahih according to the conditions of Muslim.\"\n\nAnd Fudayl looked at his son as he was washing a dinar, intending to exchange it and remove its blackening and purify it so that its weight would not increase because of that, and he said: \"O my son, your doing this is better than two Hajj pilgrimages and twenty 'Umrahs.\"\n\nAnd some of the predecessors said: \"I am amazed at the merchant and the seller—how can he be saved? He weighs and swears by day, and sleeps by night.\"\n\nAnd Sulayman, peace be upon him, said to his son: \"O my son, just as a grain enters between two stones, so does a sin enter between the two parties in a transaction.\"\n\nAnd one of the righteous prayed over an effeminate man, and it was said to him: \"He was a sinner [fasiq].\" So he remained silent. It was repeated to him, and he said: \"It is as if you are telling me he was the owner of two scales: he would give with one and take with the other.\" He indicated by this that his sin was an injustice between him and Allah the Exalted. And this is from the injustices against servants [mazalim al-'ibad], and being lax and forgiving in it is more remote. And the severity in the matter of the scale is great, and salvation from it is achieved by a grain and half a grain.\n\nAnd in the recitation of 'Abdullah ibn Mas'ud, may Allah be pleased with him: **\"Do not transgress in the measure, and establish the weight with fairness, and do not diminish the measure\"**—meaning the tongue of the scale, for decrease and increase appear by its inclination.\n\nAnd in summary, everyone who demands full justice for himself from others, even in a word, but does not give justice in like manner, he falls under the saying of Allah the Exalted: **\"Woe to the defrauders—those who, when they take a measure from people, take in full...\"** (83:1-3). For the prohibition of that in what is measured is not because it is something measured, but because it is a quantified matter in which justice and fairness have been abandoned. Thus, it applies to all actions.\n\nSo the owner of the scale is in danger of the Woe, and every legally responsible person is an owner of scales in his actions, his words, and his thoughts. So the Woe is for him if he deviates from justice [al-'adl] and inclines away from uprightness [al-istiqamah]. And were it not for the difficulty and near-impossibility of this, His saying, the Exalted, would not have come: **\"And there is none of you but will come to it. This is upon your Lord an inevitability decreed.\"** (19:71). So no servant is free—who is not protected from sin—from inclining away from uprightness, except that the degrees of inclination vary with a great variation. Therefore, the duration of their stay in the Fire varies until the time of deliverance, so that some remain only for the duration of fulfilling an oath, and some remain for a thousand and thousands of years. So we ask Allah the Exalted to bring us close to uprightness and justice, for adhering firmly to the straight path [al-sirat al-mustaqim] without any deviation from it is not something to be hoped for, for it is finer than a hair and sharper than a sword. And were it not for that, the one upright upon it would not be able to cross the Sirat stretched over the midst of the Fire, whose description is that it is finer than a hair and sharper than a sword. And according to one's uprightness on this straight path, the servant is lightened on the Day of Resurrection upon the Sirat.\n\nAnd everyone who mixes food with dirt or other, then measures it, he is from the defrauders in measuring. And every butcher who weighs bone with meat in a manner not customary, he is from the defrauders in weighing. And judge by this all other estimations, even in the cubit measurement undertaken by the cloth merchant. For when he buys, he releases the cloth at the time of measuring and does not stretch it fully, and when he sells it, he stretches it in the measurement to make it appear more.\n            </div>\n        </div>\n        "}},"2":{"w":[{"b":"0.2","h":"0.03","c":"الَّذِينَ","d":"alladhīna","e":"Those who"},{"b":"1.2","h":"1.76","c":"إِذَا","d":"idhā","e":"when"},{"b":"1.6","h":"2.34","c":"اكْتَالُوا","d":"ik'tālū","e":"they take a measure"},{"b":"2.5","h":"4.16","c":"عَلَى","d":"ʿalā","e":"from"},{"b":"3.0","h":"4.78","c":"النَّاسِ","d":"l-nāsi","e":"the people"},{"b":"4.6","h":"6.63","c":"يَسْتَوْفُونَ","d":"yastawfūna","e":"they take in full"}],"a":{"g":"Who, when they take a measure from people, take in full."}},"3":{"w":[{"b":"0.15","h":"0.16","c":"وَإِذَا","d":"wa-idhā","e":"But when"},{"b":"0.87","h":"1.41","c":"كَالُوهُمْ","d":"kālūhum","e":"they give by measure (to) them"},{"b":"2.1","h":"3.69","c":"أَوْ","d":"aw","e":"or"},{"b":"2.5","h":"4.44","c":"وَزَنُوهُمْ","d":"wazanūhum","e":"they weigh (for) them"},{"b":"3.8","h":"6.57","c":"يُخْسِرُونَ","d":"yukh'sirūna","e":"they give less"}],"a":{"g":"But if they give by measure or by weight to them, they cause loss."}},"4":{"w":[{"b":"0.2","h":"0.45","c":"أَلَا","d":"alā","e":"Do not"},{"b":"0.67","h":"1.32","c":"يَظُنُّ","d":"yaẓunnu","e":"think"},{"b":"2.3","h":"3.08","c":"أُولَئِكَ","d":"ulāika","e":"those"},{"b":"4.5","h":"5.75","c":"أَنَّهُمْ","d":"annahum","e":"that they"},{"b":"7.2","h":"8.13","c":"مَبْعُوثُونَ","d":"mabʿūthūna","e":"(will be) resurrected"}],"a":{"g":"Do they not think that they will be resurrected"}},"5":{"w":[{"b":"0.09","h":"0.1","c":"لِيَوْمٍ","d":"liyawmin","e":"For a Day"},{"b":"1.0","h":"1.64","c":"عَظِيمٍ","d":"ʿaẓīmin","e":"Great"}],"a":{"g":"For a tremendous Day -"}},"6":{"w":[{"b":"0.15","h":"0.65","c":"يَوْمَ","d":"yawma","e":"(The) Day"},{"b":"0.65","h":"1.53","c":"يَقُومُ","d":"yaqūmu","e":"will stand"},{"b":"1.4","h":"3.08","c":"النَّاسُ","d":"l-nāsu","e":"mankind"},{"b":"3.1","h":"4.84","c":"لِرَبِّ","d":"lirabbi","e":"before (the) Lord"},{"b":"3.9","h":"6.28","c":"الْعَالَمِينَ","d":"l-ʿālamīna","e":"(of) the worlds"}],"a":{"g":"The Day when mankind will stand before the Lord of the worlds?","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ثم تفكر فى ازدحام الخلائق واجتماعهم حتى ازدحم على الموقف أهل السموات السبع والأرضين السبع من ملك وجن وإنس وشيطان ووحش وسبع وطير فأشرقت عليهم الشمس وقد تضاعف حرها وتبدلت عما كانت عليه من خفة أمرها ثم أدنيت من رءوس العالمين كقاب قوسين فلم يبق على الأرض ظل إلا ظل رب العالمين ولم يمكن من الاستظلال به إلا المقربون فمن بين مستظل بالعرش وبين مضح لحر الشمس قد صهرته بحرها واشتد كربه وغمه من وهجها ثم تدافعت الخلائق ودفع بعضهم بعضا لشدة الزحام واختلاف الأقدام وانضاف إليه شدة الخجلة والحياء من الافتضاح والاختزاء عند العرض على جبار السماء فاجتمع وهج الشمس وحر الأنفاس واحتراق القلوب بنار الحياء والخوف ففاض العرق من أصل كل شعرة حتى سال على صعيد القيامة ثم ارتفع على أبدانهم على قدر منازلهم عند الله فبعضهم بلغ العرق ركبتيه وبعضهم حقوية وبعضهم إلى شحمة أذنيه وبعضهم كاد يغيب فيه. قال ابن عمر: قال رسول الله ﭬ: (يوم يقوم الناس لرب العالمين حتى يغيب أحدهم فى رشحه إلى أنصاف أذنيه) فتأمل يا مسكين فى عرق أهل المحشر وشدة كربهم وفيهم من ينادى فيقول رب أرحنى من هذا الكرب والانتظار ولو إلى النار وكل ذلك ولم يلقوا بعد حسابا ولا عقابا فإنك واحد منهم ولا تدرى إلى أين يبلغ بك العرق.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, then contemplate the crowding of creation [al-khalq] and their gathering, until the inhabitants of the seven heavens and the seven earths—from angel, jinn, human, devil, beast, predator, and bird—are crowded upon the Standing Place [al-Mawqif]. And the sun shines upon them, its heat having multiplied and its nature transformed from what it was of lightness. Then it is brought near to the heads of the worlds [al-'alamin] like the distance of two bow-lengths. There remains on the earth no shade except the shade of the Lord of the worlds [Rabb al-'alamin], and none can take shelter in it except those brought near [al-Muqarrabun]. So between one taking shelter beneath the Throne [al-'Arsh] and one exposed to the sun's heat, which melts him with its heat, his distress and anguish intensify from its blaze.\n\nThen the creation [al-khalq] jostles and pushes one another due to the severity of the crowding and the confusion of feet. And to this is added the severity of shame [al-hajlah] and modesty [al-haya'] from exposure and the need to conceal oneself at the presentation before the Compeller of the heavens. So the blaze of the sun, the heat of breaths, and the burning of hearts [qulub] with the fire of modesty [al-haya'] and fear [al-khawf] combine. Then sweat flows from the root of every hair until it streams upon the plain of the Resurrection [al-Qiyamah]. Then it rises upon their bodies according to the measure of their stations [manazil] with Allah. For some, the sweat reaches his knees; for some, his waist; for some, to his earlobes; and for some, he is nearly submerged in it. Ibn 'Umar said: The Messenger of Allah, peace be upon him, said: \"A day when the people stand for the Lord of the worlds [Rabb al-'alamin], until one of them is submerged in his sweat up to half his ears.\"\n\nSo reflect, O wretched one, upon the sweat of the people of the Gathering [al-Mahshar] and the severity of their distress. Among them is one who calls out, saying: \"My Lord, relieve me from this distress and waiting, even if to the Fire.\" And all of that, and they have not yet faced the Reckoning [al-hisab] or the punishment [al-'iqab]. For you are one of them, and you do not know to where the sweat will reach you.\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.15","h":"0.5","c":"كَلَّا","d":"kallā","e":"Nay!"},{"b":"2.5","h":"2.89","c":"إِنَّ","d":"inna","e":"Indeed"},{"b":"3.6","h":"4.16","c":"كِتَابَ","d":"kitāba","e":"(the) record"},{"b":"4.5","h":"5.74","c":"الْفُجَّارِ","d":"l-fujāri","e":"(of) the wicked"},{"b":"5.7","h":"7.99","c":"لَفِي","d":"lafī","e":"(is) surely in"},{"b":"6.3","h":"9.07","c":"سِجِّينٍ","d":"sijjīnin","e":"Sijjin"}],"a":{"g":"No! Indeed, the record of the wicked is in sijjeen."}},"8":{"w":[{"b":"0.2","h":"0.37","c":"وَمَا","d":"wamā","e":"And what"},{"b":"2.2","h":"0.64","c":"أَدْرَاكَ","d":"adrāka","e":"can make you know"},{"b":"3.3","h":"4.19","c":"مَا","d":"mā","e":"what"},{"b":"3.6","h":"4.96","c":"سِجِّينٌ","d":"sijjīnun","e":"(is) Sijjin"}],"a":{"g":"And what can make you know what is sijjeen?"}},"9":{"w":[{"b":"0.25","h":"0.3","c":"كِتَابٌ","d":"kitābun","e":"A book"},{"b":"1.8","h":"2.71","c":"مَرْقُومٌ","d":"marqūmun","e":"written"}],"a":{"g":"It is [their destination recorded in] a register inscribed."}},"10":{"w":[{"b":"0.06","h":"0.03","c":"وَيْلٌ","d":"waylun","e":"Woe"},{"b":"1.6","h":"1.71","c":"يَوْمَئِذٍ","d":"yawma-idhin","e":"that Day"},{"b":"2.7","h":"3.75","c":"لِلْمُكَذِّبِينَ","d":"lil'mukadhibīna","e":"to the deniers"}],"a":{"g":"Woe, that Day, to the deniers,"}},"11":{"w":[{"b":"0.2","h":"0.35","c":"الَّذِينَ","d":"alladhīna","e":"Those who"},{"b":"1.2","h":"2.06","c":"يُكَذِّبُونَ","d":"yukadhibūna","e":"deny"},{"b":"2.6","h":"4.46","c":"بِيَوْمِ","d":"biyawmi","e":"(the) Day"},{"b":"3.4","h":"5.84","c":"الدِّينِ","d":"l-dīni","e":"(of) the Judgment"}],"a":{"g":"Who deny the Day of Recompense."}},"12":{"w":[{"b":"0.1","h":"0.3","c":"وَمَا","d":"wamā","e":"And not"},{"b":"0.67","h":"1.24","c":"يُكَذِّبُ","d":"yukadhibu","e":"can deny"},{"b":"1.7","h":"2.98","c":"بِهِ","d":"bihi","e":"[of] it"},{"b":"3.7","h":"4.99","c":"إِلَّا","d":"illā","e":"except"},{"b":"4.5","h":"6.43","c":"كُلُّ","d":"kullu","e":"every"},{"b":"5.2","h":"7.55","c":"مُعْتَدٍ","d":"muʿ'tadin","e":"transgressor"},{"b":"6.1","h":"9.3","c":"أَثِيمٍ","d":"athīmin","e":"sinful"}],"a":{"g":"And none deny it except every sinful transgressor."}},"13":{"w":[{"b":"0.15","h":"0.35","c":"إِذَا","d":"idhā","e":"When"},{"b":"0.7","h":"1.21","c":"تُتْلَى","d":"tut'lā","e":"are recited"},{"b":"1.4","h":"2.52","c":"عَلَيْهِ","d":"ʿalayhi","e":"to him"},{"b":"2.3","h":"3.92","c":"ءَايَاتُنَا","d":"āyātunā","e":"Our Verses"},{"b":"3.7","h":"6.39","c":"قَالَ","d":"qāla","e":"he says"},{"b":"4.5","h":"7.57","c":"أَسَاطِيرُ","d":"asāṭīru","e":"Stories"},{"b":"5.7","h":"9.96","c":"الْأَوَّلِينَ","d":"l-awalīna","e":"(of) the former (people)"}],"a":{"g":"When Our verses are recited to him, he says, \"Legends of the former peoples.\""}},"14":{"w":[{"b":"0.12","h":"0.45","c":"كَلَّا","d":"kallā","e":"Nay!"},{"b":"0.9","h":"1.76","c":"بَلْ","d":"bal","e":"But"},{"b":"1.7","h":"3.45","c":"رَانَ","d":"rāna","e":"(the) stain has covered"},{"b":"2.2","h":"4.28","c":"عَلَى","d":"ʿalā","e":"[over]"},{"b":"2.9","h":"5.52","c":"قُلُوبِهِمْ","d":"qulūbihim","e":"their hearts"},{"b":"5.1","h":"8.04","c":"مَا","d":"mā","e":"(for) what"},{"b":"5.4","h":"8.85","c":"كَانُوا","d":"kānū","e":"they were"},{"b":"6.3","h":"10.47","c":"يَكْسِبُونَ","d":"yaksibūna","e":"earning"}],"a":{"g":"No! Rather, the stain has covered their hearts of that which they were earning.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وهو الطبع وهو الرين قال الله تعالى كلا بل ران على قلوبهم ما كانوا يكسبون وقال عز وجل أن لو نشاء أصبناهم بذنبوهم ونطبع على قلوبهم فهم لا يسمعون فربط عدم السماع بالطبع بالذنوب كما ربط السماع بالتقوى فقال تعالى واتقوا الله واسمعوا واتقوا الله ويعلمكم الله ومهما تراكمت الذنوب طبع على القلوب وعند ذلك يعمى القلب عن إدراك الحق وصلاح الدين ويستهين بأمر الآخرة ويستعظم أمر الدنيا ويصير مقصور الهم عليها فإذا قرع سمعه أمر الآخرة وما فيها من الأخطار دخل من أذن وخرج من أذن ولم يستقر في القلب ولم يحركه إلى التوبة والتدارك أولئك يئسوا من الآخرة كما يئس الكفار من أصحاب القبور وهذا هو معنى اسوداد القلب بالذنوب كما نطق به القرآن والسنة قال ميمون بن مهران إذا أذنب العبد ذنبا نكت في قلبه نكتة سوداء فإذا هو نزع وتاب صقل وإن عاد زيد فيها حتى يعلو قلبه فهو الران وقد قال النبي صلى الله عليه وسلم قلب المؤمن أجرد فيه سراج يزهر وقلب الكافر أسود منكوس فطاعة الله سبحانه بمخالفة الشهوات مصقلة للقلب ومعاصيه مسودات له فمن أقبل على المعاصي اسود قلبه ومن أتبع السيئة الحسنة ومحا أثرها لم يظلم قلبه ولكن ينقص نوره كالمرآة التي يتنفس فيها ثم تمسح ويتنفس ثم تتمسح فإنها لا تخلو عن كدورة وقد قال صلى الله عليه وسلم القلوب أربعة قلب أجرد فيه سراج يزهر فذلك قلب المؤمن وقلب أسود منكوس فذلك قلب الكافر وقلب أغلف مربوط على غلافه فذلك قلب المنافق وقلب مصفح فيه إيمان ونفاق فمثل الإيمان فيه كمثل البقلة يمدها الماء الطيب ومثل النفاق فيه كمثل القرحة يمدها القيح والصديد فأي المادتين غلبت عليه حكم له بها وفي رواية ذهبت به قال الله تعالى إن الذين اتقوا إذا مسهم طائف من الشيطان تذكروا فإذا هم مبصرون فأخبر أن جلاء القلب وإبصاره يحصل بالذكر وأنه لا يتمكن منه إلا الذين اتقوا فالتقوى باب الذكر والذكر باب الكشف والكشف باب الفوز الأكبر وهو الفوز بلقاء الله تعالى.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, it is the sealing [tab'] and it is the stain [rayn]. Allah the Exalted says: \"No! Rather, what they have earned has stained their hearts [qulub].\" (83:14). And He, the Mighty and Majestic, says: \"If We willed, We could strike them for their sins and seal [natba'u] their hearts [qulub], and they would not hear.\" (7:100). Thus, He linked the absence of hearing to the sealing [tab'] due to sins, just as He linked hearing to God-consciousness [taqwa], saying: \"And be conscious of God and listen.\" (5:108), and \"And be conscious of God, and God will teach you.\" (2:282). Whenever sins accumulate, the heart [qalb] is sealed [yutba'u], and at that point the heart [qalb] becomes blind to perceiving the truth [haqq] and the rectitude of religion [din], and it belittles the matter of the Hereafter [Akhira] and magnifies the matter of the world [dunya], and its concern becomes restricted to it. So when its ear is struck with the matter of the Hereafter [Akhira] and the perils within it, it enters one ear and exits the other, and it does not settle in the heart [qalb] nor move it to repentance [tawba] and recovery. Those have despaired of the Hereafter [Akhira] as the disbelievers despair of the companions of the graves. This is the meaning of the heart's [qalb] blackening by sins, as declared by the Quran and the Sunnah. Maymun ibn Mihran said: \"When a servant commits a sin, a black spot is imprinted on his heart [qalb]. If he desists and repents, it is polished. But if he returns, it is increased in him until it covers his heart [qalb]—that is the stain [rayn].\" And the Prophet, peace be upon him, said: \"The heart [qalb] of the believer is bare, with a shining lamp within it. And the heart [qalb] of the disbeliever is black, inverted.\" Obedience to God, glorified is He, by opposing desires is a polisher for the heart [qalb], and His disobediences blacken it. So whoever inclines to disobediences, his heart [qalb] blackens. And whoever follows a bad deed with a good deed and erases its trace, his heart [qalb] is not darkened, but its light [nur] diminishes, like a mirror into which one breathes, then it is wiped, then one breathes, then it is wiped—it is not free from cloudiness. And he, peace be upon him, said: \"Hearts [qulub] are of four kinds: a bare heart [qalb] with a shining lamp within it—that is the heart [qalb] of the believer; a black, inverted heart [qalb]—that is the heart [qalb] of the disbeliever; a wrapped heart [qalb], bound upon its covering—that is the heart [qalb] of the hypocrite; and a layered heart [qalb] containing faith [iman] and hypocrisy [nifaq]—the likeness of faith [iman] within it is like a plant nourished by pure water, and the likeness of hypocrisy [nifaq] within it is like an ulcer nourished by pus and blood. Whichever of the two nourishments prevails over him, he is judged by it.\" And in a narration: \"It takes him away.\" Allah the Exalted says: \"Indeed, those who are conscious of God [muttaqun]—when an impulse from Satan touches them, they remember [dhikr] and at once they have insight [basar].\" (7:201). He informed that the polishing [jala'] of the heart [qalb] and its insight [basar] are attained through remembrance [dhikr], and that none can attain it except those who are conscious [ittaqaw]. So God-consciousness [taqwa] is the gate to remembrance [dhikr], and remembrance [dhikr] is the gate to unveiling [kashf], and unveiling [kashf] is the gate to the greatest success [fawz al-akbar], which is success in meeting Allah the Exalted.\n            </div>\n        </div>\n        "}},"15":{"w":[{"b":"0.08","h":"0.95","c":"كَلَّا","d":"kallā","e":"Nay!"},{"b":"0.58","h":"3.27","c":"إِنَّهُمْ","d":"innahum","e":"Indeed they"},{"b":"4.0","h":"5.25","c":"عَنْ","d":"ʿan","e":"from"},{"b":"4.2","h":"5.58","c":"رَبِّهِمْ","d":"rabbihim","e":"their Lord"},{"b":"5.5","h":"7.74","c":"يَوْمَئِذٍ","d":"yawma-idhin","e":"that Day"},{"b":"6.7","h":"9.51","c":"لَمَحْجُوبُونَ","d":"lamaḥjūbūna","e":"surely will be partitioned"}],"a":{"g":"No! Indeed, from their Lord, that Day, they will be partitioned.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فبالنزوع إلى الدنيا يحجب عن لقاء الله تعالى، وعند الحجاب تتسلط عليه نار جهنم، إذ النار غير مسلطة إلا على محجوب. قال الله تعالى: \" كلا إنهم عن ربهم يومئذ لمحجوبون، ثم إنهم لصالو الجحيم \"، فرتب العذاب بالنار على ألم الحجاب، وألم الحجاب كاف من غير علاوة النار، فكيف إذا أضيفت العلاوة إليه؟\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, by inclining towards the world [al-dunya], one is veiled from the meeting with God, the Most High. And at the moment of being veiled [al-hijab], the fire of Hell [jahannam] gains mastery over him, for the fire is only given mastery over one who is veiled [mahjub]. God, the Most High, has said: \"No indeed! They shall on that day be veiled [mahjubun] from their Lord. Then indeed they shall roast in Hellfire [al-jahim].\" Thus, He made the punishment by the fire contingent upon the pain of the veil [al-hijab]. And the pain of the veil [al-hijab] is sufficient without the addition of the fire, so how will it be when the addition is appended to it?\n            </div>\n        </div>\n        "}},"16":{"w":[{"b":"0.1","h":"0.4","c":"ثُمَّ","d":"thumma","e":"Then"},{"b":"1.4","h":"1.76","c":"إِنَّهُمْ","d":"innahum","e":"indeed they"},{"b":"3.4","h":"3.74","c":"لَصَالُوا","d":"laṣālū","e":"(surely) will burn"},{"b":"4.2","h":"5.34","c":"الْجَحِيمِ","d":"l-jaḥīmi","e":"(in) the Hellfire"}],"a":{"g":"Then indeed, they will [enter and] burn in Hellfire."}},"17":{"w":[{"b":"0.09","h":"0.3","c":"ثُمَّ","d":"thumma","e":"Then"},{"b":"1.1","h":"1.41","c":"يُقَالُ","d":"yuqālu","e":"it will be said"},{"b":"2.0","h":"2.79","c":"هَذَا","d":"hādhā","e":"This"},{"b":"2.7","h":"3.87","c":"الَّذِي","d":"alladhī","e":"(is) what"},{"b":"3.5","h":"5.37","c":"كُنْتُمْ","d":"kuntum","e":"you used (to)"},{"b":"6.2","h":"7.8","c":"بِهِ","d":"bihi","e":"[of it]"},{"b":"6.9","h":"8.86","c":"تُكَذِّبُونَ","d":"tukadhibūna","e":"deny"}],"a":{"g":"Then it will be said [to them], \"This is what you used to deny.\""}},"18":{"w":[{"b":"0.13","h":"0.8","c":"كَلَّا","d":"kallā","e":"Nay!"},{"b":"2.0","h":"1.49","c":"إِنَّ","d":"inna","e":"Indeed"},{"b":"3.5","h":"4.22","c":"كِتَابَ","d":"kitāba","e":"(the) record"},{"b":"4.4","h":"5.76","c":"الْأَبْرَارِ","d":"l-abrāri","e":"(of) the righteous"},{"b":"5.7","h":"7.93","c":"لَفِي","d":"lafī","e":"(will be) surely in"},{"b":"6.2","h":"8.97","c":"عِلِّيِّينَ","d":"ʿilliyyīna","e":"Illiyin"}],"a":{"g":"No! Indeed, the record of the righteous is in 'illiyyun.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                والشراب عبارة عن جملة نعيم الجنان، كما أن الكتاب عبر به عن جميع الأعمال فقال: \" إن كتاب الأبرار لفي عليين \" ثم قال: \"يشهده المقربون \" فكان أمارة علة كتابهم أنه ارتفع إلى حيث يشهده المقربون، وكما أن الأبرار يجدون المزيد في حالهم ومعرفتهم بقربهم من المقربين ومشاهدتهم لهم، فكذلك يكون حالهم في الآخرة \" ما خلقكم ولا بعثكم إلا كنفس واحدة كما بدأنا أول خلق نعيده \"، وكما قال تعالى: \" جزاء وفاقاً \" أي وافق الجزاء أعمالهم فقوبل الخالص بالصرف من الشراب وقوبل المشوب بالمشوب، وشوب كل شراب على قدر ما سبق من الشوب في حبه وأعماله \" فمن يعمل مثقال ذرة خيراً يره ومن يعمل مثقال ذرة شراً يره - وإن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم - إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها - وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين \" فمن كان حبه في الدنيا رجاءه لنعيم الجنة والحور العين والقصور مكن من الجنة ليتبوأ منها حيث يشاء فيلعب مع الولدان ويتمتع بالنسوان؛ فهناك تنتهي لذته في الآخرة لأنه إنما يعطى كل إنسان في المحبة ما تشتهيه نفسه وتلذ عينه. ومن كان مقصده رب الدار ومالك الملك ولم يغلب عليه إلا حبه بالإخلاص والصدق، أنزل \" في مقعد صدق عند مليك مقتدر \" فالأبرار يرتعون في البساتين ويتنعمون في الجنان مع الحور العين والولدان، والمقربون ملازمون للحضرة عاكفون بطرفهم عليها يستحقرون نعيم الجنان بالإضافة إلى ذرة منها فقوم بقضاء شهوة البطن والفرج مشغولون، وللمجالسة أقوام آخرون، ولذلك قال رسول الله ﭬ: \" أكثر أهل الجنة البله وعليون لذوي الألباب\" ولما قصرت الأفهام عن درك معنى عليين عظم أمره فقال: \" وما أدراك ما عليون \" كما قال تعالى: \" القارعة ما القارعة وما أدراك ما القارعة \".\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the drink [sharab] is an expression for the totality of the bliss of Paradise [jinan], just as the book [kitab] was used as an expression for all deeds, as He said: \"Indeed, the record of the righteous [al-abrar] is in 'Illiyyun.\" Then He said: \"Witnessed by those brought near [al-muqarrabun].\" Thus, it was a sign that the cause of their record was its elevation to where it is witnessed by those brought near. And just as the righteous find increase in their state and their knowledge [ma'rifa] through their proximity to those brought near and their witnessing of them, so too will be their state in the Hereafter: \"He did not create you nor resurrect you except as a single soul. As We began the first creation, We will repeat it.\" And as the Almighty said: \"A reward in accordance [jaza'an wifaqan]\" — meaning the reward corresponded to their deeds. So the pure was met with the pure from the drink, and the mixed was met with the mixed. And the mixture [shawb] of every drink is according to the measure of what preceded of mixture in his love [hubb] and his deeds. \"So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it.\" — \"And indeed, Allah does not change the condition of a people until they change what is in themselves.\" — \"Indeed, Allah does not do injustice, [even] as much as an atom's weight. And if there is a good deed, He multiplies it.\" — \"And if it is the weight of a mustard seed, We will bring it forth. And sufficient are We as accountants.\" So whoever, in this world [dunya], his love was his hope for the bliss of Paradise, the maidens with large, [beautiful] eyes, and the palaces, he is granted power in Paradise to settle wherever he wishes, to play with the eternal youths and enjoy the women. There, in the Hereafter, his pleasure ends, for indeed, every person is given in love what his soul [nafs] desires and his eye delights in. But whoever his aim was the Lord of the Abode and the Owner of Sovereignty, and nothing dominated him except his love with sincerity [ikhlas] and truthfulness [sidq], he is settled \"in a seat of honor near a Sovereign, Perfect in Ability.\" Thus, the righteous graze in the gardens and delight in the Paradises with the maidens and the eternal youths, while those brought near are constant in the Presence [al-hadra], devoted, their gaze fixed upon It. They consider the bliss of Paradise insignificant compared to an atom of It. For some people are preoccupied with satisfying the appetite of the belly and the private parts, and for companionship there are other people. And for this reason, the Messenger of Allah, peace and blessings be upon him, said: \"The majority of the inhabitants of Paradise are the simple-minded, and 'Illiyyun is for the people of understanding.\" And when understandings fell short of grasping the meaning of 'Illiyyun, He magnified its matter, saying: \"And what can make you know what is 'Illiyyun?\" just as the Almighty said: \"The Striking Calamity - what is the Striking Calamity? And what can make you know what is the Striking Calamity?\"\n            </div>\n        </div>\n        "}},"19":{"w":[{"b":"0.25","h":"0.6","c":"وَمَا","d":"wamā","e":"And what"},{"b":"2.0","h":"2.29","c":"أَدْرَاكَ","d":"adrāka","e":"can make you know"},{"b":"3.0","h":"4.27","c":"مَا","d":"mā","e":"what"},{"b":"3.4","h":"4.89","c":"عِلِّيُّونَ","d":"ʿilliyyūna","e":"(is) Illiyun"}],"a":{"g":"And what can make you know what is 'illiyyun?"}},"20":{"w":[{"b":"0.06","h":"0.4","c":"كِتَابٌ","d":"kitābun","e":"A book"},{"b":"1.8","h":"2.83","c":"مَرْقُومٌ","d":"marqūmun","e":"written"}],"a":{"g":"It is [their destination recorded in] a register inscribed"}},"21":{"w":[{"b":"0.08","h":"0.45","c":"يَشْهَدُهُ","d":"yashhaduhu","e":"Witness it"},{"b":"1.0","h":"2.73","c":"الْمُقَرَّبُونَ","d":"l-muqarabūna","e":"those brought near"}],"a":{"g":"Which is witnessed by those brought near [to Allah]."}},"22":{"w":[{"b":"0.12","h":"0.15","c":"إِنَّ","d":"inna","e":"Indeed"},{"b":"1.5","h":"1.53","c":"الْأَبْرَارَ","d":"l-abrāra","e":"the righteous"},{"b":"2.7","h":"3.67","c":"لَفِي","d":"lafī","e":"(will be) surely in"},{"b":"3.3","h":"4.84","c":"نَعِيمٍ","d":"naʿīmin","e":"bliss"}],"a":{"g":"Indeed, the righteous will be in pleasure"}},"23":{"w":[{"b":"0.17","h":"0.45","c":"عَلَى","d":"ʿalā","e":"On"},{"b":"0.58","h":"1.15","c":"الْأَرَائِكِ","d":"l-arāiki","e":"thrones"},{"b":"3.3","h":"4.32","c":"يَنْظُرُونَ","d":"yanẓurūna","e":"observing"}],"a":{"g":"On adorned couches, observing."}},"24":{"w":[{"b":"0.03","h":"0.65","c":"تَعْرِفُ","d":"taʿrifu","e":"You will recognize"},{"b":"0.86","h":"1.9","c":"فِي","d":"fī","e":"in"},{"b":"1.3","h":"2.73","c":"وُجُوهِهِمْ","d":"wujūhihim","e":"their faces"},{"b":"2.5","h":"4.92","c":"نَضْرَةَ","d":"naḍrata","e":"(the) radiance"},{"b":"3.5","h":"6.77","c":"النَّعِيمِ","d":"l-naʿīmi","e":"(of) bliss"}],"a":{"g":"You will recognize in their faces the radiance of pleasure."}},"25":{"w":[{"b":"0.2","h":"0.3","c":"يُسْقَوْنَ","d":"yus'qawna","e":"They will be given to drink"},{"b":"1.1","h":"1.92","c":"مِنْ","d":"min","e":"of"},{"b":"1.3","h":"2.15","c":"رَحِيقٍ","d":"raḥīqin","e":"a pure wine"},{"b":"3.6","h":"5.19","c":"مَخْتُومٍ","d":"makhtūmin","e":"sealed"}],"a":{"g":"They will be given to drink [pure] wine [which was] sealed.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ومن امتزج بحبه حب غير الله تنعم في الآخرة بقدر حبه، إذ يمزج شرابه بقدر من شراب المقربين كما قال تعالى في الأبرار: \" إن الأبرار لفي نعيم \" ثم قال: \" يسقون من رحيق مختوم مسك وفي ذلك فليتنافس المتنافسون ومزاجه من تسنيم عيناً يشرب بها المقربون \" فإذا طاب شراب الأبرار لشوب الشراب الصرف الذي هو للمقربين.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, whoever mixes with his love [hubb] for God the love of other than God will enjoy bliss [na'eem] in the Hereafter [Akhira] in proportion to his love, for his drink will be mixed with a measure from the drink of the Brought-Near [al-Muqarrabun], just as God, the Exalted, said concerning the Righteous [al-Abrar]: \"Indeed, the Righteous are in bliss,\" then He said: \"They will be given to drink of a pure wine, sealed, whose seal is musk – so for this let the competitors compete – and whose mixture is of Tasneem, a spring from which drink those brought near.\" Thus, the drink of the Righteous is made pleasant by the admixture of the pure drink which is for the Brought-Near.\n            </div>\n        </div>\n        "}},"26":{"w":[{"b":"0.04","h":"0.4","c":"خِتَامُهُ","d":"khitāmuhu","e":"Its seal"},{"b":"1.3","h":"2.67","c":"مِسْكٌ","d":"mis'kun","e":"(will be of) musk"},{"b":"2.4","h":"5.65","c":"وَفِي","d":"wafī","e":"And for"},{"b":"2.9","h":"6.39","c":"ذَلِكَ","d":"dhālika","e":"that"},{"b":"3.7","h":"7.85","c":"فَلْيَتَنَافَسِ","d":"falyatanāfasi","e":"let aspire"},{"b":"5.4","h":"10.77","c":"الْمُتَنَافِسُونَ","d":"l-mutanāfisūna","e":"the aspirers"}],"a":{"g":"The last of it is musk. So for this let the competitors compete.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ومن امتزج بحبه حب غير الله تنعم في الآخرة بقدر حبه، إذ يمزج شرابه بقدر من شراب المقربين كما قال تعالى في الأبرار: \"إن الأبرار لفي نعيم\" ثم قال: \"يسقون من رحيق مختوم مسك وفي ذلك فليتنافس المتنافسون ومزاجه من تسنيم عيناً يشرب بها المقربون\" فإذا طاب شراب الأبرار لشوب الشراب الصرف الذي هو للمقربين.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, whoever mixes with his love [hubb] for God the love of other than God will enjoy bliss [na'eem] in the Hereafter [Akhira] in proportion to his love, for his drink will be mixed with a measure of the drink of the Brought-Near [al-Muqarrabun], just as God, the Exalted, said concerning the Righteous [al-Abrar]: \"Indeed, the Righteous will be in bliss,\" then He said: \"They will be given to drink of a pure wine, sealed, whose seal is musk – so for this let the competitors compete – and whose mixture is of Tasneem, a spring from which drink those brought near.\" Thus, the drink of the Righteous is made pleasant by the admixture of the pure drink which is for the Brought-Near.\n            </div>\n        </div>\n        "}},"27":{"w":[{"b":"0.15","h":"0.85","c":"وَمِزَاجُهُ","d":"wamizājuhu","e":"And its mixture"},{"b":"1.5","h":"3.31","c":"مِنْ","d":"min","e":"(is) of"},{"b":"2.8","h":"4.43","c":"تَسْنِيمٍ","d":"tasnīmin","e":"Tasnim"}],"a":{"g":"And its mixture is of Tasneem,","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال عبد الله ابن مسعود رضى الله عنه ﴿ ومزاجه من تسنيم ﴾ {} قال يمزج لأصحاب اليمين ويشربه المقربون صرفا.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, its mixture is from Tasneem [Tasneem]. Abdullah ibn Mas'ud, may God be pleased with him, said: It is mixed for the Companions of the Right [Ashab al-Yamin], and the ones brought near [al-Muqarrabun] drink it pure.\n            </div>\n        </div>\n        "}},"28":{"w":[{"b":"0.07","h":"0.8","c":"عَيْنًا","d":"ʿaynan","e":"A spring"},{"b":"1.8","h":"1.9","c":"يَشْرَبُ","d":"yashrabu","e":"will drink"},{"b":"2.5","h":"4.04","c":"بِهَا","d":"bihā","e":"from it"},{"b":"3","h":"4.69","c":"الْمُقَرَّبُونَ","d":"l-muqarabūna","e":"those brought near"}],"a":{"g":"A spring from which those near [to Allah] drink."}},"29":{"w":[{"b":"0.1","h":"0.75","c":"إِنَّ","d":"inna","e":"Indeed"},{"b":"1.4","h":"2.02","c":"الَّذِينَ","d":"alladhīna","e":"those who"},{"b":"2.5","h":"3.68","c":"أَجْرَمُوا","d":"ajramū","e":"committed crimes"},{"b":"3.5","h":"5.3","c":"كَانُوا","d":"kānū","e":"used (to)"},{"b":"4.3","h":"6.82","c":"مِنَ","d":"mina","e":"at"},{"b":"4.7","h":"7.42","c":"الَّذِينَ","d":"alladhīna","e":"those who"},{"b":"5.8","h":"9.12","c":"ءَامَنُوا","d":"āmanū","e":"believed"},{"b":"6.8","h":"10.98","c":"يَضْحَكُونَ","d":"yaḍḥakūna","e":"laugh"}],"a":{"g":"Indeed, those who committed crimes used to laugh at those who believed.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                واليه الاشارة بقوله تعالى: ﴿ ان الذين اجرموا كانوا من الذين امنوا يضحكون واذا مروا بهم يتغامزون واذا انقلبوا الى اهلهم انقلبوا فكهين وإذ رأوهم قالوا ان هؤلاء لضالون وما ارسلوا عليهم حافظين ﴾ {} ثم بين أن ضحك العارفين عليهم غدا اعظم\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, to this the allusion is made by His, the Exalted's, saying: \"Indeed, those who committed crimes [ajramu] used to laugh at those who believed, and when they passed by them, they would wink at one another, and when they returned to their people, they would return jesting, and when they saw them, they would say, 'Indeed, these are truly astray [dallun],' though they were not sent as guardians over them.\"\n\nThen He clarified that the laughter of the knowers [al-'arifin] at them tomorrow is greater.\n            </div>\n        </div>\n        "}},"30":{"w":[{"b":"0.09","h":"0.45","c":"وَإِذَا","d":"wa-idhā","e":"And when"},{"b":"0.96","h":"1.69","c":"مَرُّوا","d":"marrū","e":"they passed"},{"b":"1.7","h":"3.21","c":"بِهِمْ","d":"bihim","e":"by them"},{"b":"2.3","h":"4.21","c":"يَتَغَامَزُونَ","d":"yataghāmazūna","e":"they winked at one another"}],"a":{"g":"And when they passed by them, they would exchange derisive glances."}},"31":{"w":[{"b":"0.03","h":"0.4","c":"وَإِذَا","d":"wa-idhā","e":"And when"},{"b":"0.68","h":"1.22","c":"انْقَلَبُوا","d":"inqalabū","e":"they returned"},{"b":"3.6","h":"4.39","c":"إِلَى","d":"ilā","e":"to"},{"b":"5","h":"6.19","c":"أَهْلِهِمُ","d":"ahlihimu","e":"their people"},{"b":"6.6","h":"7.94","c":"انْقَلَبُوا","d":"inqalabū","e":"they would return"},{"b":"8.2","h":"10","c":"فَكِهِينَ","d":"fakihīna","e":"jesting"}],"a":{"g":"And when they returned to their people, they would return jesting."}},"32":{"w":[{"b":"0.03","h":"0.6","c":"وَإِذَا","d":"wa-idhā","e":"And when"},{"b":"0.79","h":"1.81","c":"رَأَوْهُمْ","d":"ra-awhum","e":"they saw them"},{"b":"1.8","h":"3.67","c":"قَالُوا","d":"qālū","e":"they said"},{"b":"3.8","h":"6.34","c":"إِنَّ","d":"inna","e":"Indeed"},{"b":"5.1","h":"10.22","c":"هَؤُلَاءِ","d":"hāulāi","e":"these"},{"b":"8.8","h":"12.7","c":"لَضَالُّونَ","d":"laḍāllūna","e":"surely have gone astray"}],"a":{"g":"And when they saw them, they would say, \"Indeed, those are truly lost.\""}},"33":{"w":[{"b":"0.03","h":"0.55","c":"وَمَا","d":"wamā","e":"But not"},{"b":"2.3","h":"2.84","c":"أُرْسِلُوا","d":"ur'silū","e":"they had been sent"},{"b":"3.3","h":"4.49","c":"عَلَيْهِمْ","d":"ʿalayhim","e":"over them"},{"b":"4.3","h":"6.41","c":"حَافِظِينَ","d":"ḥāfiẓīna","e":"(as) guardians"}],"a":{"g":"But they had not been sent as guardians over them."}},"34":{"w":[{"b":"0.04","h":"0.85","c":"فَالْيَوْمَ","d":"fal-yawma","e":"So today"},{"b":"1.0","h":"2.34","c":"الَّذِينَ","d":"alladhīna","e":"those who"},{"b":"2.1","h":"3.96","c":"ءَامَنُوا","d":"āmanū","e":"believed"},{"b":"3.1","h":"5.82","c":"مِنَ","d":"mina","e":"at"},{"b":"3.6","h":"6.44","c":"الْكُفَّارِ","d":"l-kufāri","e":"the disbelievers"},{"b":"4.9","h":"8.63","c":"يَضْحَكُونَ","d":"yaḍḥakūna","e":"they will laugh"}],"a":{"g":"So Today those who believed are laughing at the disbelievers,","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وضرورة قول العارفين ان يكونوا ضحكة للجاهلين واليه الاشارة بقوله تعالى: ﴿ ان الذين اجرموا كانوا من الذين امنوا يضحكون واذا مروا بهم يتغامزون واذا انقلبوا الى اهلهم انقلبوا فكهين وإذ رأوهم قالوا ان هؤلاء لضالون وما ارسلوا عليهم حافظين ﴾ {} ثم بين أن ضحك العارفين عليهم غدا اعظم اذ قال تعالى: ﴿ فاليوم الذين آمنوا من الكفار يضحكون على الأرائك ينظرون ﴾ {} وكذلك امة نوح عليه السلام كانوا يضحكون عليه عند اشتغاله بعمل السفينة قال: ﴿ إن تسخروا منا فإنا نسخر منكم كما تسخرون ﴾ {} فهذا احد النظرين.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, it is a necessity for the people of true knowledge [al-'arifin] that they be a source of laughter for the ignorant [al-jahilin]. And to this, the indication is in His Exalted saying: \"Indeed, those who committed crimes used to laugh at those who believed. And when they passed by them, they would exchange derisive glances. And when they returned to their people, they would return jesting. And when they saw them, they would say, 'Indeed, those are truly lost.' But they had not been sent as guardians over them.\" (83:29-33)\n\nThen He made clear that the laughter of the people of knowledge [al-'arifin] over them tomorrow is greater, when He, Exalted is He, said: \"So today those who believed are laughing at the disbelievers, on adorned couches, observing.\" (83:34-35)\n\nAnd likewise, the people of Noah, peace be upon him, used to laugh at him when he was occupied with the work of the Ark. He said: \"If you ridicule us, then indeed we will ridicule you just as you ridicule.\" (11:38)\n\nSo this is one of the two perspectives.\n            </div>\n        </div>\n        "}},"35":{"w":[{"b":"0.07","h":"0.35","c":"عَلَى","d":"ʿalā","e":"On"},{"b":"0.46","h":"0.91","c":"الْأَرَائِكِ","d":"l-arāiki","e":"the thrones"},{"b":"3.3","h":"4.05","c":"يَنْظُرُونَ","d":"yanẓurūna","e":"observing"}],"a":{"g":"On adorned couches, observing."}},"36":{"w":[{"b":"0.14","h":"0.1","c":"هَلْ","d":"hal","e":"Have (not)"},{"b":"0.5","h":"0.59","c":"ثُوِّبَ","d":"thuwwiba","e":"been paid"},{"b":"1.3","h":"2.01","c":"الْكُفَّارُ","d":"l-kufāru","e":"the disbelievers"},{"b":"2.8","h":"4.14","c":"مَا","d":"mā","e":"(for) what"},{"b":"3.2","h":"4.77","c":"كَانُوا","d":"kānū","e":"they used (to)"},{"b":"4.2","h":"6.42","c":"يَفْعَلُونَ","d":"yafʿalūna","e":"do"}],"a":{"g":"Have the disbelievers [not] been rewarded [this Day] for what they used to do?"}}}