{"1":{"w":[{"b":"0.03","h":"0.15","c":"وَالتِّينِ","d":"wal-tīni","e":"By the fig"},{"b":"1.0","h":"1.73","c":"وَالزَّيْتُونِ","d":"wal-zaytūni","e":"and the olive"}],"a":{"g":"By the fig and the olive"}},"2":{"w":[{"b":"0.03","h":"0.15","c":"وَطُورِ","d":"waṭūri","e":"And (the) Mount"},{"b":"0.83","h":"1.43","c":"سِينِينَ","d":"sīnīna","e":"Sinai"}],"a":{"g":"And [by] Mount Sinai","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                ومنها المنقول المنقلب كقوله تعالى ﴿ وطور سينين ﴾ {} أي طورسيناء\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                And from them is the transferred and reversed, as in His saying, the Most High: \"And by Mount Sinai [wa ṭūr sinīn]\" (95:2), meaning Mount Sinai [ṭūr saynā'].\n            </div>\n        </div>\n        "}},"3":{"w":[{"b":"0.03","h":"0.1","c":"وَهَذَا","d":"wahādhā","e":"And this"},{"b":"0.81","h":"1.45","c":"الْبَلَدِ","d":"l-baladi","e":"[the] city"},{"b":"1.6","h":"2.84","c":"الْأَمِينِ","d":"l-amīni","e":"[the] secure"}],"a":{"g":"And [by] this secure city [Makkah],"}},"4":{"w":[{"b":"0.05","h":"0.35","c":"لَقَدْ","d":"laqad","e":"Indeed"},{"b":"0.54","h":"1.1","c":"خَلَقْنَا","d":"khalaqnā","e":"We created"},{"b":"1.3","h":"2.62","c":"الْإِنْسَانَ","d":"l-insāna","e":"man"},{"b":"3.2","h":"5.3","c":"فِي","d":"fī","e":"in"},{"b":"4.9","h":"7.07","c":"أَحْسَنِ","d":"aḥsani","e":"(the) best"},{"b":"5.7","h":"8.43","c":"تَقْوِيمٍ","d":"taqwīmin","e":"mould"}],"a":{"g":"We have certainly created man in the best of stature;","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                فإذن نعم الله تعالى آلات يترقى العبد بها عن اسفل السافلين خلقها الله تعالى لاجل العبد حتى ينال بها سعادة القرب والله تعالى غني عنه قرب ام بعد والعبد فيها بين ان يستعملها في الطاعة فيكون قد شكر لموافقة محبة مولاه وبين ان يستعملها في معصيته فقد كفر لاقتحامه ما يكرهه مولاه ولا يرضاه له فإن الله لا يرضى لعباده الكفر والمعصية وان عطلها ولم يستعملها في طاعة ولا معصية فهو ايضا كفر كفران إن للنعمة بالتضييع وكل ما خلق في الدنيا انما خلق آلة للعبد ليتوصل به الى سعادة الاخرة ونيل القرب من الله تعالى فكل مطيع فهو بقدر طاعته شاكر نعمة الله في الاسباب التي استعملها في الطاعة وكل كسلان ترك الاستعمال او عاص استعملها في طريق البعد فهو كافر جار في غير محبة الله تعالى فالمعصية والطاعة تشملهما المشيئة ولكن لا تشملهما المحبة والكراهة بل رب مراد محبوب وربّ مراد مكروه. ووراء بيان هذه الدقيقة سر القدر الذي منع من افشائه وقد انحل بهذا الاشكال الاول وهو انه اذا لم يكن للمشكور حظ فكيف يكون الشكر وبهذا ايضا ينحل الثاني فانا لم نعن بالشكر الا انصراف نعمة الله في جهة محبة الله فاذا انصرفت النعمة في جهة المحبة بفعل الله فقد حصل المراد وفعلك عطاء من الله تعالى ومن حيث انت محله فقد اثنى عليك وثناؤه نعمة اخرى منه اليك فهو الذي اعطى وهو الذي اثنى وصار احد فعليه سببا لانصراف فعله الثاني الى جهة محبته فله الشكر على كلّ حال وانت موصوف بأنك شاكر بمعنى أنك محل المعنى الذي الشكر عبارة عنه لا بمعنى انك موجب له كما انك موصوف بانك عارف وعالم لا بمعنى انك خالق للعلم وموجده ولكن بمعنى انك محل له وقد وجد بالقدرة الازلية فيك فوصفك بانك شاكر اثبات شيئية لك وانت شيء اذ جعلك خالق الاشياء شيئا وإنما أنت لا شيء إذا كنت أنت ظانا لنفسك شيئا من\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the blessings [ni'am] of God Most High are instruments by which the servant ascends from the lowest of the low. God Most High created them for the sake of the servant, so that he may attain through them the felicity [sa'ada] of proximity [qurb]. And God Most High is independent of him, whether near or far. And the servant, concerning them, is between two states: either he employs them in obedience [ta'a], and thus he has given thanks [shakar] by conforming to the love [mahabba] of his Master; or he employs them in disobedience [ma'siya] to Him, and thus he has disbelieved [kafara] by plunging into what his Master dislikes and does not approve for him. For God does not approve disbelief [kufr] and disobedience for His servants. And if he neglects them and does not employ them in obedience or disobedience, that too is disbelief—a disbelief of ingratitude for the blessing [ni'ma] through waste. And everything created in the world [dunya] was created only as an instrument for the servant, so that he may connect through it to the felicity of the Hereafter [akhira] and attain proximity to God Most High. So every obedient one is, according to the measure of his obedience, thankful for God's blessing in the means [asbab] which he employed in obedience. And every slothful one who abandoned their use, or disobedient one who employed them on the path of remoteness [bu'd], is an ingrate [kafir], straying outside the love of God Most High. Thus, disobedience and obedience are both encompassed by the Will [mashi'a], but they are not both encompassed by Love [mahabba] and Dislike [karaha]. For many a willed thing is beloved, and many a willed thing is disliked. And beyond the clarification of this subtle point lies the secret of Divine Decree [sirr al-qadr], which has been prohibited from being divulged. And by this, the first difficulty is resolved—which is that if the one to be thanked has no share, how can there be thanksgiving? And by this also, the second is resolved. For we did not intend by thanksgiving [shukr] except the directing of God's blessing [ni'ma] towards the direction of God's love [mahabba]. So when the blessing is directed towards the direction of Love by God's action, the intended goal is achieved. And your action is a gift ['ata'] from God Most High, and from the perspective that you are its locus [mahall], He has praised you, and His praise [thana'] is another blessing from Him to you. Thus, He is the One who gives, and He is the One who praises. And your single action became a cause [sabab] for the directing of His second action towards the direction of His love. So to Him belongs the thanks [shukr] in every state. And you are described as being thankful [shakir], meaning that you are the locus of the meaning which thanksgiving expresses, not meaning that you are the agent who brings it about—just as you are described as being one who knows ['arif] and one who has knowledge ['alim], not meaning that you are the creator or originator of knowledge ['ilm], but meaning that you are a locus for it, and it came to be in you through the Eternal Power [al-qudra al-azaliyya]. So describing you as thankful affirms a thingness [shay'iyya] for you, for you are a thing [shay'] since the Creator of things made you a thing. And you are nothing [la shay'] only when you imagine yourself to be a thing independently.\n            </div>\n        </div>\n        "}},"5":{"w":[{"b":"0.03","h":"0.8","c":"ثُمَّ","d":"thumma","e":"Then"},{"b":"1.3","h":"1.93","c":"رَدَدْنَاهُ","d":"radadnāhu","e":"We return him"},{"b":"2.5","h":"4.12","c":"أَسْفَلَ","d":"asfala","e":"(to the) lowest"},{"b":"3.3","h":"5.45","c":"سَافِلِينَ","d":"sāfilīna","e":"(of the) low"}],"a":{"g":"Then We return him to the lowest of the low,"}},"6":{"w":[{"b":"0.03","h":"0.3","c":"إِلَّا","d":"illā","e":"Except"},{"b":"0.56","h":"1.13","c":"الَّذِينَ","d":"alladhīna","e":"those who"},{"b":"1.5","h":"2.77","c":"ءَامَنُوا","d":"āmanū","e":"believe"},{"b":"2.6","h":"4.59","c":"وَعَمِلُوا","d":"waʿamilū","e":"and do"},{"b":"3.3","h":"5.82","c":"الصَّالِحَاتِ","d":"l-ṣāliḥāti","e":"righteous deeds"},{"b":"4.7","h":"8.45","c":"فَلَهُمْ","d":"falahum","e":"then for them"},{"b":"5.6","h":"9.9","c":"أَجْرٌ","d":"ajrun","e":"(is a) reward"},{"b":"6.3","h":"11.07","c":"غَيْرُ","d":"ghayru","e":"never"},{"b":"6.9","h":"12.53","c":"مَمْنُونٍ","d":"mamnūnin","e":"ending"}],"a":{"g":"Except for those who believe and do righteous deeds, for they will have a reward uninterrupted."}},"7":{"w":[{"b":"0.03","h":"0.6","c":"فَمَا","d":"famā","e":"Then what"},{"b":"0.57","h":"1.49","c":"يُكَذِّبُكَ","d":"yukadhibuka","e":"causes you to deny"},{"b":"1.8","h":"3.58","c":"بَعْدُ","d":"baʿdu","e":"after (this)"},{"b":"2.3","h":"4.63","c":"بِالدِّينِ","d":"bil-dīni","e":"the judgment"}],"a":{"g":"So what yet causes you to deny the Recompense?"}},"8":{"w":[{"b":"0.05","h":"0.25","c":"أَلَيْسَ","d":"alaysa","e":"Is not"},{"b":"1.1","h":"1.24","c":"اللَّهُ","d":"l-lahu","e":"Allah"},{"b":"1.7","h":"2.93","c":"بِأَحْكَمِ","d":"bi-aḥkami","e":"(the) Most Just"},{"b":"2.8","h":"4.71","c":"الْحَاكِمِينَ","d":"l-ḥākimīna","e":"(of) the Judges"}],"a":{"g":"Is not Allah the most just of judges?"}}}