{"1":{"w":[{"b":"0.19","h":"0.3","c":"اقْرَأْ","d":"iq'ra","e":"bacalah"},{"b":"0.73","h":"1.35","c":"بِاسْمِ","d":"bi-is'mi","e":"dengan nama"},{"b":"1.3","h":"2.39","c":"رَبِّكَ","d":"rabbika","e":"Tuhanmu"},{"b":"2.2","h":"3.83","c":"الَّذِي","d":"alladhī","e":"yang"},{"b":"3","h":"5.26","c":"خَلَقَ","d":"khalaqa","e":"menciptakan"}],"a":{"g":"Recite in the name of your Lord who created -"}},"2":{"w":[{"b":"0.09","h":"0.3","c":"خَلَقَ","d":"khalaqa","e":"menciptakan"},{"b":"0.72","h":"1.13","c":"الْإِنْسَانَ","d":"l-insāna","e":"manusia"},{"b":"2.7","h":"3.89","c":"مِنْ","d":"min","e":"dari"},{"b":"3.0","h":"4.48","c":"عَلَقٍ","d":"ʿalaqin","e":"segumpal darah"}],"a":{"g":"Created man from a clinging substance."}},"3":{"w":[{"b":"0.06","h":"0.03","c":"اقْرَأْ","d":"iq'ra","e":"bacalah"},{"b":"0.75","h":"1.13","c":"وَرَبُّكَ","d":"warabbuka","e":"dan Tuhanmu"},{"b":"1.7","h":"3.18","c":"الْأَكْرَمُ","d":"l-akramu","e":"amat mulia"}],"a":{"g":"Recite, and your Lord is the most Generous -","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                أول عالم الملكوت مشاهدة القلم الذي يكتب به العلم في لوح القلب وحصول اليقين الذي يمشي به على الماء، أما سمعت قول رسول الله ﭬ في عيسى عليه السلام \" لو زاد يقيناً لمشي على الهواء\" لما قيل له إنه كان يمشي على الماء، فقال السالك السائل: قد تحيرت في أمري واستشعر قلبي خوفاً مما وصفته من خطر الطريق، ولست أدري أطيق قطع هذه المهامة التي وصفتها أم لا؟ فهل لذلك من علامة؟ قال: نعم، افتح بصرك واجمع ضوء عينيك وحدقه نحوي فإن ظهر لك القلم الذي به أكتب في لوح القلب فيشبه أن تكون أهلاً لهذا الطريق، فإن كل من جاوز عالم الجبروت وقرع باباً من أبواب الملكوت كوشف بالقلم، أما ترى أن النبي ﭬ في أول أمره كوشف بالقلم إذ أنزل عليه \" اقرأ وربك الأكرم، الذي علم بالقلم، علم الإنسان ما لم يعلم \" فقال السالك: لقد فتحت بصري وحدقته، فوالله ما أرى قصباً ولا خشباً، ولا أعلم قلماً إلا كذلك، فقال العلم: لقد أبعدت النجعة، أما سمعت أن متاع البيت يشبه رب البيت، أما علمت أن الله تعالى لا تشبه ذاته سوائر الذوات، فكذلك لا تشبه يده الأيدي ولا قلمه الأقلام ولا كلامه سائر الكلام ولا خطه سائر الخطوط، وهذه أمور إلهية من عالم الملكوت، فليس الله تعالى في ذاته بجسم ولا هو في مكان بخلاف غيره، ولا يده لحم وعظم ودم بخلاف الأيدي، ولاقلمه من قصب، ولا لوحه من خشب، ولا كلامه بصوت وحرف، ولا خطه رقم ورسم، ولا حبره زاج وعفص، فإن كنت لا تشاهد هذا هكذا فما أراك إلا مخنثاً بين فحولة التنزيه وأنوثة التشبيه، مذبذباً بين هذا وذا لا إلى هؤلاء ولا إلى هؤلاء، فكيف نزهت ذاته وصفاته تعالى عن الأجسام وصفاتها؟ ونزهت كلامه عن معاني الحروف والأصوات وأخذت تتوقف في يده وقلمه ولوحه وخطه؟\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the first knowledge of the Dominion [al-malakut] is witnessing the Pen [al-qalam] with which knowledge is written upon the Tablet of the Heart [lawh al-qalb], and attaining the Certainty [al-yaqin] by which one walks upon water. Have you not heard the saying of the Messenger of God, peace be upon him, concerning Jesus, upon him be peace: \"Had his certainty increased, he would have walked upon air,\" when it was said to him that he walked upon water?\n\nThen the traveling seeker said: I have become perplexed in my affair, and my heart [qalb] has felt fear from what you have described of the peril of the path. I do not know if I am capable of traversing these vast deserts you have described or not. Is there, for that, any sign?\nHe said: Yes. Open your sight, gather the light of your eyes, and fix your gaze upon me. For if the Pen [al-qalam] with which I write upon the Tablet of the Heart [lawh al-qalb] appears to you, then it is likely you are worthy of this path. Indeed, whoever passes beyond the world of Omnipotence [al-jabarut] and knocks upon a door from the doors of the Dominion [al-malakut] is unveiled to the Pen [al-qalam]. Do you not see that the Prophet, peace be upon him, at the beginning of his affair, was unveiled to the Pen [al-qalam] when was revealed to him: \"Read, and your Lord is the Most Generous, Who taught by the Pen [al-qalam], taught man that which he knew not.\"\n\nThen the traveler said: I have opened my sight and fixed my gaze, and by God, I see neither reed nor wood, and I know of no pen [qalam] except of that kind.\nThen the Knowledge [al-'ilm] said: You have strayed far indeed. Have you not heard that the furnishings of a house resemble the master of the house? Do you not know that God, exalted is He, His Essence is not resembled by other essences? Likewise, His Hand is not resembled by hands, nor His Pen [qalam] by pens, nor His Speech by other speech, nor His Script by other scripts. These are divine matters from the world of the Dominion [al-malakut]. God, exalted is He, is not in His Essence a body, nor is He in a place, unlike others. Nor is His Hand flesh, bone, and blood, unlike hands. Nor is His Pen [qalam] from reed, nor His Tablet from wood, nor His Speech by voice and letter, nor His Script by inscription and form, nor His Ink by vitriol and gallnut. If you do not witness this as such, then I see you only as effeminate between the manliness of Transcendence [al-tanzih] and the femininity of Resemblance [al-tashbih], vacillating between this and that, belonging neither to these nor to those. How have you declared His Essence and His Attributes, exalted is He, transcendent above bodies and their attributes, and declared His Speech transcendent above the meanings of letters and sounds, yet you hesitate concerning His Hand, His Pen [qalam], His Tablet, and His Script?\n            </div>\n        </div>\n        "}},"4":{"w":[{"b":"0.04","h":"0.1","c":"الَّذِي","d":"alladhī","e":"yang"},{"b":"0.97","h":"1.65","c":"عَلَّمَ","d":"ʿallama","e":"Dia mengajar"},{"b":"1.8","h":"3.09","c":"بِالْقَلَمِ","d":"bil-qalami","e":"dengan kalam"}],"a":{"g":"Who taught by the pen -","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال الله تعالى: \" الذي علم بالقلم على الإنسان ما لم يعلم \" ثم قال: \" الرحمن علم القرآن \" وقال: \"علمه البيان \" وقال: \" ثم إن علينا بيانه \" وأول عالم الملكوت مشاهدة القلم الذي يكتب به العلم في لوح القلب وحصول اليقين الذي يمشي به على الماء، أما سمعت قول رسول الله ﭬ في عيسى عليه السلام \" لو زاد يقيناً لمشي على الهواء\" لما قيل له إنه كان يمشي على الماء، فإن كل من جاوز عالم الجبروت وقرع باباً من أبواب الملكوت كوشف بالقلم، أما ترى أن النبي ﭬ في أول أمره كوشف بالقلم إذ أنزل عليه \" اقرأ وربك الأكرم، الذي علم بالقلم، علم الإنسان ما لم يعلم \" فهذه أمور إلهية من عالم الملكوت، فليس الله تعالى في ذاته بجسم ولا هو في مكان بخلاف غيره، ولا يده لحم وعظم ودم بخلاف الأيدي، ولاقلمه من قصب، ولا لوحه من خشب، ولا كلامه بصوت وحرف، ولا خطه رقم ورسم، ولا حبره زاج وعفص.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, God the Exalted has said: \"Who taught by the pen [al-qalam], taught man that which he knew not.\" Then He said: \"The Most Merciful taught the Qur'an.\" And He said: \"He taught him clear expression.\" And He said: \"Then indeed, upon Us is its explanation.\"\n\nAnd the first world [ʿālam] of the Dominion [al-malakūt] is witnessing the pen [al-qalam] with which knowledge [ʿilm] is written upon the tablet [lawḥ] of the heart [qalb], and the attainment of certainty [yaqīn] by which one walks upon water. Have you not heard the saying of the Messenger of God, peace be upon him, concerning Jesus, upon him be peace: \"If his certainty [yaqīn] had increased, he would have walked upon air,\" when it was said to him that he walked upon water? For everyone who traverses the world [ʿālam] of Omnipotence [al-jabarūt] and knocks upon a door from the doors of the Dominion [al-malakūt] is unveiled to the pen [al-qalam]. Do you not see that the Prophet, peace be upon him, at the beginning of his affair, was unveiled to the pen [al-qalam] when was revealed to him: \"Read, and your Lord is the Most Generous, Who taught by the pen [al-qalam], taught man that which he knew not\"?\n\nThese are divine matters from the world [ʿālam] of the Dominion [al-malakūt]. So God the Exalted, in His Essence, is not a body, nor is He in a place unlike others, nor is His Hand flesh and bone and blood unlike hands, nor is His Pen [qalam] from reed, nor His Tablet [lawḥ] from wood, nor His Speech [kalām] by voice and letter, nor His Writing [khaṭṭ] by number and form, nor His Ink [ḥibr] vitriol and gallnut.\n            </div>\n        </div>\n        "}},"5":{"w":[{"b":"0.08","h":"0.03","c":"عَلَّمَ","d":"ʿallama","e":"Dia mengajarkan"},{"b":"0.87","h":"1.25","c":"الْإِنْسَانَ","d":"l-insāna","e":"manusia"},{"b":"2.9","h":"4.12","c":"مَا","d":"mā","e":"apa"},{"b":"3.3","h":"4.9","c":"لَمْ","d":"lam","e":"tidak"},{"b":"3.7","h":"5.51","c":"يَعْلَمْ","d":"yaʿlam","e":"dia ketahui"}],"a":{"g":"Taught man that which he knew not."}},"6":{"w":[{"b":"0.05","h":"0.6","c":"كَلَّا","d":"kallā","e":"sekali-kali tidak"},{"b":"1.1","h":"2.8","c":"إِنَّ","d":"inna","e":"sesungguhnya"},{"b":"3.4","h":"4.17","c":"الْإِنْسَانَ","d":"l-insāna","e":"manusia"},{"b":"5.4","h":"7.05","c":"لَيَطْغَى","d":"layaṭghā","e":"benar-benar melampui batas"}],"a":{"g":"No! [But] indeed, man transgresses","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال تعالى: \" من بعد ما أراكم ما تحبون \" قيل العوافي \" إن الإنسان ليطغى أن رآه استغنى \" وكذلك إذا استغنى بالعافية. قال بعضهم: إنما قال فرعون: أنا ربكم الأعلى لطول العافية، لأنه لبث أربعمائة سنة لم يصدع له رأس ولم يحم له جسم ولم يضرب عليه عرق فادعى الربوبية - لعنه الله - ولو أخذته الشقيقة يوماً لشغلته عن الفضول فضلاً عن دعوى الربوبية.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the Most High has said: \"After He has shown you what you love.\" It is said: [This refers to] well-being [al-'awafi]. \"Indeed, man becomes insolent [yutghi] when he sees himself self-sufficient [istaghna].\" And likewise, when he becomes self-sufficient through well-being. Some of them have said: Indeed, Pharaoh only said, \"I am your Lord, Most High,\" due to the length of his well-being [tawl al-'afiyah], for he remained for four hundred years without a headache afflicting him, without his body suffering a fever, and without a vein throbbing painfully upon him, so he claimed lordship [rububiyyah]—may God curse him—and if a migraine had seized him for a single day, it would have preoccupied him from idle pursuits, let alone from claiming lordship.\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.1","h":"0.03","c":"أَنْ","d":"an","e":"bahwa"},{"b":"0.21","h":"0.15","c":"رَءَاهُ","d":"raāhu","e":"ia melihatnya"},{"b":"1.2","h":"2.11","c":"اسْتَغْنَى","d":"is'taghnā","e":"dia serba cukup"}],"a":{"g":"Because he sees himself self-sufficient."}},"8":{"w":[{"b":"0.06","h":"0.45","c":"إِنَّ","d":"inna","e":"sesungguhnya"},{"b":"1.2","h":"1.78","c":"إِلَى","d":"ilā","e":"kepada"},{"b":"1.7","h":"2.86","c":"رَبِّكَ","d":"rabbika","e":"Tuhanmu"},{"b":"2.6","h":"4.4","c":"الرُّجْعَى","d":"l-ruj'ʿā","e":"tempat kembali"}],"a":{"g":"Indeed, to your Lord is the return."}},"9":{"w":[{"b":"0.09","h":"0.45","c":"أَرَءَيْتَ","d":"ara-ayta","e":"apakah kamu lihat/pendapatmu"},{"b":"1.0","h":"1.99","c":"الَّذِي","d":"alladhī","e":"yang/orang-orang"},{"b":"1.9","h":"3.58","c":"يَنْهَى","d":"yanhā","e":"ia melarang"}],"a":{"g":"Have you seen the one who forbids"}},"10":{"w":[{"b":"0.1","h":"0.4","c":"عَبْدًا","d":"ʿabdan","e":"hamba"},{"b":"0.89","h":"1.75","c":"إِذَا","d":"idhā","e":"apabila"},{"b":"1.4","h":"3.01","c":"صَلَّى","d":"ṣallā","e":"sholat"}],"a":{"g":"A servant when he prays?"}},"11":{"w":[{"b":"0.07","h":"0.25","c":"أَرَءَيْتَ","d":"ara-ayta","e":"apakah kamu lihat/pendapatmu"},{"b":"1.0","h":"1.78","c":"إِنْ","d":"in","e":"jika"},{"b":"1.9","h":"2.9","c":"كَانَ","d":"kāna","e":"adalah"},{"b":"2.5","h":"3.96","c":"عَلَى","d":"ʿalā","e":"atas"},{"b":"3.0","h":"4.85","c":"الْهُدَى","d":"l-hudā","e":"petunjuk"}],"a":{"g":"Have you seen if he is upon guidance"}},"12":{"w":[{"b":"0.06","h":"0.35","c":"أَوْ","d":"aw","e":"atau"},{"b":"0.45","h":"0.89","c":"أَمَرَ","d":"amara","e":"dia menyuruh"},{"b":"1.0","h":"1.95","c":"بِالتَّقْوَى","d":"bil-taqwā","e":"dengan taqwa"}],"a":{"g":"Or enjoins righteousness?"}},"13":{"w":[{"b":"0.1","h":"0.3","c":"أَرَءَيْتَ","d":"ara-ayta","e":"apakah kamu lihat/pendapatmu"},{"b":"1.0","h":"1.86","c":"إِنْ","d":"in","e":"jika"},{"b":"1.9","h":"2.89","c":"كَذَّبَ","d":"kadhaba","e":"mendustakan"},{"b":"2.8","h":"4.48","c":"وَتَوَلَّى","d":"watawallā","e":"dan dia berpaling"}],"a":{"g":"Have you seen if he denies and turns away -"}},"14":{"w":[{"b":"0.06","h":"0.25","c":"أَلَمْ","d":"alam","e":"apakah tidak/tidaklah"},{"b":"0.56","h":"1.04","c":"يَعْلَمْ","d":"yaʿlam","e":"dia mengetahui"},{"b":"2.1","h":"3.09","c":"بِأَنَّ","d":"bi-anna","e":"bahwa sesungguhnya"},{"b":"3.5","h":"4.96","c":"اللَّهَ","d":"l-laha","e":"Allah"},{"b":"4.4","h":"6.6","c":"يَرَى","d":"yarā","e":"Dia melihat"}],"a":{"g":"Does he not know that Allah sees?","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقد قال تعالى ألم يعلم بأن الله يرى وقال الله تعالى إن الله كان عليكم رقيبا وقال ابن المبارك لرجل راقب الله تعالى فسأله عن تفسيره فقال كن أبدا كأنك ترى الله عز وجل وقال عبد الواحد بن زيد إذا كان سيدي رقيبا على فلا أبالى بغيره وقال أبو عثمان المغربي أفضل ما يلزم الإنسان نفسه في هذه الطريقة المحاسبة والمراقبة وسياسة عمله بالعلم وقال ابن عطاء أفضل الطاعات مراقبة الحق على دوام الأوقات وقال الجريري أمرنا هذا مبنى على أصلين أن تلزم نفسك المراقبة لله عز وجل ويكون العلم على ظاهرك قائما وقال أبو عثمان قال لي أبو حفص إذا جلست للناس فكن واعظا لنفسك وقلبك ولا يغرنك اجتماعهم عليك فإنهم يراقبون ظاهرك والله رقيب على باطنك وحكى أنه كان لبعض المشايخ من هذه الطائفة تلميذ شاب وكان يكرمه ويقدمه فقال له بعض أصحابه كيف تكرم هذا وهو شاب ونحن شيوخ فدعا بعدة طيور وناول كل واحد منهم طائرا وسكينا وقال ليذبح كل واحد منكم طائره في موضع لا يراه أحد ودفع إلى الشاب مثل ذلك وقال له كما قال لهم فرجع كل واحد بطائره مذبوحا ورجع الشاب والطائر حي في يده فقال ما لك لم تذبح كما ذبح أصحابك فقال لم أجد موضعا لا يرانى فيه أحد إذ الله مطلع على فى كل مكان فاستحسنوا منه هذه المراقبة وقالوا حق لك أن تكرم وحكى أن زليخا لما همت بيوسف عليه السلام قامت فغطت وجه صنم كان لها فقال يوسف مالك أتستحيين من مراقبة جماد ولا أستحيى من مراقبة الملك الجبار وحكى عن بعض الأحداث أنه راود جارية عن نفسها فقالت له ألا تستحيى فقال ممن أستحيى وما يرانا إلا الكواكب قالت فأين مكوكبها وقال رجل للجنيد بم أستعين على غض البصر فقال بعلمك أن نظر الناظر إليك أسبق من نظرك إلى المنظور إليه وقال الجنيد إنما يتحقق بالمراقبة من يخاف على فوت حظه من ربه\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, does he not know that Allah sees? And Allah, the Most High, has said: \"Indeed, Allah is ever, over you, an Observer [raqīb].\" And Ibn al-Mubārak said to a man, \"Observe [rāqib] Allah, the Most High,\" and he asked him for its interpretation. He said: \"Be, always, as if you see Allah, the Mighty and Majestic.\" And 'Abd al-Wāḥid ibn Zayd said: \"If my Master is an Observer [raqīb] over me, then I care not for any other.\" And Abū 'Uthmān al-Maghribī said: \"The best thing a person can oblige himself with in this path [ṭarīqa] is self-reckoning [muḥāsaba] and vigilant observation [murāqaba], and governing his action by knowledge ['ilm].\" And Ibn 'Aṭā' said: \"The best of acts of obedience is the vigilant observation [murāqaba] of the Truth [al-Ḥaqq] throughout all times.\" And al-Jarīrī said: \"Our affair is built upon two foundations: that you oblige yourself with vigilant observation [murāqaba] for Allah, the Mighty and Majestic, and that knowledge ['ilm] stands established over your outward [ẓāhir].\" And Abū 'Uthmān said: \"Abū Ḥafṣ said to me: 'When you sit with the people, be an admonisher to your own soul [nafs] and your heart [qalb], and let not their gathering around you deceive you, for they observe [yurāqibūn] your outward [ẓāhir], while Allah is an Observer [raqīb] over your inward [bāṭin].'\"\n\nAnd it is related that one of the shaykhs of this group had a young student, and he would honor him and give him precedence. One of his companions said to him, \"How do you honor this one when he is young and we are elders?\" So he called for several birds and gave each one of them a bird and a knife, and said, \"Let each of you slaughter his bird in a place where no one sees him,\" and he gave the young man the same and said to him as he had said to them. Each one returned with his bird slaughtered, but the young man returned with the bird alive in his hand. He said, \"What is the matter with you? Did you not slaughter as your companions slaughtered?\" He said, \"I did not find a place where no one sees me, since Allah is overseeing [muṭṭali'] over me in every place.\" They approved of this vigilant observation [murāqaba] from him and said, \"You deserve to be honored.\"\n\nAnd it is related that when Zulaykhā desired Yūsuf, peace be upon him, she stood and covered the face of an idol she had. So Yūsuf said, \"What is the matter with you? Are you shy of the observation [murāqaba] of an inanimate object, yet I am not shy of the observation [murāqaba] of the Compelling Sovereign [al-Jabbār]?\"\n\nAnd it is related concerning a youth that he tried to seduce a slave-girl. She said to him, \"Do you not feel shame [ḥayā']?\" He said, \"From whom should I feel shame? Nothing sees us except the stars.\" She said, \"Then where is the One who makes them revolve?\" And a man said to al-Junayd, \"With what shall I seek help in lowering my gaze?\" He said, \"With your knowledge ['ilm] that the gaze of the One who sees you is swifter than your gaze to that which you look upon.\" And al-Junayd said: \"Only he who fears the loss of his portion [ḥaẓẓ] from his Lord truly realizes vigilant observation [murāqaba].\"\n            </div>\n        </div>\n        "}},"15":{"w":[{"b":"0.08","h":"0.2","c":"كَلَّا","d":"kallā","e":"sekali-kali tidak"},{"b":"1.4","h":"3.25","c":"لَئِنْ","d":"la-in","e":"sungguh jika"},{"b":"1.8","h":"3.74","c":"لَمْ","d":"lam","e":"tidak"},{"b":"2.4","h":"4.65","c":"يَنْتَهِ","d":"yantahi","e":"dia berhenti"},{"b":"3.8","h":"6.68","c":"لَنَسْفَعًا","d":"lanasfaʿan","e":"niscaya kami pegang/tarik"},{"b":"5.7","h":"9.33","c":"بِالنَّاصِيَةِ","d":"bil-nāṣiyati","e":"dengan umbun-umbun"}],"a":{"g":"No! If he does not desist, We will surely drag him by the forelock -"}},"16":{"w":[{"b":"0.09","h":"0.35","c":"نَاصِيَةٍ","d":"nāṣiyatin","e":"umbun-umbun"},{"b":"1.8","h":"2.97","c":"كَاذِبَةٍ","d":"kādhibatin","e":"pendusta"},{"b":"3.1","h":"5.23","c":"خَاطِئَةٍ","d":"khāṭi-atin","e":"salah/durhaka"}],"a":{"g":"A lying, sinning forelock."}},"17":{"w":[{"b":"0.05","h":"0.8","c":"فَلْيَدْعُ","d":"falyadʿu","e":"maka hendaklah dia memanggil"},{"b":"1.0","h":"2.43","c":"نَادِيَهُ","d":"nādiyahu","e":"kaum/golongannya"}],"a":{"g":"Then let him call his associates;"}},"18":{"w":[{"b":"0.03","h":"0.4","c":"سَنَدْعُ","d":"sanadʿu","e":"kelak Kami memanggil"},{"b":"0.86","h":"1.63","c":"الزَّبَانِيَةَ","d":"l-zabāniyata","e":"Zabaniyah"}],"a":{"g":"We will call the angels of Hell."}},"19":{"w":[{"b":"0.03","h":"0.6","c":"كَلَّا","d":"kallā","e":"sekali-kali"},{"b":"0.88","h":"2.06","c":"لَا","d":"lā","e":"jangan"},{"b":"1.2","h":"2.72","c":"تُطِعْهُ","d":"tuṭiʿ'hu","e":"kamu patuh kepadanya"},{"b":"2.2","h":"4.25","c":"وَاسْجُدْ","d":"wa-us'jud","e":"dan sujudlah"},{"b":"3.2","h":"5.79","c":"وَاقْتَرِبْ","d":"wa-iq'tarib","e":"dan dekatkanlah"}],"a":{"g":"No! Do not obey him. But prostrate and draw near [to Allah].","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                   قال رسول الله ﭬ: (ما تقرب العبد إلى الله بشيء أفضل من سجود خفي[31]) وقال رسول الله ﭬ: (ما من مسلم يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها سيئة[32]) وروى أن رجلا قال لرسول الله ﭬ: ادع الله أن يجعلني من أهل شفاعتك وأن يرزقني مرافقتك في الجنة. فقال ﭬ: أعني بكثرة السجود[33])   وقيل إن أقرب ما يكون العبد من الله تعالى أن يكون ساجدا[34]   وهو معنى قوله عز وجل: ﴿ واسجد واقترب ﴾ {العلق: 19} وقال عز وجل: ﴿ سيماهم في وجوههم من أثر السجود ﴾ {الفتح: 29} فقيل هو ما يلتصق بوجوههم من الأرض عند السجود وقيل هو نور الخشوع فإنه يشرق من الباطن على الظاهر وهو الأصح وقيل هي الغرر التي تكون في وجوههم يوم القيامة من أثر الوضوء.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the servant [al-'abd] draws near to Allah with nothing better than a hidden prostration [sujud khafi]. And indeed, there is no Muslim who prostrates to Allah a single prostration [sajda] except that Allah raises him by it a degree and removes from him by it an evil deed.\n\nAnd it is related that a man said to the Messenger of Allah: \"Pray to Allah that He makes me among the people of your intercession [shafa'a] and that He grants me your companionship in Paradise.\" So he said: \"Help me in that with abundant prostration [kathrat al-sujud].\"\n\nAnd it is said: \"The closest the servant [al-'abd] is to Allah, the Exalted, is when he is in prostration [sajid].\" And this is the meaning of His, the Mighty and Majestic, saying: \"And prostrate [wa-usjud] and draw near [wa-qtarib].\" And His, the Mighty and Majestic, saying: \"Their mark [simahum] is upon their faces from the trace of prostration [athar al-sujud].\" So it is said: it is what clings to their faces from the earth during prostration [sujud]. And it is said: it is the light [nur] of humility [khushu'], for it shines from the inner [batin] upon the outer [zahir], and this is the most sound. And it is said: it is the bright marks [al-ghurar] that will be upon their faces on the Day of Resurrection from the trace of ablution [athar al-wudu'].\n            </div>\n        </div>\n        "}}}