{"1":{"w":[{"b":"0.04","h":"0.65","c":"إِذَا","d":"idhā","e":"apabila"},{"b":"0.62","h":"1.48","c":"زُلْزِلَتِ","d":"zul'zilati","e":"digoncangkan"},{"b":"1.7","h":"3.19","c":"الْأَرْضُ","d":"l-arḍu","e":"bumi"},{"b":"2.5","h":"4.53","c":"زِلْزَالَهَا","d":"zil'zālahā","e":"goncangan"}],"a":{"g":"When the earth is shaken with its [final] earthquake"}},"2":{"w":[{"b":"0.07","h":"0.45","c":"وَأَخْرَجَتِ","d":"wa-akhrajati","e":"dan mengeluarkan"},{"b":"1.3","h":"2.34","c":"الْأَرْضُ","d":"l-arḍu","e":"bumi"},{"b":"2.1","h":"3.68","c":"أَثْقَالَهَا","d":"athqālahā","e":"beban beratnya"}],"a":{"g":"And the earth discharges its burdens"}},"3":{"w":[{"b":"0.15","h":"0.3","c":"وَقَالَ","d":"waqāla","e":"dan berkata"},{"b":"0.86","h":"1.61","c":"الْإِنْسَانُ","d":"l-insānu","e":"manusia"},{"b":"3.2","h":"4.35","c":"مَا","d":"mā","e":"apa"},{"b":"3.7","h":"5.1","c":"لَهَا","d":"lahā","e":"ia"}],"a":{"g":"And man says, \"What is [wrong] with it?\" -"}},"4":{"w":[{"b":"0.09","h":"0.6","c":"يَوْمَئِذٍ","d":"yawma-idhin","e":"pada hari itu"},{"b":"2.0","h":"2.96","c":"تُحَدِّثُ","d":"tuḥaddithu","e":"ia menceritakan"},{"b":"3.2","h":"4.78","c":"أَخْبَارَهَا","d":"akhbārahā","e":"beritanya"}],"a":{"g":"That Day, it will report its news"}},"5":{"w":[{"b":"0.06","h":"0.3","c":"بِأَنَّ","d":"bi-anna","e":"karena sesungguhnya"},{"b":"1.7","h":"1.83","c":"رَبَّكَ","d":"rabbaka","e":"Tuhanmu"},{"b":"2.6","h":"3.5","c":"أَوْحَى","d":"awḥā","e":"talah mewahyukan/memerintahkan"},{"b":"3.5","h":"5.18","c":"لَهَا","d":"lahā","e":"padanya"}],"a":{"g":"Because your Lord has commanded it."}},"6":{"w":[{"b":"0.05","h":"0.4","c":"يَوْمَئِذٍ","d":"yawma-idhin","e":"pada hari itu"},{"b":"1.9","h":"2.88","c":"يَصْدُرُ","d":"yaṣduru","e":"keluar"},{"b":"2.8","h":"4.24","c":"النَّاسُ","d":"l-nāsu","e":"manusia"},{"b":"4.4","h":"6.04","c":"أَشْتَاتًا","d":"ashtātan","e":"bermacam-macam"},{"b":"5.4","h":"7.79","c":"لِيُرَوْا","d":"liyuraw","e":"untuk mereka lihat"},{"b":"6.5","h":"9.47","c":"أَعْمَالَهُمْ","d":"aʿmālahum","e":"amal-amal mereka"}],"a":{"g":"That Day, the people will depart separated [into categories] to be shown [the result of] their deeds.","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                وقال تعالى يومئذ يصدر الناس أشتاتا ليروا أعمالهم فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره فعرف أرباب البصائر من جملة العباد أن الله تعالى لهم بالمرصاد وأنهم سيناقشون في الحساب ويطالبون بمثاقيل الذر من الخطرات واللحظات وتحققوا أنه لا ينجيهم من هذه الأخطار إلا لزوم المحاسبة وصدق المراقبة ومطالبة النفس في الأنفاس والحركات ومحاسبتها في الخطرات واللحظات فمن حاسب نفسه قبل أن يحاسب خف في القيامة حسابه وحضر عند السؤال جوابه وحسن منقلبه ومآبه ومن لم يحاسب نفسه دامت حسراته وطالت في عرصات القيامة وقفاته وقادته إلى الخزى والمقت سيئاته فلما انكشف لهم ذلك علموا أنه لا ينجيهم منه إلا طاعة الله وقد أمرهم بالصبر والمرابطة فقال عز من قائل يا أيها الذين آمنو اصبروا وصابروا ورابطوا فرابطوا أنفسهم أولا بالمشارطة ثم بالمراقبة ثم بالمحاسبة ثم بالمعاقبة ثم بالمجاهدة ثم بالمعاتبة فكانت لهم في المرابطة ست مقامات ولا بد من شرحها وبيان حقيقتها وفضيلتها وتفصيل الأعمال فيها وأصل ذلك المحاسبة ولكن كل حساب فبعد مشارطة ومراقبة ويتبعه عند الخسران المعاتبة والمعاقبة.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, on that Day, the people will proceed in diverse groups to be shown their deeds. So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it. Thus, the possessors of insight [ulu al-basa'ir] from among the servants came to know that Allah, the Exalted, lies in wait for them, and that they will be scrutinized in the Reckoning [hisab] and held accountable for the atom's weights of glances [lahazat] and passing thoughts [khawatir]. And they realized that nothing will save them from these perils except adhering to self-reckoning [muhasaba] and sincere self-observation [muraqaba], and holding the soul [nafs] to account for every breath and movement, and reckoning with it for every passing thought and glance. For whoever holds his soul to account before he is held to account, his reckoning on the Day of Standing [al-qiyamah] will be lightened, his answer will be present when questioned, and his return and final destination will be good. And whoever does not hold his soul to account, his regrets will be prolonged, and his halts in the plains of the Standing will be lengthy, and his evil deeds will lead him to disgrace and contempt. When this was unveiled to them, they knew that nothing would save them from it except obedience to Allah. And He has commanded them with patience [sabr] and vigilant guarding [murabata], so He, the Mighty and Sublime, said: \"O you who have believed, be patient and endure and guard [rabitū].\" So they began by guarding their souls [anfus]: first, by making a covenant [al-musharata]; then, by self-observation [al-muraqaba]; then, by self-reckoning [al-muhasaba]; then, by self-punishment [al-mu'aqaba]; then, by striving [al-mujahada]; then, by self-reproof [al-mu'ataba]. Thus, for them in vigilant guarding [al-murabata] were six stations [maqamat]. And it is necessary to explain them, clarify their reality and virtue, and detail the works within them. The foundation of all that is self-reckoning [al-muhasaba], but every reckoning is preceded by a covenant [musharata] and self-observation [muraqaba], and is followed, in case of loss, by self-reproof [mu'ataba] and self-punishment [mu'aqaba].\n            </div>\n        </div>\n        "}},"7":{"w":[{"b":"0.03","h":"0.9","c":"فَمَنْ","d":"faman","e":"maka barang siapa"},{"b":"1.3","h":"2.49","c":"يَعْمَلْ","d":"yaʿmal","e":"dia mengerjakan/beramal"},{"b":"2.1","h":"3.54","c":"مِثْقَالَ","d":"mith'qāla","e":"seberat"},{"b":"3.1","h":"5.33","c":"ذَرَّةٍ","d":"dharratin","e":"zarrah/atom"},{"b":"4.2","h":"7.14","c":"خَيْرًا","d":"khayran","e":"kebaikan"},{"b":"5.8","h":"8.92","c":"يَرَهُ","d":"yarahu","e":"dia melihatnya"}],"a":{"g":"So whoever does an atom's weight of good will see it,","ihya":"\n        <div class=\"ihya-tafsir-box\" style=\"margin-top: 15px; border-top: 1px solid #eee; padding-top: 10px;\">\n            <h5 style=\"color: #91740c; font-family: Cabin, sans-serif;\">Tafsir Al-Ihya</h5>\n            <div class=\"ihya-arabic\" style=\"font-family: IndoPak; font-size: 18px; text-align: right; margin-bottom: 10px; color: #555;\">\n                بيان حكم العمل المشوب واستحقاق الثواب به\nاعلم أن العمل إذا لم يكن خالصا لوجه الله تعالى بل امتزج به شوب من الرياء أو حظوظ النفس فقد اختلف الناس في أن ذلك هل يقتضي ثوابا أم يقتضي عقابا أم لا يقتضي شيئا أصلا فلا يكون له ولا عليه أما الذي لم يرد به إلا الرياء فهو عليه قطعا وهو سبب المقت والعقاب وأما الخالص لوجه الله تعالى فهو سبب الثواب وإنما النظر في المشوب وظاهر الأخبار تدل على أنه لا ثواب له \nوليس تخلو الأخبار عن تعارض فيه والذي ينقدح لما فيه والعلم عند الله أن ينظر إلى قدر قوة الباعث فإن كان الباعث الديني مساويا للباعث النفسي تقاوما وتساقطا وصار العمل لا له ولا عليه وإن كان باعث الرياء أغلب وأقوى فهو ليس بنافع وهو مع ذلك مضر ومفض للعقاب نعم العقاب الذي فيه أخف من عقاب العمل الذي تجرد للرياء ولم يمتزج به شائبه التقرب وإن كان قصد التقرب أغلب بالإضافة إلى الباعث الآخر فله ثواب بقدر ما فضل من قوة الباعث الديني وهذا لقوله تعالى فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره ولقوله تعالى إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها فلا ينبغي أن يضيع قصد الخير بل إن كان غالبا على قصد الرياء حبط منه القدر الذي يساويه وبقيت زيادة وإن كان مغلوبا سقط بسببه شيء من عقوبة القصد الفاسد.\n            </div>\n            <div class=\"ihya-english\" style=\"font-family: Arial; font-size: 14px; text-align: justify; color: #777;\">\n                Indeed, the ruling on mixed action [al-'amal al-mashub] and its deserving of reward: Know that if an action is not purely for the sake of God [li-wajh Allah] Almighty, but is mixed with a taint of ostentation [riya'] or the aims of the self [huzuz al-nafs], people have differed concerning this: does it necessitate a reward, or does it necessitate punishment, or does it necessitate nothing at all, so there is neither for him nor against him? As for that which was intended only for ostentation [riya'], it is against him without doubt, and it is a cause for wrath and punishment. As for that which is purely for the sake of God [li-wajh Allah] Almighty, it is a cause for reward. The consideration is only concerning the mixed [al-mashub].\n\nThe apparent meaning of the reports indicates that there is no reward for it, yet the reports are not free of contradiction concerning it. That which becomes clear to me regarding it—and the knowledge is with God—is to look at the measure of the strength of the motive [ba'ith]. If the religious motive [al-ba'ith al-dini] is equal to the motive of the self [ba'ith al-nafs], they counterbalance and nullify each other, and the action becomes neither for him nor against him. If the motive of ostentation [ba'ith al-riya'] is more dominant and stronger, then it is not beneficial, and it is moreover harmful and leads to punishment. Yes, the punishment within it is lighter than the punishment for the action that was purely for ostentation [riya'] and was not mixed with any element of drawing near [taqarrub].\n\nIf the intention of drawing near [qasd al-taqarrub] is more dominant in comparison to the other motive, then he has a reward according to the measure of what exceeded from the strength of the religious motive [al-ba'ith al-dini]. This is due to His saying, Almighty: \"So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it.\" And His saying, Almighty: \"Indeed, Allah does not do injustice, [even] as much as an atom's weight. And if there is a good deed, He multiplies it.\" Therefore, the intention of good [qasd al-khayr] should not be wasted. Rather, if it was dominant over the intention of ostentation [qasd al-riya'], the portion equal to it is nullified, and the excess remains. If it was dominated, something of the punishment for the corrupt intention [al-qasd al-fasid] is dropped because of it.\n            </div>\n        </div>\n        "}},"8":{"w":[{"b":"0.04","h":"0.2","c":"وَمَنْ","d":"waman","e":"dan barang siapa"},{"b":"1.7","h":"1.6","c":"يَعْمَلْ","d":"yaʿmal","e":"dia mengerjakan/beramal"},{"b":"2.4","h":"2.95","c":"مِثْقَالَ","d":"mith'qāla","e":"seberat"},{"b":"3.4","h":"4.8","c":"ذَرَّةٍ","d":"dharratin","e":"zarrah/atom"},{"b":"5.6","h":"7.04","c":"شَرًّا","d":"sharran","e":"kejahatan"},{"b":"7.5","h":"9.43","c":"يَرَهُ","d":"yarahu","e":"dia melihatnya"}],"a":{"g":"And whoever does an atom's weight of evil will see it."}}}